{
  "url": "https://byjus.com/cbse-class-2-maths-syllabus/",
  "title": "",
  "description": "",
  "units": [],
  "chapters": [],
  "topics": [],
  "marking_scheme": [],
  "raw_content": "",
  "pdf_content": "=== PDF: class_2_maths_1.pdf ===\n--- Page 1 ---\nhttps://byjus.com \nCBSE Class 2 Maths Syllabus \nGeometry (13 hrs.) \na) Shapes and Spatial Understanding\n3-D and 2-D shapes\n\nObserves objects in the environment and gets a qualitative feel for their geometrical\nattributes.\n\nIdentifies the basic 3-D shapes such as cuboid, cylinder, cone, sphere by their names.\n\nTraces the 2-D outlines of 3-D objects.\n\nObserves and identifies these 2-D shapes.\n\nIdentifies 2-D shapes viz., rectangle, square, triangle, circle by their names.\n\nDescribes intuitively the properties of these 2-D shapes.\n\nIdentifies and makes straight lines by folding, straight edged objects, stretched strings\nand draws free hand\nand with a ruler.\n\nDraws horizontal, vertical and slant lines (free hand).\n\nDistinguishes between straight and curved lines.\n\nIdentifies objects by observing their shadows.\nNumbers (46 hrs.) \n\nReads and writes numerals for numbers up to ninety-nine.\n\nExpands a number with respect to place values.\n\nCounts and regroups objects into tens and ones.\n\nUses the concept of place value in the comparison of numbers.\n\nCounts in various ways:\n– Starting from any number.\n– Group counting etc.\n\nArranges numbers upto hundred in ascending and descending order.\n\nForms the greatest and the smallest two digit numbers with and without repetition of\ngiven digits.\n\n\n--- Page 2 ---\nhttps://byjus.com \n \n \n \n \n \nIndicates and identifies the position of an object in a line. \n \na) Addition and Subtraction \n \nAdds and subtracts two digit numbers by drawing representations of tens and ones \nwithout and with \nregrouping. \n \nAdds zero to a number and subtracts zero from a number. \n \nObserves the commutative property of addition through patterns. \n \nSolves addition, subtraction problems presented through pictures and verbal \ndescription. \n \nDescribes orally the situations that correspond to the given addition and subtraction \nfacts. \n \nEstimates the result of addition and subtraction and compares the result with another \ngiven number. \n \nb) Preparation for Multiplication And Division \n \nDiscussion of situations involving repeated addition and situations involving equal \nsharing. \n \nActivities of making equal groups. \n \nc) Mental Arthimatic \n \nAdds and subtracts single-digit numbers mentally. \n \nAdds and subtracts multiples of ten mentally. \n \nMoney (3 hrs.) \n \nIdentifies currency - notes and coins. \n \nPuts together amounts of money not exceeding Rs 50/-. \n \nAdds and subtracts small amounts of money mentally. \n \nTransacts an amount using 3-4 notes. \n \n\n\n--- Page 3 ---\nhttps://byjus.com \n \n \n \n \nMeasurement (13 hrs.) \na) Length \n \nMeasures lengths & distances along short & long paths using uniform (non-standard) \nunits, extends to longer lengths. \n \nb) Weight \n \nCompares two or more objects by their weight. \n \nAppreciates the need for a simple balance. \n \nCompares weights of given objects using simple balance. \n \nc) Capacity (Volume) \n \nCompares and orders containers in terms of internal volume(capacity). \n \nOrders given containers as per their capacities on the basis of perception & verifies by \npouring out etc. \n \nd) Time \n \nGets familiar with the days of the week and months of the year. \n \nGets a feel for sequence of seasons (varying locally). \n \nSequences the events occurring over longer periods in terms of dates/days. \n \nData Handling (6 hrs.) \n \nCollects data through measurement. \n \nRepresents the data followed by discussion (e.g. heights of children). \n \nCollects and presents the data on birthdays. \n \nDraws inferences from the data at the appropriate level. \nPatterns (10 hrs.) \n \nObserves and extends patterns in sequence of shapes and numbers. \n \nSearches for patterns in different ways of splitting a number. \n \nCreates block patterns by stamping thumbprints, leaf prints, vegetable prints, etc. \n \nCreates patterns of regular shapes by stamping. \n",
  "pdf_urls": [
    "https://cdn1.byjus.com/wp-content/uploads/2019/09/CBSE-Class-2-Maths-Syllabus.pdf"
  ],
  "extracted_at": "2026-01-29T11:00:00.778440",
  "pdf_local_files": [
    "syllabus/pdfs/class_2_maths_1.pdf"
  ],
  "pdf_parsed_at": "2026-01-30T13:29:27.455004"
}