{
  "url": "https://byjus.com/cbse-class-1-syllabus/",
  "title": "",
  "description": "",
  "units": [],
  "chapters": [],
  "topics": [],
  "marking_scheme": [],
  "raw_content": "CBSE Class 1 Syllabusmakes the first stage of schooling easy. From here, the journey of a student starts. At this stage, students have a very sharp mind and quick learning ability. They are easily mouldable and can adapt to any environment. So, in these formative years, CBSE Class 1 students should be provided with quality education, which not only helps them in their future ahead but also helps them to explore their abilities. Keeping all these points in mind, the Class 1 Syllabus is designed by the CBSE board. TheCBSE syllabuswill help Class 1 students to become aware about people, things, surroundings, etc.\nThe students need to be up to date with the latest CBSE Class 1 syllabus 2023-24.  It is then that they feel confident when the lessons begin at school. The CBSE syllabus is simple and aids the little ones of Class 1 to learn alongside having fun.\nCBSE Syllabus for Class 1 for All subjects\nCBSE Syllabus for Class 1 emphasizes on generating curiosity and interest among CBSE Class 1 students with stories and poetry.  The primary focus is to prepare children in such a way that they can express their viewpoints clearly and confidently. CBSE Syllabus also aims to create interest in students in reading books and developing required language skills. Access the latest CBSE Class 1 Syllabus for the academic year 2023-2024 by clicking on the link below.\nCBSE Syllabus for Class 1 MathematicsCBSE Syllabus for Class 1 EnglishCBSE Syllabus for Class 1 Hindi\nCBSE Syllabus for Class 1 Mathematics\nCBSE Syllabus for Class 1 Mathematics\nCBSE Syllabus for Class 1 English\nCBSE Syllabus for Class 1 English\nCBSE Syllabus for Class 1 Hindi\nCBSE Syllabus for Class 1 Hindi\nCBSE Syllabus for Class 1 is prescribed the CBSE board. It shares a common goal of scholars of education, teachers and activists to achieve the goal of universalisation of elementary education. The syllabus does not put any burden on children and aims to turn them into free learners. They can exhibit their own talent. Moreover, the syllabus allows children to realise their potential and explore their creativity. The Syllabus for Class 1, consisting of all the subjects, is prepared by the CBSE Board by following the guidelines strictly. The CBSE Class 1 Syllabus covers all the important chapters that students need to study in the respective academic year 2023-2024. Class 1 students are advised to go through the syllabus ofCBSEbefore they dive into their respective studies.\nKeep learning and download the BYJU’S Early Learn App to access interactive study videos.Frequently Asked Questions on CBSE Class 1 Syllabus 2023-24Q1What are the subjects covered in the CBSE Class 1 Syllabus?The subjects covered in the CBSE Class 1 Syllabus are English, Mathematics and Hindi.Q2Why are the subjects in the CBSE Class 1 Syllabus for 2023-24 important?In the CBSE Class 1 Syllabus, Maths, Hindi and English is very important for the learning process among students right from their primary education. It offers a strong base of fundamentals which are important in further studies.Q3What is the use of CBSE Class 1 Syllabus?The Syllabus of CBSE Class 1 plays a crucial role in the exam preparation of students. It enhances confidence among students, which is important to face the exam fearlessly.\nFrequently Asked Questions on CBSE Class 1 Syllabus 2023-24\nWhat are the subjects covered in the CBSE Class 1 Syllabus?\nWhy are the subjects in the CBSE Class 1 Syllabus for 2023-24 important?\nWhat is the use of CBSE Class 1 Syllabus?",
  "pdf_content": "",
  "pdf_urls": [],
  "extracted_at": "2026-01-29T10:59:05.306388"
}