{
  "url": "https://byjus.com/cbse/class-12-maths-syllabus/",
  "title": "",
  "description": "",
  "units": [],
  "chapters": [],
  "topics": [
    "CBSE Class 12 Maths Syllabus 2023-24 PDF"
  ],
  "marking_scheme": [
    {
      "headers": [
        "No.",
        "Units",
        "Marks"
      ],
      "rows": [
        [
          "I.",
          "Relations and Functions",
          "08"
        ],
        [
          "II.",
          "Algebra",
          "10"
        ],
        [
          "III.",
          "Calculus",
          "35"
        ],
        [
          "IV.",
          "Vectors and Three – Dimensional Geometry",
          "14"
        ],
        [
          "V.",
          "Linear Programming",
          "05"
        ],
        [
          "VI.",
          "Probability",
          "08"
        ],
        [
          "",
          "Total Theory",
          "80"
        ],
        [
          "",
          "Internal Assessment",
          "20"
        ],
        [
          "",
          "Grand Total",
          "100"
        ]
      ]
    }
  ],
  "raw_content": "CBSE Syllabus for Class 12 Mathsplays a crucial role in students’ exam preparation. It makes them familiar with the course content of Mathematics subject. Also, students get to know the topics and sub-topics that they are going to study during the academic year. Here, we have provided the CBSE Class 12 Maths Syllabus for 2023-24. The board exam question paper is also designed by referring to the CBSE Class 12 Maths Syllabus. So, students are strictly recommended to follow the Mathematics syllabus for Class 12 and prepare accordingly. By covering the topics mentioned in the syllabus, students can easily score decent marks in theCBSE Class 12exam.\nCBSE Class 12 Maths Syllabus 2023-24\nStudents can download the latest released CBSE Class 12 Maths Syllabus PDF 2023-24 from the link below. Going through the syllabus will help students to know the topics they are going to study in Maths during the academic year. They must refer to it whenever they sit for studies. ThisCBSE SyllabusPDF will help students track a record of all topics they have covered till now and what they have to cover.\nCBSE Class 12 Maths Syllabus 2023-24 PDF\nCBSE Class 12 Maths Syllabus 2023-24 with Marks Distribution\nThe table below shows the marks weightage along with the number of periods required for teaching. The Maths theory paper is of 80 marks, and the internal assessment is of 20 marks which totally comes out to be 100 marks.\nCBSE Class 12 Maths Syllabus And Marks Distribution 2023-24\nMax Marks: 80\nNo.UnitsMarksI.Relations and Functions08II.Algebra10III.Calculus35IV.Vectors and Three – Dimensional Geometry14V.Linear Programming05VI.Probability08Total Theory80Internal Assessment20Grand Total100\nNo.UnitsMarks\nNo.\nUnits\nMarks\nI.Relations and Functions08\nRelations and Functions\nII.Algebra10\nII.\nAlgebra\nIII.Calculus35\nIII.\nCalculus\nIV.Vectors and Three – Dimensional Geometry14\nIV.\nVectors and Three – Dimensional Geometry\nV.Linear Programming05\nLinear Programming\nVI.Probability08\nVI.\nProbability\nTotal Theory80\nTotal Theory\nInternal Assessment20\nInternal Assessment\nGrand Total100\nGrand Total\n100\nUnit-I: Relations and Functions\n1. Relations and Functions\nTypes of relations: reflexive, symmetric, transitive and equivalence relations. One to one and onto functions.\n2. Inverse Trigonometric Functions\nDefinition, range, domain, principal value branch. Graphs of inverse trigonometric functions.\nUnit-II: Algebra\n1. Matrices\nConcept, notation, order, equality, types of matrices, zero and identity matrix, transpose of a matrix, symmetric and skew symmetric matrices. Operations on matrices: Addition and multiplication and multiplication with a scalar. Simple properties of addition, multiplication and scalar multiplication. Noncommutativity of multiplication of matrices and existence of non-zero matrices whose product is the zero matrix (restrict to square matrices of order 2). Invertible matrices and proof of the uniqueness of inverse, if it exists; (Here all matrices will have real entries).\n2. Determinants\nDeterminant of a square matrix (up to 3 x 3 matrices), minors, co-factors and applications of determinants in finding the area of a triangle. Adjoint and inverse of a square matrix. Consistency, inconsistency and number of solutions of system of linear equations by examples, solving system of linear equations in two or three variables (having unique solution) using inverse of a matrix.\nUnit-III: Calculus\n1. Continuity and Differentiability\nContinuity and differentiability, derivative of composite functions, chain rule, derivative of inverse trigonometric functions like sin-1x, cos-1x and tan-1x, derivative of implicit functions. Concept of exponential and logarithmic functions.Derivatives of logarithmic and exponential functions. Logarithmic differentiation, derivative of functions expressed in parametric forms. Second order derivatives.\n2. Applications of Derivatives\nApplications of derivatives: rate of change of quantities, increasing/decreasing functions, maxima and minima (first derivative test motivated geometrically and second derivative test given as a provable tool). Simple problems (that illustrate basic principles and understanding of the subject as well as real-life situations).\n3. Integrals\nIntegration as inverse process of differentiation. Integration of a variety of functions by substitution, by partial fractions and by parts, Evaluation of simple integrals of the following types and problems based on them.\nFundamental Theorem of Calculus (without proof). Basic properties of definite integrals and evaluation of definite integrals.\n4. Applications of the Integrals\nApplications in finding the area under simple curves, especially lines, circles/ parabolas/ellipses (in standard form only)\n5. Differential Equations\nDefinition, order and degree, general and particular solutions of a differential equation. Solution of differential equations by method of separation of variables, solutions of homogeneous differential equations of first order and first degree. Solutions of linear differential equation of the type:\ndy/dx + py = q, where p and q are functions of x or constants.\ndx/dy + px = q, where p and q are functions of y or constants.\nUnit-IV: Vectors and Three-Dimensional Geometry\n1. Vectors\nVectors and scalars, magnitude and direction of a vector. Direction cosines and direction ratios of a vector. Types of vectors (equal, unit, zero, parallel and collinear vectors), position vector of a point, negative of a vector, components of a vector, addition of vectors, multiplication of a vector by a scalar, position vector of a point dividing a line segment in a given ratio. Definition, Geometrical Interpretation, properties and application of scalar (dot) product of vectors, vector (cross) product of vectors.\n2. Three – dimensional Geometry\nDirection cosines and direction ratios of a line joining two points. Cartesian equation and vector equation of a line, skew lines, shortest distance between two lines. Angle between two lines.\nUnit-V: Linear Programming\n1. Linear Programming\nIntroduction, related terminology such as constraints, objective function, optimization, graphical method of solution for problems in two variables, feasible and infeasible regions (bounded or unbounded), feasible and infeasible solutions, optimal feasible solutions (up to three non-trivial constraints).\nUnit-VI: Probability\n1. Probability\nConditional probability, multiplication theorem on probability, independent events, total probability, Bayes’ theorem, Random variable and its probability distribution, mean of random variable.\nStudents can go through theCBSE Class 12 Syllabusto get the detailed syllabus of all subjects. Get access to interactive lessons and videos related to Maths and Science with BYJU’S App/ Tablet.Frequently Asked Questions on CBSE Class 12 Maths Syllabus 2023-24Q1Is Calculus an important chapter in the CBSE Class 12 Maths Syllabus?Yes, Calculus is an important chapter in the CBSE Class 12 Maths Syllabus. It is for 35 marks which means that if a student is thorough with this chapter will be able to pass the final exam.Q2How many units are discussed in the CBSE Class 12 Maths Syllabus?In the CBSE Class 12 Maths Syllabus, about 6 units are discussed, which contains a total of 13 chapters.Q3How many marks are allotted for internals in the CBSE Class 12 Maths syllabus?About 20 marks are allotted for internals in the CBSE Class 12 Maths Syllabus. Students can score it with ease through constant practice.\nFrequently Asked Questions on CBSE Class 12 Maths Syllabus 2023-24\nIs Calculus an important chapter in the CBSE Class 12 Maths Syllabus?\nHow many units are discussed in the CBSE Class 12 Maths Syllabus?\nHow many marks are allotted for internals in the CBSE Class 12 Maths syllabus?",
  "pdf_content": "=== PDF: class_12_maths_1.pdf ===\n--- Page 1 ---\nCLASS-XII (2023-24) \nOne Paper \nMax Marks: 80 \nNo. \nUnits \nNo. of Periods \nMarks \nI. \nRelations and Functions \n30 \n08 \nII. \nAlgebra \n50 \n10 \nIII. \nCalculus \n80 \n35 \nIV. \nVectors and Three - Dimensional Geometry \n30 \n14 \nV. \nLinear Programming \n20 \n05 \nVI. \nProbability \n30 \n08 \nTotal \n240 \n80 \nInternal Assessment \n20 \nUnit-I: Relations and Functions \n1.\nRelations and Functions\n15 Periods \nTypes of relations: reflexive, symmetric, transitive and equivalence relations. One to one and onto \nfunctions. \n2.\nInverse Trigonometric Functions\n 15 Periods \nDefinition, range, domain, principal value branch.  Graphs of inverse trigonometric functions. \nUnit-II: Algebra \n1.\nMatrices\n25 Periods \nConcept, notation, order, equality, types of matrices, zero and identity matrix, transpose of a matrix, \nsymmetric and skew symmetric matrices. Operations on matrices: Addition and multiplication and \nmultiplication with a scalar. Simple properties of addition, multiplication and scalar multiplication. Non- \ncommutativity of multiplication of matrices and existence of non-zero matrices whose product is the \nzero matrix (restrict to square matrices of order 2).  Invertible matrices and proof of the uniqueness of \ninverse, if it exists; (Here all matrices will have real entries). \n2.\nDeterminants\n 25 Periods \nCBSE Class 12 Syllabus for Maths 2023-24\n\n\n--- Page 2 ---\nDeterminant of a square matrix (up to 3 x 3 matrices), minors, co-factors and applications of \ndeterminants in finding the area of a triangle. Adjoint and inverse of a square matrix. Consistency, \ninconsistency and number of solutions of system of linear equations by examples, solving system of \nlinear equations in two or three variables (having unique solution) using inverse of a matrix. \nUnit-III: Calculus \n1.\nContinuity and Differentiability\n20 Periods \nContinuity \nand \ndifferentiability, \nchain \nrule, \nderivative \nof \ninverse \ntrigonometric \nfunctions, \n𝑙𝑖𝑘𝑒sin−1 𝑥, cos−1 𝑥and tan−1 𝑥, derivative of implicit functions. Concept of exponential and logarithmic \nfunctions. \nDerivatives of logarithmic and exponential functions. Logarithmic differentiation, derivative of functions \nexpressed in parametric forms. Second order derivatives. \n2. \nApplications of Derivatives  \n \n \n \n \n          10 Periods \nApplications of derivatives: rate of change of quantities, increasing/decreasing functions, maxima and \nminima (first derivative test motivated geometrically and second derivative test given as a provable \ntool). Simple problems (that illustrate basic principles and understanding of the subject as well as real-\nlife situations). \n3. \nIntegrals \n \n \n \n \n \n \n \n \n20 Periods \nIntegration as inverse process of differentiation. Integration of a variety of functions by substitution, by \npartial fractions and by parts, Evaluation of simple integrals of the following types and problems based \non them. \n∫\ndx\nx2 ± a2, ∫\ndx\n√x2 ± a2 , ∫\ndx\n√a2 −x2 , ∫\ndx\nax2 + bx + c , ∫\ndx\n√ax2 + 𝑏𝑥+ 𝑐\n∫\npx + q\nax2 + bx + c dx, ∫\npx + q\n√ax2+bx + c\ndx, ∫√a2 ± x2 dx, ∫√x2 −a2 dx \n      ∫√𝑎𝑥2 + 𝑏𝑥+ 𝑐 𝑑𝑥,     \nFundamental Theorem of Calculus (without proof). Basic properties of definite integrals and evaluation \nof definite integrals. \n4.\nApplications of the Integrals\n15 Periods \nApplications in finding the area under simple curves, especially lines, circles/ parabolas/ellipses (in \nstandard form only) \n5. \nDifferential Equations \n \n \n \n \n \n \n15 Periods \nDefinition, order and degree, general and particular solutions of a differential equation. Solution of \ndifferential equations by method of separation of variables, solutions of homogeneous differential \nequations of first order and first degree. Solutions of linear differential equation of the type: \n\n\n--- Page 3 ---\ndy\ndx + py = q, where p and q are functions of x or constants.\nd𝑥\nd𝑦+ px = q, where p and q are functions of y or constants.\nUnit-IV: Vectors and Three-Dimensional Geometry\n1. \nVectors \n \n \n \n \n \n \n \n \n 15 Periods\nVectors and scalars, magnitude and direction of a vector. Direction cosines and direction ratios of a \nvector. Types of vectors (equal, unit, zero, parallel and collinear vectors), position vector of a point, \nnegative of a vector, components of a vector, addition of vectors, multiplication of a vector by a scalar, \nposition vector of a point dividing a line segment in a given ratio. Definition, Geometrical Interpretation, \nproperties and application of scalar (dot) product of vectors, vector (cross) product of vectors. \n2. \nThree - dimensional Geometry \n \n \n \n \n \n15 Periods \nDirection cosines and direction ratios of a line joining two points. Cartesian equation and vector equation \nof a line, skew lines, shortest distance between two lines. Angle between two lines.\nUnit-V: Linear Programming \n1.\nLinear Programming\n 20 Periods \nIntroduction, related terminology such as constraints, objective function, optimization, graphical method \nof solution for problems in two variables, feasible and infeasible regions (bounded or unbounded), \nfeasible and infeasible solutions, optimal feasible solutions (up to three non-trivial constraints). \nUnit-VI: Probability \n1.  \nProbability \n \n \n \n \n \n \n \n \n30 Periods \nConditional probability, multiplication theorem on probability, independent events, total probability, \nBayes’ theorem, Random variable and its probability distribution, mean of random variable. \n\n\n--- Page 4 ---\nMATHEMATICS (Code No. - 041) \nQUESTION PAPER DESIGN CLASS - XII \n(2023-24) \nTime: 3 hours \n Max. Marks: 80 \nS. \nNo. \nTypology of Questions \nTotal \nMarks \n% \nWeightage \n1 \nRemembering: Exhibit memory of previously learned material \nby recalling facts, terms, basic concepts, and answers. \nUnderstanding: Demonstrate understanding of facts and \nideas by organizing, comparing, translating, interpreting, giving \ndescriptions, and stating main ideas \n44 \n55 \n2 \nApplying: Solve problems to new situations by applying \nacquired knowledge, facts, techniques and rules in a different \nway. \n20 \n25 \n3 \nAnalysing : \nExamine and break information into parts by identifying \nmotives or causes. Make inferences and find evidence to \nsupport generalizations \nEvaluating: \nPresent and defend opinions by making judgments about \ninformation, validity of ideas, or quality of work based on a set \nof criteria. \nCreating: \nCompile information together in a different way by combining \nelements in a new pattern or proposing alternative solutions \n16 \n20 \nTotal \n80 \n100 \n1.\nNo chapter wise weightage. Care to be taken to cover all the chapters\n2.\nSuitable internal variations may be made for generating various templates keeping the overall\nweightage to different form of questions and typology of questions same.\nChoice(s): \nThere will be no overall choice in the question paper. \nHowever, 33% internal choices will be given in all the sections \nNote: For activities NCERT Lab Manual may be referred. \nINTERNAL ASSESSMENT \n20 MARKS \nPeriodic Tests ( Best 2 out of 3 tests conducted) \n10 Marks \nMathematics Activities \n  10 Marks \n\n\n--- Page 5 ---\nConduct of Periodic Tests: \nPeriodic Test is a Pen and Paper assessment which is to be conducted by the respective \nsubject teacher. The format of periodic test must have questions items with a balance mix, \nsuch as, very short answer (VSA), short answer (SA) and long answer (LA) to effectively \nassess the knowledge, understanding, application, skills, analysis, evaluation and synthesis. \nDepending on the nature of subject, the subject teacher will have the liberty of incorporating \nany other types of questions too. The modalities of the PT are as follows: \na) Mode: The periodic test is to be taken in the form of pen-paper test.\nb) Schedule: In the entire Academic Year, three Periodic Tests in each subject may be\nconducted as follows:\nTest \nPre Mid-term (PT-I) Mid-Term (PT-II) \nPost Mid-Term (PT-III) \nTentative Month \nJuly-August \nNovember \nDecember-January \nThis is only a suggestive schedule and schools may conduct periodic tests as per their \nconvenience. The winter bound schools would develop their own schedule with similar time \ngaps between two consecutive tests. \nc)\nAverage of Marks: Once schools complete the conduct of all the three periodic tests,\nthey will convert the weightage of each of the three tests into ten marks each for identifying\nbest two tests. The best two will be taken into consideration and the average of the two\nshall be taken as the final marks for PT.\nd)\nThe school will ensure simple documentation to keep a record of performance as\nsuggested in detail circular no.Acad-05/2017.\ne)\nSharing of Feedback/Performance: The students’ achievement in each test must be\nshared with the students and their parents to give them an overview of the level of learning\nthat has taken place during different periods. Feedback will help parents formulate\ninterventions (conducive ambience, support materials, motivation and morale-boosting)\nto further enhance learning. A teacher, while sharing the feedback with student or parent,\nshould be empathetic, non- judgmental and motivating. It is recommended that the\nteacher share best examples/performances of IA with the class to motivate all learners.\n\n\n--- Page 6 ---\nAssessment of Activity Work: \nThroughout the year any 10 activities shall be performed by the student from the activities \ngiven in the NCERT Laboratory Manual for the respective class (XI or XII) which \nis available on the link: ncert.nic.in/exemplar/labmanuals.html a record of the same\nmay be kept by the student. An year end test on the activity may be conducted  \nThe weightage are as under: \n\nThe activities performed by the student throughout the year and record keeping\n: 5 marks\n\nAssessment of the activity performed during the year end test:  3 marks\n\nViva-voce: 2 marks\nPrescribed Books: \n1) Mathematics Textbook for Class XI, NCERT Publications\n2) Mathematics Part I - Textbook for Class XII, NCERT Publication\n3) Mathematics Part II - Textbook for Class XII, NCERT Publication\n4) Mathematics Exemplar Problem for Class XI, Published by NCERT\n5) Mathematics Exemplar Problem for Class XII, Published by NCERT\n6) Mathematics Lab Manual class XI, published by NCERT\n7) Mathematics Lab Manual class XII, published by NCERT\n",
  "pdf_urls": [
    "https://cdn1.byjus.com/wp-content/uploads/2023/04/CBSE-Class-12-Maths-Syllabus-2023-24.pdf"
  ],
  "extracted_at": "2026-01-29T11:06:56.946192",
  "pdf_local_files": [
    "syllabus/pdfs/class_12_maths_1.pdf"
  ],
  "pdf_parsed_at": "2026-01-30T13:29:27.436868"
}