{
  "url": "https://byjus.com/cbse-class-12-english-syllabus/",
  "title": "",
  "description": "",
  "units": [],
  "chapters": [],
  "topics": [
    "CBSE Class 12 English Core Syllabus 2023-24 PDF",
    "CBSE Class 12 English Elective Syllabus 2023-24 PDF",
    "One unseen passage to assess comprehension, interpretation, analysis and inference. Vocabulary assessment will also be assessed via inference. The passage may be factual, descriptive or literary.",
    "One unseen case-based factual passage with verbal/visual inputs like statistical data, charts etc., to assess comprehension, interpretation, analysis, inference and evaluation.",
    "Notice, up to 50 words – 4 Marks",
    "FFormal/Informal Invitation and Reply, up to 50 words – 4 Marks",
    "Letters based on verbal/visual input, to be answered in approximately 120-150 words – 5 Marks",
    "Article/ Report Writing, descriptive and analytical in nature, based on verbal inputs, to be answered in 120-150 words – 5 Marks.",
    "Applied Grammar – 8 Marks",
    "Creative Writing – 20 Marks",
    "Textbook – 22 Marks",
    "Fiction – 10 Marks"
  ],
  "marking_scheme": [],
  "raw_content": "CBSE Syllabus for Class 12 Englishfor both Core and Elective is prescribed by the CBSE board, which contains all the important information about the course structure and distribution of marks for each section. Students always ignore the language subjects and focus more on the core subjects while preparing for the exams. But the language subjects also carry equal weightage like any other subject. English ofCBSE Class 12is a scoring subject that will help students uplift their overall percentage if they prepare accordingly. English is divided into two parts English Core and English Elective for CBSE Class 12 board students.\nCBSE Syllabus for Class 12 English 2023-24\nStudents can download the latest releasedCBSE Class 12 SyllabusPDF of English from the link below. The syllabus will help students know the topics they will study in English during the academic year.\nCBSE Class 12 English Core Syllabus 2023-24 PDF\nCBSE Class 12 English Elective Syllabus 2023-24 PDF\nCBSE Syllabus for Class 12 English Core 2023-24\nSection A: Reading Comprehension through Unseen Passage\nOne unseen passage to assess comprehension, interpretation, analysis and inference. Vocabulary assessment will also be assessed via inference. The passage may be factual, descriptive or literary.\nOne unseen case-based factual passage with verbal/visual inputs like statistical data, charts etc., to assess comprehension, interpretation, analysis, inference and evaluation.\nNote: The combined word limit for both passages will be 700-750 words.\nMultiple Choice Questions / Objective Type Questions and Short Answer type Questions (to be answered in 40-50 words) will be asked.\nSection B: Creative Writing Skills:\nNotice, up to 50 words – 4 Marks\nFFormal/Informal Invitation and Reply, up to 50 words – 4 Marks\nLetters based on verbal/visual input, to be answered in approximately 120-150 words – 5 Marks\nArticle/ Report Writing, descriptive and analytical in nature, based on verbal inputs, to be answered in 120-150 words – 5 Marks.\nSection C: Literature Text Book and Supplementary Reading Text\nThis section will have a variety of assessment items, including Multiple Choice Questions, Objective Type Questions, Short Answer Type Questions and Long Answer Type Questions to assess comprehension, interpretation, analysis, evaluation and extrapolation beyond the text.\nCBSE Syllabus for Class 12 English Elective 2023-24\nSection A: Reading Comprehension– 20 Marks\nThis section will have two unseen passages and a poem.\nSection B:\nApplied Grammar – 8 Marks\nCreative Writing – 20 Marks\nSection C:\nThis section will have a variety of assessment items, including Multiple Choice Questions, Objective Type Questions, Short Answer Type Questions and Long Answer Type Questions to assess comprehension, analysis, interpretation and extrapolation beyond the text.\nTextbook – 22 Marks\nFiction – 10 Marks\nSeminar – 20 Marks\nAccess interactive lessons and videos related to Maths and Science with BYJU’S App/ Tablet.Frequently Asked Questions on CBSE Syllabus for Class 12 English 2023-24Q1What are the two divisions in the CBSE Syllabus for Class 12 English?The two divisions in the CBSE Syllabus for Class 12 English are English Core and Elective. The syllabus of each is prescribed by the board, which can be used by students to score remarkable results.Q2How many sections is the English Core divided according to the CBSE Syllabus for Class 12 English?The English core is divided into 3 sections according to the CBSE Syllabus for Class 12 English. Here section A is reading comprehension, section B is creative writing skills, and section C is Multiple Choice Questions, Objective Type Questions, Short Answer Type Questions and Long Answer Type Questions.Q3How are the marks distributed for the Elective paper in the CBSE Syllabus for Class 12 English?The marks distributed for the Class 12 English Elective in the CBSE Syllabus are 20 marks for reading, 8 marks for grammar, 20 marks for writing, 22 marks for literature and 10 marks for fiction.\nFrequently Asked Questions on CBSE Syllabus for Class 12 English 2023-24\nWhat are the two divisions in the CBSE Syllabus for Class 12 English?\nHow many sections is the English Core divided according to the CBSE Syllabus for Class 12 English?\nHow are the marks distributed for the Elective paper in the CBSE Syllabus for Class 12 English?",
  "pdf_content": "=== PDF: class_12_english_1.pdf ===\n--- Page 1 ---\nENGLISH CORE \nCODE NO. 301 \nCLASS – XII  \n 2023-24 \nSection A – 22  Marks \nReading Skills \nI Reading Comprehension through Unseen Passage  \n (12+10 = 22 Marks) \n1. One unseen passage to assess comprehension, interpretation, analysis and inference.\nVocabulary assessment will also be assessed via inference. The passage may be\nfactual, descriptive or literary.\n2. One unseen case-based factual passage with verbal/visual inputs like statistical data,\ncharts etc. to assess comprehension, interpretation, analysis, inference and evaluation.\nNote: The combined word limit for both the passages will be 700-750 words. \n Multiple Choice Questions / Objective Type Questions and Short Answer type Questions \n(to be answered in 40-50 words) will be asked. \nSection B – 18 Marks \nCreative Writing Skills \nII. Creative Writing Skills\n3.Notice, up to 50 words. One out of the two given questions to be answered.(4 Marks:\nFormat : 1 / Content : 2 / Accuracy of Spelling and Grammar : 1 ).\n4. Formal/Informal Invitation and Reply, up to 50 words. One out of the two given questions to\nbe answered. (4 Marks: Format : 1 / Content : 2 / Accuracy of Spelling and Grammar :1 ).\n5. Letters based on verbal/visual input, to be answered in approximately 120-150 words.\nLetter types include application for a job with bio data or resume. Letters to the editor (giving\nsuggestions or opinion on issues of public interest) . One out of the two given questions to\nbe answered . (5 Marks: Format : 1 / Organisation of Ideas: 1/Content : 2 / Accuracy of\nSpelling and Grammar :1 ).\n6. Article/ Report Writing, descriptive and analytical in nature, based on verbal inputs, to be\nanswered in 120-150 words. One out of the two given questions to be answered . (5 Marks:\nFormat : 1 / Organisation of Ideas: 1/Content : 2 / Accuracy of Spelling and Grammar :1 ).\nSection C – 40 Marks \nLiterature Text Book and Supplementary Reading Text \nThis section will have variety of assessment items including Multiple Choice \nQuestions, Objective Type Questions, Short Answer Type Questions and Long \nAnswer Type Questions to assess comprehension, interpretation, analysis, evaluation \nand extrapolation beyond the text.  \nCBSE Class 12 English Core Syllabus 2023-24\n\n\n--- Page 2 ---\n7. One Poetry extract out of two, from the book Flamingo, to assess comprehension,\ninterpretation, analysis, inference and appreciation.                         (6x1=6 Marks)\n8. One Prose extract out of two, from the book Vistas, to assess comprehension,\ninterpretation, analysis, evaluation and appreciation.                           (4x1=4 Marks)\n9. One prose extract out of two from the book Flamingo, to assess comprehension,\ninterpretation, analysis, inference and evaluation.                               (6x1=6Marks)\n10. Short answer type questions (from Prose and Poetry from the book Flamingo), to\nbe answered in 40-50 words each. Questions should elicit inferential responses\nthrough critical  thinking. Five questions out of the six given, are to be answered.\n(5x2=10 Marks) \n11.\nShort answer type questions, from Prose (Vistas), to be answered in 40- 50 words\neach. Questions  should elicit inferential responses through critical thinking. Any two\nout of three questions to be done.                                                       (2x2=4 Marks)\n12. One Long answer type question, from Prose/Poetry (Flamingo), to be answered in\n120-150 words. Questions can be based on incident / theme / passage / extract / event\nas reference points to assess extrapolation beyond and across the text. The question\nwill elicit analytical and evaluative response from the student. Any one out of two\nquestions to be done.                                                                         (1x5=5 Marks)\n13. One Long answer type question, based on the chapters from the book Vistas, to be\nanswered in 120-150 words, to assess global comprehension and extrapolation beyond\nthe text. Questions to provide analytical and evaluative responses using incidents,\nevents, themes, as reference points. Any one out of two questions to be done.\n(1x5=5 Marks)\n\n\n--- Page 3 ---\nPrescribed Books \n1. Flamingo: English Reader published by National Council of Education Research\nand Training, New Delhi\n (Prose) \nThe Last Lesson \nLost Spring \nDeep Water \nThe Rattrap \nIndigo \nPoets and Pancakes \nThe Interview \nGoing Places \n(Poetry) \nMy Mother at Sixty-Six \nKeeping Quiet \nA Thing of Beauty \nA Roadside Stand \nAunt Jennifer’s Tigers \n2. Vistas: Supplementary Reader published by National Council of Education\nResearch and Training, New Delhi\n The Third Level \n The Tiger King \n Journey to the End of the Earth \n The Enemy \n On the Face of It \n Memories of Childhood \n○\nThe Cutting of My Long Hair\n○\nWe Too are Human Beings\nINTERNAL ASSESSMENT \nAssessment of Listening Skills - 05 marks. \nAssessment of Speaking Skills – 05 Marks \nProject Work \n- 10 Marks \n\n\n--- Page 4 ---\nQuestion Paper Design \nCode No. 301 \n     2023-24 \nEnglish CORE XII \nSection \nCompetencies \nTotal marks \nReading Skills \nConceptual understanding, decoding, Analyzing, \ninferring, \ninterpreting, \nappreciating, \nliterary, \nconventions and vocabulary, summarizing and using \nappropriate format/s. \n22 \nCreative Writing Sills Conceptual Understanding, application of rules, \nAnalysis, Reasoning, appropriacy of style and tone, \nusing appropriate format and fluency, inference, \nanalysis, evaluation and creativity. \n18 \nLiterature Text Book \nand Supplementary \nReading Text \nRecalling, reasoning, critical thinking, appreciating \nliterary convention, inference, analysis, creativity \nwith fluency. \n40 \nTOTAL \n80 \nInternal Assessment \nAssessment of Listening and Speaking Skills \n\nListening\n\nSpeaking\n10 \n5+5 \n\nProject Work\n10 \nGRAND TOTAL \n100 \n\n\n--- Page 5 ---\nAnnexure I \nGuidelines for Internal Assessment \nClasses XI-XII \nALS must be seen as an integrated component of all four language skills rather than a compartment \nof two. Suggested activities, therefore, take into consideration an integration of the four language skills \nbut during assessment, emphasis will be given to speaking and listening, since reading and writing are \nalready being assessed in the written exam. \nClasses XI-XII \nTotal Marks: 20 \nAssessment of Listening and Speaking Skills: (5+5=10 Marks) \ni.\nActivities:\n●\nSubject teachers must refer to books prescribed in the syllabus.\n●\nIn addition to the above, teachers may plan their own activities and create their own\nmaterial for assessing the listening and speaking skills.\nii.\nParameters for Assessment: The listening and speaking skills are to be assessed on the\nfollowing parameters:\na.\nInteractive competence (Initiation & turn taking, relevance to the topic)\nb.\nFluency (cohesion, coherence and speed of delivery)\nc.\nPronunciation\nd.\nLanguage (grammar and vocabulary)\nA suggestive rubric is given below: \nInteraction \n1. \n2. \n3. \n4. \n        5. \n Contributions are mainly \nunrelated to those of\nother speakers\n Shows hardly any\ninitiative in the\ndevelopment of\nconversation\n Very limited interaction\nContributions are\noften unrelated\nto  those of the\nother speaker\nGenerally passive\nin the\ndevelopment of\nconversation\n\nDevelops\ninteraction\nadequately,\nmakes however\nminimal effort to\ninitiate\nconversation\n\nNeeds constant\nprompting to take \nturns\n\nInteraction is\nadequately\ninitiated\nand developed\n\nTakes turn but\nneeds some\nprompting\nInitiates &\nlogically\ndevelops     simple\nconversation on\nfamiliar topics\nTakes turns\nappropriately\nFluency & \nCoherence \n\nNoticeably/\nlong\npauses; \nrate \nof\nspeech is slow \n\nFrequent repetition\nand/or self-\ncorrection this is all\nright in informal\nconversation\n\nLinks only basic\nsentences;\nbreakdown of\ncoherence evident.\nUsually fluent;\nproduces simple\nspeech fluently,\nbut loses\ncoherence in\ncomplex\ncommunication\nOften hesitates\nand/or resorts to\nslow speech\n\nTopics partly\ndeveloped; not\nalways\nconcluded\nlogically\nIs willing to\nspeak at length,\nhowever\nrepetition is\nnoticeable\nHesitates and/or \nself corrects;\noccasionally\nloses coherence\nTopics\ndeveloped, but\nusually not\nlogically\nconcluded \n\nSpeaks without\nnoticeable\neffort, with a\nlittle repetition\n\nDemonstrates\nhesitation to\nfind words or\nuse correct\ngrammatical\nstructures\nand/or self-\ncorrection\n\nTopics not fully\ndeveloped to\nmerit.\n\nSpeaks fluently\nalmost with no\nrepetition &\nminimal\nhesitation\nDevelops topic\nfully &\ncoherently\n\n\n--- Page 6 ---\niii.\nSchedule:\nThe practice of listening and speaking skills should be done throughout the academic year.\nThe final assessment of the skills is to be done as per the convenience and schedule of the\nschool.\nProject Work + Viva: 10 Marks \nOut of ten marks, 5 marks will be allotted for the project report/script /essay etc. and 5 marks for the viva. \nI.\nSchedule:\n●\nSchools may refer to the suggestive timeline given in these guidelines for the planning,\npreparation and viva-voce of ALS based projects.\n●\nThe final assessment of the skills may be done on the basis of parameters suggested by the\nBoard. Language teachers, however, have the option to adopt/ modify these parameters\naccording to their school specific requirements.\nII.\nSuggestions for Project Work:\n\nThe Project can be inter-disciplinary in theme. The ideas/issues highlighted in the chapters/\npoems/ drama given the prescribed books can also be developed in the form of a project.\nStudents can also take up any relevant and age-appropriate theme.\nSuch topics may be taken up that provide students with opportunities for listening\nand speaking. Some suggestions are as follows:\na) Interview-Based research:\nExample: \n\nStudents can choose a topic on which to do their research/ interview, e.g. a student can choose\nthe topic : “ Evolving food tastes in my neighbourhood” or “Corona pandemic and the fallout on\nfamilies.” Read the available literature.\n\nThe student then conducts interviews with a few neighbours on the topic. For an interview, with\nthe help of the teacher, student will frame questions based on the preliminary\nresearch/background.\nPronunciation \n\nFrequent\ninaccurate\npronunciation\n\nCommunication is\nseverely affected\n\nFrequently\nunintelligible\narticulation\n\nFrequent\nphonological\nerrors\nMajor\ncommunication\nproblems\nLargely correct\npronunciation\n& clear\narticulation\nexcept\noccasional\nerrors\n\nMostly correct\npronunciation &\nclear articulation\n\nIs clearly\nunderstood most\nof the time; very\nfew phonological\nerrors\n\nPronounces\ncorrectly &\narticulates clearly\n\nIs always\ncomprehensible\n\nuses appropriate\nintonation\nVocabulary & \nGrammar \n\nDemonstrates\nalmost no\nflexibility, and\nmostly\nstruggles  for\nappropriate\nwords\n\nMany\nGrammatical\nerrors\nimpacting\ncommunication\nIs able to\ncommunicate\non some of the\ntopics, with\nlimited\nvocabulary.\nFrequent\nerrors, but self-\ncorrects\nIs able to\ncommunicate\non most of\nthe topics,\nwith limited\nvocabulary.\nA few\ngrammatical\nerrors\nIs able to\ncommunicate\non  most of the\ntopics  with\nappropriate\nvocabulary\nMinor errors\nthat do not\nhamper\ncommunication\nIs able to\ncommunicate on\nmost of the\ntopics  using a\nwide range of\nappropriate\nvocabulary,\nusing new words\nand expressions\nNo grammatical\nerrors\n\n\n--- Page 7 ---\n\nThe student will then write an essay/ write up / report etc. up to 1000 words on his/her research\nand submit it. He\n/ She will then take a viva on the research project. The project can be done in individually or in\npairs/ groups\nb)\nStudents listen to podcasts/ interviews/radio or TV documentary on a topic and prepare a report\ncountering or agreeing with the speakers. Write an 800 - 1000 words report and submit. Take a\nviva on the report.\nc)\nStudents create their own video/ Audio, after writing a script. Before they decide a format, the\nfollowing elements can be taken into consideration:\n●\nTheme/topic of the audio / video. Would the child like to pick a current issue or something artistic\nlike theatre?\n●\nWhat are the elements that need to be part of the script?\n●\nWill the video/audio have an interview with one or more guests?\n●\nWould they prefer to improvise while chatting with guests, or work from a script?\n●\nWhat would be the duration?\n●\nHow would they present the script/report to the teacher, e.g. Can it be in the form of a narrative?\nd) Students write, direct and present a theatrical production, /One act play\nThis will be a project which will be done as a team. It will involve planning, preparation and\npresentation. In short, various language skills will be utilised. There will be researching, discussion,\nwriting the script, auditioning and ultimately producing the play. The project will end with a\npresentation and subsequently a viva. Teachers will be able to assess the core language skills of\nthe students and help them grow as 21st century critical thinkers.\nIII. Instructions for the Teachers:-\n1.\nProperly orient students about the Project work, as per the present Guidelines.\n2.\nFacilitate the students in the selection of theme and topic.\n3.\nCreate a rubric for assessment and share with the students before they start so that they\nknow the parameters of assessment:\n\nTeachers need to familiarize themselves with the method of assessing students with\nthe rubric-- a table with different criteria and a grading scale.\n\nChoose the criteria on which you will grade students and list them along the left side of the\npage.\n\nCreate an even number of columns along the top of the page. These columns will\nrepresent potential skill levels of the students.\n\nAssessing students on four/five criteria is an easy way to begin. For each criterion,\ndefine the ability that a student would exhibit at each of the levels.\n\nThe more detailed you make your criteria, the easier it will be to evaluate each\nstudent and define the level at which the student is presenting.\n{Sample Rubric is attached at the end for reference} \nIV. Parameters for Overall Assessment:-\n1. Pronunciation:\n\nWhen evaluating the pronunciation of the students, teachers must listen for clearly articulated\nwords, pronunciation of unusual spellings and intonation.\n\nAssess the students for the pronunciation skills and determine at which level the student needs\nimprovement.\n\n\n--- Page 8 ---\n2. Vocabulary:\n\nAfter noting their pronunciation levels, evaluate the students on the use of extensive and\nappropriate vocabulary during the viva. Check if students are using vocabulary appropriate to\nthe context about which they are speaking.\n3.\nAccuracy:\n\nGrammar has always been an important component of language skills. As students speak/\nanswer the questions during the viva, listen to their grammatical structures. Are they\ncompetent enough to use multiple tenses? Is their word order correct in a given sentence? An\neffective speaker will automatically use the correct grammatical structures of his language.\n4. Communication:\n\nAssessing the communication skills of the students means looking at more than language.\nLook at how creatively students use the language to make their points understood. Students\nwith a low level of vocabulary and grammar may still have good communication skills if they are\nable to make the teacher understand their point of view.\n5. Interaction:\n\nDuring the viva teachers need to ask the students some questions. Questions need to be based\non the projects that have been suggested or chosen by the students.\n\nIt is imperative for a teacher to read the essays/project reports before they can be ready to ask\nquestions.\n\nTeachers need to observe how students answer the questions that are posed to them: Are they\nable to understand and answer questions independently or can they answer only when the\nquestions are translated into simpler words or repeated? Are they able to give appropriate\nresponses in a conversation?\n\nThese elements of interaction are necessary for clear and effective communication. A\nstudent with effective interaction skills will be able to answer questions with relative ease and\nfollow the flow of conversation.\n6. Fluency:\n\nFluency may be the easiest quality to judge in the students’ speech: How comfortable are they\nas they speak and express themselves? How easily do the words come out? Are there\ninappropriate pauses and gaps in the way a student speaks?\n\nFluency is a judgement of this communication and is an important criterion when evaluating\nspeaking skills. These criteria: pronunciation, vocabulary, accuracy, interaction and fluency are\nall the hallmarks of a student's overall speaking abilities.\n\nTeachers must also remember that some students may excel in one area and struggle in\nanother. Helping the students understand these issues will enable them to become effective\nspeakers in future. Let your students know that you will be assessing them in these various\nareas when you evaluate their progress and encourage them to work and improve in these\nareas.\n\nFinally, teachers must remember that a proper evaluation of the students will take into\nconsideration more than just one oral interview on the final ASL project. Teachers must\ntake note of a student’s progress throughout the academic year.\nV.\nProject-Portfolio/ Project Report\nThe Project-Portfolio/Project Report is a compilation of the work that the students produce during the \nprocess of working on their ALS Project. \nThe Project-Portfolio may include the following: \n●\nCover page, with title of project, school details/details of students.\n\n\n--- Page 9 ---\n●\nStatement of purpose/objectives/goals\n●\nCertificate of completion under the guidance of the teacher.\n●\nStudents Action Plan for the completion of assigned tasks.\n●\nMaterials such as scripts for the theatre/role play, questionnaires for interview, written\nassignments, essays, survey-reports and other material evidence of learning progress and\nacademic accomplishment.\n●\nThe 800-1000 words essay/Script/Report.\n●\nStudent/group reflections.\n●\nIf possible, Photographs that capture the positive learning experiences of the student(s).\n●\nList of resources/bibliography.\nThe following points must be kept for consideration while assessing the project portfolios: \n●\nQuality of content of the project\n●\nAccuracy of information\n●\nAdherence to the specified timeline\n●\nContent in respect of (spellings, grammar ,punctuation)\n●\nClarity of thoughts and ideas\n●\nCreativity\n●\nContributions by group members\n●\nKnowledge and experience gained\n\n\n--- Page 10 ---\nVI.\nSuggestive Timeline:\nThe FIVE Steps in Project Plan \nMonth \nObjectives \nPlanning and \nResearch for the \nProject Work \nPreferably\ntil\nl November-\nDecember\n●\nTeachers plan a day to orient students about the ALS projects,\ndetails are shared with all stakeholders.\n●\nStudents choose a project, select team members and develop\nproject- plan.\n●\nGroup meets (preferably online) and reports to the team leader\nabout the progress: shortfalls and successes are detailed.\n●\nTeam leader apprises teacher-mentor.\n●\nStudents working individually or in pairs also update the teachers.\n●\nA logical, deliverable and practical plan is drafted by the team/\npair/individual. Goals/objectives are clearly defined for all.\n●\nWork is delegated to team members by the team leader. Students\nwishing to work alone develop their own plan of Action.\n●\nDetailed project schedules are shared with the teacher.\nDecember- \nJanuary \n●\nSuggestions and improvements are shared by the teacher,\nwherever necessary.\n●\nGroup members coordinate and keep communication channels\nopen for interaction.\n●\nGaps ( if any) are filled with the right skill sets by the Team\nLeader/ individual student.\n●\nThe final draft of the project portfolio/ report is prepared and\nsubmitted for evaluation.\nJanuary-February \n●\nStudents are assessed on their group/pair/individual\npresentations on allotted days. Final Viva is conducted by the\nExternal/Internal examiner.\nFebruary-\nMarch or \nas per the \ntimelines given by \nthe Board \n●\nMarks are uploaded on the CBSE website.\nPROJECT-INITIATION \nPROJECT-PLANNING \nCLOSURE \nIMPLEMENTATION \nEXECUTION \n\n\n--- Page 11 ---\nSAMPLE RUBRIC FOR ALS Project Work \n(For Theatre/Role Play/Oral \npresentation/Interview/Podcast) \nCATEGORY \n1 \n2 \n3 \n4 \n5 \nTIME LIMIT \nPresentation \nis \nless than or more \nthan 5 minutes \nlong \nPresentation \nexceeded or less \nthan specified \ntime limit by 4 to \n5 minutes \nPresentation \nexceeded or \nless than \nspecified time \nlimit by 3 to 4 \nminutes \nPresentation \nexceeded or \nless than \nspecified  time \nlimit by 2 to 3 \nminutes \nStudent/ group \nadhered to the \ngiven time limit \nCONTENT/SCRIPT/ \nQUESTIONNAIRE \nScript \nis \nnot \nrelated to topic or \nissue \nWell written \nscript/ content \nshows little \nunderstanding of \nparts of topic \nWell written \nscript/ content \nshows good \nunderstanding \nof parts of topic \nWell written \nscript/ content \nshows a good \nunderstanding \nof subject topic \nWell written \nscript/ \n content \nshows \nfull \nunderstanding \nof subject topic \nCREATIVITY \nNo \nprops/costumes/ \nstage \npresentation \nlack- lustre \nSome work \ndone, average \nstage \nset- \nup and \ncostumes \nWell organized \npresentation, \ncould have \nimproved \nLogical use of \nprops \n, \nreasonable work \ndone, creative \nSuitable props \n/ honest effort \nseen/ \nconsiderable \nwork done/ \nCreative and \nrelevant \ncostumes \nPREPAREDNESS \nStudent \n/group \nseems \nto \nbe \nunprepared \nSome \npreparedness \nvisible, but \nRehearsal is \nlacking \nSomewhat \nprepared, \nrehearsal is \nlacking \nGood \npreparedness  , \nbut  need better \nrehearsal \nComplete \npreparedness/ \nrehearsed \npresentation \nCLARITY OF \nSPEECH \nLack of clarity in \npresentation \nmany words \nmispronounced \nSpeaks \nclearly, \nsome words are \nmispronounced \nSpeaks clearly \n90% of the \ntime/ a few \nmispronounced \nwords \nSpeaks clearly \nand distinctly \n95%  of \ntime/ \nfew \nmispronounced \nwords \nSpeaks clearly \ndistinctly 95% of \ntime/ fluency in \npronunciation \nUSE OF PROPS \n( Theatre/Role Play)\nOnly 1/no \nrelevant props \nused \n1 to 2 relevant \nprops used \n2 to 3 relevant \nprops used \n3 to 4 relevant \nprops used \n4 to 5 relevant \nprops used \nEXPRESSION/ \nBODY \nLANGUAGE \nVery little use of \nfacial \nexpressions/ \nbody  language, \ndoes not \ngenerate much \ninterest \nLittle \nUse \nof \nfacial \nexpressions and \nbody language \nFacial \nexpressions \nand  body \nlanguage are \nused to try to \ngenerate some \nenthusiasm \nFacial \nexpression  and \nbody \nlanguage \nsometimes \ngenerate strong \nenthusiasm with \nthe topic \nFacial \nexpression and \nbody \nlanguage \ngenerate strong \nenthusiasm with \nthe topic \nPORTFOLIO- \nPRESENTATION \nInadequate & \nunimpressive \nSomewhat \nsuitable & \nconvincing \nAdequate & \nrelevant \nInteresting, \nenjoyable   & \nrelevant \nBrilliant, \ncreative & \nexceptional \n\n\n=== PDF: class_12_english_2.pdf ===\n--- Page 1 ---\nENGLISH ELECTIVE \nCLASS-XII \nCode No. 001 \n     2023-24 \nSection A \nReading Comprehension \n20 MARKS \nThis section will have two unseen passages and a poem: \n1. 12 Multiple Choice Questions / Objective Type Questions, out of 15, from a literary\nor discursive passage, of about 950-1000 words to assess comprehension,\ninterpretation, inference, analysis, appreciation and vocabulary.  (1 X 12 =12 Marks)\n2. 4 out of 5 multiple choice questions / Objective Type Questions, to test interpretation,\ninference and appreciation of a poem of about 10-12 lines.               (1x4=4 Marks)\n3. 4 out of 5 multiple choice questions / Objective Type Questions, from a case-based\nfactual passage (with visual input- statistical data, chart etc.), of 100-120 words to\ntest interpretation, analysis and evaluation.                                          (1 X 4= 4 Marks)\nSection B \nApplied Grammar \n8 Marks \n4. Eight multiple choice questions / Objective Type Questions, out of ten, involving\ntransformation of  sentences.  \n  (1x8 =8 Marks) \nCreative Writing \n20 Marks \n5. Three Long Writing Tasks, out of four, to be answered in 120-150 words each as\ndiscursive and interpretative writing. \n  (5x3=15 Marks) \n6. One Long Writing Task out of two to be answered in 120-150 words: An essay on an\nargumentative/discursive topic such as an article/report/speech pertaining to\ncontemporary topics/issues                                                       .        (5x1=5 Marks)\nSection C \nThis section will have variety of assessment items including Multiple Choice Questions, \nObjective Type Questions, Short Answer Type Questions and Long Answer Type \nQuestions to assess comprehension, analysis, interpretation and extrapolation beyond \nthe text. \nTextbook \n22 Marks \n7. Reference to the Context\ni. One Prose extract, out of two, to assess literary appreciation and analysis.   (6x1= 6 Marks)\nii. One Poetry extract, out of two, to assess literary appreciation and analysis. (6x1= 6 Marks)\n8. One Short Answer Question, out of two, to be answered in 30-40 words, to assess\nCBSE Class 12 English Elective Syllabus 2023-24\n\n\n--- Page 2 ---\nUnderstanding, analysis and critical appreciation. Questions should elicit inferential \nresponses through critical thinking. \n(2x1=2 Marks) \n9. One Short Answer Question, out of two, to be answered in 40-50 words, to assess\nunderstanding, analysis and critical appreciation. Questions should elicit inferential\nresponses through critical thinking and draw inferences in poetry and prose.\n(3X1=3 Marks) \n10. One Long Answer Question, out of two, to be answered in 120-150 words each, to\nassess deeper understanding, interpretation, appreciation and drawing inferences.\nQuestions to elicit creative responses and assess ability to form personal points of\nview.                                                                                                      (5x1=5 Marks)\nFiction \n10 Marks \n11.\nOne Short Answer Question, out of two, to be answered in 30-40 words, to test\nunderstanding and appreciation and seek comments, interpretation, evaluation\nand appreciation of characters, events, episodes and interpersonal relationships.\n(2x1=2 Marks) \n12.\nOne Short Answer Question, out of two, to be answered in 40-50 words, to test\nunderstanding and appreciation and seek comments, interpretation, evaluation\nand appreciation of characters, events, episodes and interpersonal relationships.\n(3 x1=3 Marks) \n13. One Long Answer Question, out of two, to be answered in 120-150 words, to test\nin-depth understanding, interpretation, appreciation and drawing of \nglobal \ninferences from the given text, with reference to characters /events/ incidents and \nepisodes, leading to creative rendering, forming and defending  of personal points \nof view.                                                                                                    (5x1=5 Marks) \nStudents can select one of the two prescribed texts. \nSeminar (20 marks) \n\nPresentation - book review /a play /a short story/a novel/novella (tale,\nfable, parable) to be followed by a question-answer session.\n\nPoetry reading to be followed by interpretative tasks based on close\nreading and literary analysis of the text. Critical review of a film or a play\n\nConducting a theatre workshop to be followed by a discussion\nPrescribed Books: \n1.\nKaleidoscope - Text book published by NCERT\n2.\nFiction: A Tiger for Malgudi or The Financial Expert by R.K. Narayan (Novel)\n\n\n--- Page 3 ---\nBook- Kaleidoscope-Short Stories \n\nI Sell my Dreams\n\nEveline\n\nA Wedding in Brownsville\nBook- Kaleidoscope-Poetry \n\nA Lecture Upon the Shadow\n\nPoems by Milton\n\nPoems by Blake\n\nKubla Khan\n\nTrees\n\nThe Wild Swans of Coole\n\nTime and Time Again\nBook- Kaleidoscope- Non fiction \n\nFreedom\n\nThe Mark on the Wall\n\nFilm-making\n\nWhy the Novel Matters\n\nThe Argumentative Indian\nBook- Kaleidoscope-Drama \n1. Chandalika- RABINDRANATH TAGORE\n\n\n--- Page 4 ---\nQuestion Paper Design \nCode No. 001 \n2023-24 \nEnglish Elective XII \nMarks - 80+20=100 \nSection \nCompetencies \nTotal \nmarks \n% Weightage \n& \nSuggestive \nno. of  \nPeriods \nReading Comprehension Conceptual understanding, \ndecoding, Analyzing, inferring, \ninterpreting, appreciating, literary, \nconventions and vocabulary, \nsummarizing and using \nappropriate format/s \n20 \n25% \n35 Periods \nApplied Grammar \nApplying appropriate language \nconventions \ncomprehension using structures \ninteractively, application, accuracy \n8 \n10% \n15 Periods \nCreative Writing \nReasoning, appropriacy of style and \ntone, using appropriate format and \nfluency, inference, analysis, \nevaluating, creativity with Fluency. \n20 \n25% \n25 Periods \nTextbook \nRecalling, reasoning, appreciating \nliterary \nconvention, \ninference, \nanalysis, creativity with fluency \n22 \n27.5% \n40 Periods \nFiction \nRecalling, reasoning, appreciating \nliterary conventions, illustrating with \nrelevant quotations from the text, \ninferring, analyzing, evaluating and \ncreating, giving opinions, justifying \nwith fluency \n10 \n12.50% \n30 Periods \nTOTAL \n80 \n100% \nSeminar \nSeeking information and clarifying, \nillustrating with relevant quotations from \nthe texts, reasoning, diction, articulation \nclarity of pronunciation, using \nappropriate language conventions \nAddressing participants using \nappropriate titles or nomenclatures \nand overall fluency \n20 \n- \nGrand Total \n100 \n",
  "pdf_urls": [
    "https://cdn1.byjus.com/wp-content/uploads/2023/04/CBSE-Class-12-English-Core-Syllabus-2023-24.pdf",
    "https://cdn1.byjus.com/wp-content/uploads/2023/04/CBSE-Class-12-English-Elective-Syllabus-2023-24.pdf"
  ],
  "extracted_at": "2026-01-29T11:07:26.535856",
  "pdf_local_files": [
    "syllabus/pdfs/class_12_english_2.pdf",
    "syllabus/pdfs/class_12_english_1.pdf"
  ],
  "pdf_parsed_at": "2026-01-30T13:29:27.377630"
}