{
  "url": "https://byjus.com/cbse-class-7-social-science-syllabus/",
  "title": "",
  "description": "",
  "units": [
    {
      "headers": [
        "Unit",
        "Unit Name",
        "Section"
      ],
      "rows": [
        [
          "1",
          "History",
          "Where, When and HowNew Kings and KingdomsThe Sultans of DelhiThe Creation of An EmpireArchitecture as Power: Forts and Sacred PlacesTowns, Traders and CraftsmenSocial Change: Mobile and settled communitiesPopular Beliefs and Religious DebatesThe Flowering of Regional CulturesNew Political Formations in the Eighteenth Century"
        ],
        [
          "2",
          "Social and Political Life",
          "DemocracyState GovernmentUnderstanding MediaUnpacking GenderMarkets Around Us"
        ],
        [
          "3",
          "Geography",
          "Environment in its totalityNatural EnvironmentAirWaterNatural vegetation and wild lifeHuman EnvironmentHuman – Environment Interaction"
        ]
      ]
    }
  ],
  "chapters": [],
  "topics": [
    "CBSE Class 7 History Syllabus PDF 2023-24",
    "CBSE Class 7 Social and Political Life Syllabus PDF 2023-24",
    "CBSE Class 7 Geography Syllabus PDF 2023-24",
    "Where, When and How",
    "New Kings and Kingdoms",
    "The Sultans of Delhi",
    "The Creation of An Empire",
    "Architecture as Power: Forts and Sacred Places",
    "Towns, Traders and Craftsmen",
    "Social Change: Mobile and settled communities",
    "Popular Beliefs and Religious Debates",
    "The Flowering of Regional Cultures",
    "New Political Formations in the Eighteenth Century",
    "Democracy",
    "State Government",
    "Understanding Media",
    "Unpacking Gender",
    "Markets Around Us",
    "Environment in its totality",
    "Natural Environment",
    "Air",
    "Water",
    "Natural vegetation and wild life",
    "Human Environment",
    "Human – Environment Interaction"
  ],
  "marking_scheme": [],
  "raw_content": "CBSE Class 7 Social Science Syllabusis important because it gives the proper structure of the course content of History, Political science and Geography. Studying according to the syllabus of Class 7 Social Science will help students to score better marks because the final question paper is prepared as per the syllabus. CBSE Syllabus for Class 7 Social Science for the academic year 2023-2024 contains all the important chapters that is required by theClass 7 CBSEstudent.\nDownload CBSE Class 7 Social Science Syllabus 2023-24\nClass 7 students can access the CBSE Syllabus of Social Science subject in PDF format by clicking on the link for the academic year 2023-2024.\nCBSE Class 7 History Syllabus PDF 2023-24\nCBSE Class 7 Social and Political Life Syllabus PDF 2023-24\nCBSE Class 7 Geography Syllabus PDF 2023-24\n2023-24 CBSE Class 7 Social Science Syllabus\nStudents can have a look at the topics of CBSE Syllabus for Class 7 Social Science below.\nUnitUnit NameSection1HistoryWhere, When and HowNew Kings and KingdomsThe Sultans of DelhiThe Creation of An EmpireArchitecture as Power: Forts and Sacred PlacesTowns, Traders and CraftsmenSocial Change: Mobile and settled communitiesPopular Beliefs and Religious DebatesThe Flowering of Regional CulturesNew Political Formations in the Eighteenth Century2Social and Political LifeDemocracyState GovernmentUnderstanding MediaUnpacking GenderMarkets Around Us3GeographyEnvironment in its totalityNatural EnvironmentAirWaterNatural vegetation and wild lifeHuman EnvironmentHuman – Environment Interaction\nUnitUnit NameSection\nUnit\nUnit Name\nSection\n1HistoryWhere, When and HowNew Kings and KingdomsThe Sultans of DelhiThe Creation of An EmpireArchitecture as Power: Forts and Sacred PlacesTowns, Traders and CraftsmenSocial Change: Mobile and settled communitiesPopular Beliefs and Religious DebatesThe Flowering of Regional CulturesNew Political Formations in the Eighteenth Century\nHistory\nWhere, When and HowNew Kings and KingdomsThe Sultans of DelhiThe Creation of An EmpireArchitecture as Power: Forts and Sacred PlacesTowns, Traders and CraftsmenSocial Change: Mobile and settled communitiesPopular Beliefs and Religious DebatesThe Flowering of Regional CulturesNew Political Formations in the Eighteenth Century\nWhere, When and How\nNew Kings and Kingdoms\nThe Sultans of Delhi\nThe Creation of An Empire\nArchitecture as Power: Forts and Sacred Places\nTowns, Traders and Craftsmen\nSocial Change: Mobile and settled communities\nPopular Beliefs and Religious Debates\nThe Flowering of Regional Cultures\nNew Political Formations in the Eighteenth Century\n2Social and Political LifeDemocracyState GovernmentUnderstanding MediaUnpacking GenderMarkets Around Us\nSocial and Political Life\nDemocracyState GovernmentUnderstanding MediaUnpacking GenderMarkets Around Us\nDemocracy\nState Government\nUnderstanding Media\nUnpacking Gender\nMarkets Around Us\n3GeographyEnvironment in its totalityNatural EnvironmentAirWaterNatural vegetation and wild lifeHuman EnvironmentHuman – Environment Interaction\nGeography\nEnvironment in its totalityNatural EnvironmentAirWaterNatural vegetation and wild lifeHuman EnvironmentHuman – Environment Interaction\nEnvironment in its totality\nNatural Environment\nAir\nWater\nNatural vegetation and wild life\nHuman Environment\nHuman – Environment Interaction\nStudents can also check theCBSE Syllabusfor the Classes 1 to 12.\nCBSE Class 7 Social Science Syllabus 2023-24\nBelow, we have provided the chapter names from the NCERT Class 7 Social Science textbook. Students must study from this book as it covers the CBSE Syllabus of Class 7 Social Science.\nCBSE Class 7 History Syllabus (Our Pasts II) Chapter Name\nChapter 1:Tracing Changes through a Thousand Years\nChapter 2:Kings and Kingdoms\nChapter 3:Delhi: 12th to 15th Century\nChapter 4:The Mughal Empire: 16th to 17th Century\nChapter 5:Tribes, Nomads and Settled Communities\nChapter 6:Devotional Paths to the Divine\nChapter 7:The Making of Regional Cultures\nChapter 8:Eighteenth Century Political Formations\nCBSE Class 7 Social and Political Life Syllabus Chapter Name\nChapter 1:On Equality\nChapter 2:Role of the Government in Health\nChapter 3:How the State Government Works\nChapter 4:Growing up as Boys and Girls\nChapter 5:Women Change the World\nChapter 6:Understanding Media\nChapter 7:Markets Around Us\nChapter 8:A Shirt in the Market\nStudents can also access theCBSE Class 7 Syllabusfor other subjects.\nCBSE Class 7 Geography Syllabus (Our Environment) Chapter Name\nChapter 1:Environment\nChapter 2:Inside Our Earth\nChapter 3:Our Changing Earth\nChapter 4:Air\nChapter 5:Water\nChapter 6:Human Environment Interactions – The Tropical and the Subtropical Region\nChapter 7:Life in the Deserts\nLearn Maths & Science in an interactive & fun-loving way with BYJU’S App/Tablet.Frequently Asked Questions on CBSE Class 7 Social Science Syllabus 2023-24Q1How many chapters are present in the CBSE Class 7 Social Science Political Science and Geography Syllabus?There are 8 chapters present in the CBSE Class 7 Social Science Political Science and 7 in the Geography Syllabus. Students can learn it in brief using the PDF given at BYJU’S.Q2Why should I use the CBSE Class 7 Social Science Syllabus?The CBSE Class 7 Social Science Syllabus for 2023-24 must be used by students to learn the important concepts for the exam. It is available for all three parts which can be referred to in order to score remarkable grades.Q3Is the BYJU’S CBSE Class 7 Social Science Syllabus available for free?Yes, the BYJU’S CBSE Class 7 Social Science Syllabus is available for free. Students can download the PDF by just clicking on the link provided.\nFrequently Asked Questions on CBSE Class 7 Social Science Syllabus 2023-24\nHow many chapters are present in the CBSE Class 7 Social Science Political Science and Geography Syllabus?\nWhy should I use the CBSE Class 7 Social Science Syllabus?\nIs the BYJU’S CBSE Class 7 Social Science Syllabus available for free?",
  "pdf_content": "=== PDF: class_7_social-science_1.pdf ===\n--- Page 1 ---\n167\nCBSE Class 7 Syllabus for History \n2023-24\nThemes\nThemes\nThemes\nThemes\nThemes\nObjectives\nObjectives\nObjectives\nObjectives\nObjectives\n(a) Familiarise the student with the changing names\nof the land.\n(b) Discuss broad historical trends.\n(c) Give examples of the kinds of sources that\nhistorians use for studying this period. E.g.,\nbuildings, chronicles, paintings, coins, inscriptions,\ndocuments, music, literature.\n(a) Trace the patterns of political developments and\nmilitary conquests – Gurjara Pratiharas,\nRashtrakutas, Palas, Chahamanas, Ghaznavids.\n(b) Develop an understanding of the connections\nbetween political and economic processes through\nthe exploration of one specific example.\n(c) Illustrate how inscriptions are used to reconstruct\nhistory.\nWhere, When and How\n(a) Terms used to describe the subcontinent and its\nregions with a map.\n(b) An outlining of the time frame and major\ndevelopments.\n(c) A brief discussion on sources.\nNew Kings and Kingdoms\n(a) An outline of political developments c. 700-1200\n(b) A case study of the Cholas, including agrarian\nexpansion in the Tamil region.\n\n\n--- Page 2 ---\nSyllabus\nfor\nClasses\nat the\nElementary\nLevel\n168\nThemes\nThemes\nThemes\nThemes\nThemes\nObjectives\nObjectives\nObjectives\nObjectives\nObjectives\n(a) Outline the development of political institutions,\nand relationships amongst rulers.\n(b) Understand strategies of military control and\nresource mobilisation.\n(c) Illustrate how travellers’ accounts, court chronicles\nand historic buildings are used to write history.\n(a) Trace the political history of the 16th and 17th\ncenturies.\n(b) Understand the impact of an imperial\nadministration at the local and regional levels.\n(c) Illustrate how the Akbarnama and the Ain-i-Akbari\nare used to reconstruct history.\n(a) Convey a sense of the range of materials, skills\nand styles used to build: waterworks, places of\nworship, palaces and havelis, forts, gardens.\n(b) Understand the engineering and construction skills,\nartisanal organisation and resources required for\nbuilding works.\n(c) Illustrate how contemporary documents,\ninscriptions, and the actual buildings can beused to\nreconstruct history.\n(a) Trace the origins and histories of towns, many of\nwhich survive today.\n(b) Demonstrate the differences between founded\ntowns and those that grow as a result of trade.\n(c) Illustrate how travellers’ accounts, contemporary\nmaps and official documents are used to\nreconstruct history.\nThe Sultans of Delhi\n(a) An overview.\n(b) The significance of the court, nobility and land\ncontrol.\n(c) A case study of the Tughlaqs.\nThe Creation of An Empire\n(a) An outline of the growth of the Mughal Empire.\n(b) Relations with other rulers, administration, and the\ncourt.\n(c) Agrarian relations.\n(d) A case study of Akbar.\nArchitecture as Power: Forts and Sacred Places\n(a) Varieties of monumental architecture in different\nparts of the country.\n(b) A case study of  Shah Jahan’s patronage of\narchitecture.\nTowns, Traders and Craftsmen\n(a) Varieties of  urban centres—court towns,\npilgrimage centres, ports and trading towns.\n(b) Case studies: Hampi, Masulipatam, Surat.\n\n\n--- Page 3 ---\n169\nThemes\nThemes\nThemes\nThemes\nThemes\nObjectives\nObjectives\nObjectives\nObjectives\nObjectives\nSocial Change: Mobile and settled communities\n(a) A discussion on tribes, nomads and itinerant\ngroups.\n(b) Changes in the caste structure.\n(c) Case studies of state formation: Gonds, Ahoms.\nPopular Beliefs and Religious Debates\n(a) An overview of belief-systems, rituals, pilgrimages,\nand syncretic cults.\n(b) Case Study: Kabir.\nThe Flowering of Regional Cultures\n(a) An overview of the regional languages, literatures,\npainting, music.\n(b) Case study: Bengal.\nNew Political Formations in the Eighteenth\nCentury\n(a) An overview of the independent and autonomous\nstates in the subcontinent.\n(b) Case study: Marathas\n(a) Convey an idea of long-term social change and\nmovements of people in the subcontinent.\n(b) Understand political developments in specific\nregions.\n(c) Illustrate how anthropological studies, inscriptions\nand chronicles are used to write history.\n(a) Indicate the major religious ideas and practices that\nbegan during this period.\n(b) Understand how Kabir challenged formal religions.\n(c) Illustrate how traditions preserved in texts and oral\ntraditions are used to reconstruct history.\n(a) Provide a sense of the development of regional\ncultural forms, including ‘classical’ forms of dance\nand music.\n(b) Illustrate how texts in a regional language can be\nused to reconstruct history.\n(a) Delineate developments related to the Sikhs,\nRajputs, Marathas, later Mughals, Nawabs of\nAwadh and Bengal, and Nizam of Hyderabad.\n(b) Understand how the Marathas expanded their area\nof control.\n(c) Illustrate how travellers’ accounts and state archives\ncan be used to reconstruct history.\n\n\n=== PDF: class_7_social-science_2.pdf ===\n--- Page 1 ---\n181\nDEMOCRACY AND EQUALITY\nRationale\nDemocracy and Equality are the key ideas to be engaged with this year. The effort is to introduce\nthe learner to certain core concepts, such as equality, dignity, rule of law etc that influence Democracy\nas a political system. The role of the Constitution as a document that provides the guiding\nframework to function in a democratic manner is emphasised.   This section deals with making\nthe link between democracy and how it manifests itself in institutional systems in a concrete and\nlive manner through case studies and real experiences. The objective is not to represent democracy\nas a fixed idea or system, but one that is changing and evolving. The learner is introduced to a\nwide range of institutions- the government, the bureaucracy and civil society organizations like the\nMedia so that she can develop a broad understanding of the relationship between the State and\nCitizens.\nEquality as a value is explored in some detail, where its relationship with democracy is highlighted\nand the challenges or questions it raises on inequities and hierarchies that exist at present in society\nis also discussed. An analysis of everyday experiences in the domain of gender enable the learner\nto understand how these are related to the creation of differences that are discriminatory in\nnature.\nObjectives\nThe specific objectives of the course, where it is not clear from the rationale of the approach, are\nindicated beside the themes to be taught in the course.\nThemes\nThemes\nThemes\nThemes\nThemes\nObjectives\nObjectives\nObjectives\nObjectives\nObjectives\nUNIT 1: Democracy\nThis unit will focus on the historical as well as the key\nelements that structure a democracy.  The structures in\nplace to make people’s representation a reality will be\ndiscussed with reference to its actual functioning.\nSection 1\nWhy Democracy\nTwo main thrusts\n• Historical\nWhat were some of the key junctures and\ntransformations in the emergence of democracy in\nmodern societies.\nTo enable students to:\n• develop an understanding of the rule of Law and\nour involvement with the law,\n• understand the Constitution as the primary source\nof all laws,\n• develop the ability to distinguish between different\nsystems of power,\n• understand the importance of the idea of equality\nand dignity in democracy,\n• develop links between the values/ideas of\ndemocracy and the institutional forms and\nprocesses associated with it,\nCBSE Class 7 Syllabus for Social and Political Life \n2023-24\n\n\n--- Page 2 ---\n182\nThemes\nThemes\nThemes\nThemes\nThemes\nObjectives\nObjectives\nObjectives\nObjectives\nObjectives\n• Key Features\n– The different systems of power that exist in the\nworld today.\n– Significant Elements that continue to make\nDemocracy popular in the contemporary world:\n• Formal Equality.\n• Decision Making mechanisms.\n• Accommodation of differences.\n• Enhancing human dignity.\nSection 2\nInstitutional Representation of Democracy\n• Universal Adult Franchise.\n• Elections.\n• Political parties.\n• Coalition Governments.\nUnit 2: State Government\nThis unit will focus on the legislative, executive and\nadministrative aspects of state government.  It will\ndiscuss processes involved in choosing MLAs, passing\na bill and discuss how state governments function\nthrough taking up one issue.  This unit might also\ncontain a section on the nation-state.\nSection 1: Its working\n• Main functionaries-broad outline of the role of the\nChief minister and the council of ministers\nSection 2:  Its functioning\nThrough one example:\nland reform/irrigation/education/water/health discuss\n• The nature of the role played by the government –\nregarding resources and services.\n• Factors involved in distribution of resources/\nservices.\n• Access of localities and communities to  resources/\nservices.\n• understand democracy as representative\ngovernment,\n• understand the vision and the values of the\nConstitution.\nTo enable students to:\n• gain a sense of the nature of decision-making within\nState government.\n• understand the domain of power and authority\nexercised by the state government over people’s\nlives.\n• gain a critical sense of the politics underlying the\nprovision of   services or the distribution of\nresources.\n\n\n--- Page 3 ---\n183\nThemes\nThemes\nThemes\nThemes\nThemes\nObjectives\nObjectives\nObjectives\nObjectives\nObjectives\nUNIT 3: Understanding Media\nIn this unit the various aspects of the role of a media\nin a democracy will be highlighted.  This unit will also\ninclude a discussion on advertising as well as on the\nright to information bill.\nSection 1: Media and Democracy\nMedia’s role in providing the following:\n• providing information,\n• providing forum for discussion/debate creating\npublic opinion.\nMedia ethics and accountability.\nRelationship between Government and Information\nA case-study of  the popular struggle that brought\nabout the enactment of this legislation.\nSection 2 : On Advertising\n• Commercial Advertising and consumerism,\n• Social advertising.\nUNIT 4: Unpacking Gender\nThis unit is to understand the role gender plays in\nordering our social and economic lives.\nSecton 1: Social Aspects\nNorms, values that determine roles expected from\nboys and girls in the:\n• family,\n• community,\n• schools,\n• public spaces,\n• understanding Inequality: The role of gender in\ncreating unequal and hierarchical relations in society.\nSection 2 : Economic Aspects\n• gender division of labour within family,\n• value placed on women’s work within and outside\nthe home,\n• the invisibilisation of women’s labour.\nTo enable students to:\n• understand the role of the media in facilitating\ninteraction between the government and citizens,\n• gain a sense that government is accountable to its\ncitizens,\n• understand the link between information and\npower,\n• gain a critical sense of the impact of media on\npeople’s lives and  choices,\n• appreciate the significance of people’s movements\nin gaining this right.\nTo enable students to:\n• understand that gender is a social construct and not\ndetermined by biological difference,\n• learn to interrogate gender constructions in different\nsocial and  economic  contexts,\n• to link everyday practices with the creation of\ninequality and question it.\n\n\n--- Page 4 ---\nThemes\nThemes\nThemes\nThemes\nThemes\nObjectives\nObjectives\nObjectives\nObjectives\nObjectives\nUNIT 5: Markets Around Us\nThis unit is focussed on discussing various types of\nmarkets, how people access these and to examine the\nworkings of an actual market.\nSecton 1\n• On retail markets and our everyday needs\n• On role and impact of wholesale markets how are\nthese linked to the above\n• People’s access to markets depends upon many\nfactors such as availability , convenience , credit,\nquality , price, income cycle etc.\nSecton 2\nExamine the role of an observable wholesale market\nsuch as grain, fruit, or vegetable to understand the chain\nof activities , the role of intermediaries and its impact\non farmer -producers.\nTo enable students to:\n• understand markets and their relation to everyday\nlife,\n• understand markets and their function to link\nscattered producers and consumers,\n• gain a sense of inequity in market operations.\n184\n\n\n=== PDF: class_7_social-science_3.pdf ===\n--- Page 1 ---\n174\nTopics\nopics\nopics\nopics\nopics\nObjectives\nObjectives\nObjectives\nObjectives\nObjectives\nTo understand the environment in its totality including\nvarious components both natural and human;\n(Periods-6)\nTo explain the components of natural environment;\nTo appreciate the interdependence of  these\ncomponents and their importance in our life;\nTo appreciate and develop sensitivity towards\nenvironments;\n(Periods-12)\nEnvironment in its totality: natural and human\nenvironment.\nNatural Environment: land – interior of the earth,\nrocks and minerals; earth movements and major land\nforms. (One case study related with earthquake to be\nintroduced)\nCBSE Class 7 Syllabus for Geography \n2023-24\n\n\n--- Page 2 ---\n175\nThemes\nThemes\nThemes\nThemes\nThemes\nObjectives\nObjectives\nObjectives\nObjectives\nObjectives\nAir – composition, structure of the atmosphere,\nelements of weather and climate – temperature,\npressure, moisture and wind. (One case study related\nwith cyclones to be introduced)\nWater – fresh and saline, distribution of major water\nbodies, ocean waters and their circulation. (One case\nstudy related with tsunami to be introduced)\nNatural vegetation and wild life.\nHuman Environment: settlement, transport and\ncommunication.\nHuman – Environment Interaction: Case Studies –\nlife in desert regions – Sahara and Ladakh; life in\ntropical and sub-tropical regions – Amazon and\nGanga-Brahmaputra; life in temperate regions – Prairies\nand Veldt.\nTo understand about atmosphere and its elements;\n(Periods-10)\nTo know about distribution of water on the earth;\n(Periods-10)\nTo find out the nature of diverse flora and fauna.\n(Periods-5)\nTo explain the relationship between natural\nenvironment and human habitation;\nTo appreciate the need of  transport and\ncommunication for development of the community;\nTo be familiar with the new developments making\ntoday’s world a global society;\n(Periods-7)\nTo understand the complex inter relationship of human\nand natural environment;\nTo compare life in one’s own surrounding with life of\nother environmental settings;\nTo appreciate the cultural differences existing in the\nworld which is an outcome of interaction, between\nhuman beings and their environment;\n(Periods-15)\nProject/Activity\n•\nCollect stories / find out about changes that took place in their areas (identify how things/\nsurroundings change overnight and why).\n•\nDiscuss the topic “How weather forecast helps us” in your class after assigning the role of a\nfarmer, a hawker, a pilot of an aeroplane, a captain of ship, a fisherman and an engineer of\na river dam to different students.\n•\nWrite observations about local area house types, settlements, transport, communication and\nvegetation.\nNote: Any similar activities may be taken up.\n",
  "pdf_urls": [
    "https://cdn1.byjus.com/wp-content/uploads/2023/04/CBSE-Syllabus-for-Class-7-History-2023-24.pdf",
    "https://cdn1.byjus.com/wp-content/uploads/2023/04/CBSE-Syllabus-for-Class-7-Social-and-Political-Life-2023-24.pdf",
    "https://cdn1.byjus.com/wp-content/uploads/2023/04/CBSE-Syllabus-for-Class-7-Geography-2023-24.pdf"
  ],
  "extracted_at": "2026-01-29T11:02:13.493402",
  "pdf_local_files": [
    "syllabus/pdfs/class_7_social-science_2.pdf",
    "syllabus/pdfs/class_7_social-science_3.pdf",
    "syllabus/pdfs/class_7_social-science_1.pdf"
  ],
  "pdf_parsed_at": "2026-01-30T13:29:25.771054"
}