{
  "url": "https://byjus.com/cbse/class-3-science-syllabus/",
  "title": "",
  "description": "",
  "units": [],
  "chapters": [],
  "topics": [],
  "marking_scheme": [],
  "raw_content": "The Central Board of Secondary Education (CBSE ) has defined a proper set of academic activities and approaches to provide a child-centred and stress-free education environment so that a child enjoys learning and builds a passion for it. Check out the chapter names for Class 3 Science given below.\nStudents should always refer class 3 science syllabus before starting their preparation for exams. This syllabus is prepared according to the latest curriculum ofCBSE Class 3. Here at BYJU’S, we are providing the detailed class 3 science syllabus, which the students can go through.\nCBSE Class 3 Science Syllabus Chapter Listing\nGet the latest syllabus of CBSE Class 3 Science for the academic year 2023-24 for the benefit of the students. Also, they will know the chapters which cover the syllabus. Check out the chapter names of the syllabus mentioned below.\nChapter 1.Poonam’s Day out\nChapter 2.The Plant Fairy\nChapter 3.Water O’ Water!\nChapter 4.Our First School\nChapter 5.Chhotu’s House\nChapter 6.Foods We Eat\nChapter 7.Saying without Speaking\nChapter 8.Flying High\nChapter 9.It’s Raining\nChapter 10.What is Cooking\nChapter 11.From Here to There\nChapter 12.Work We Do\nChapter 13.Sharing Our Feelings\nChapter 14.The Story of Food\nChapter 15.Making Pots\nChapter 16.Games We Play\nChapter 17.Here comes a Letter\nChapter 18.A House Like This\nChapter 19.Our Friends – Animals\nChapter 20.Drop by Drop\nChapter 21.Families can be Different\nChapter 22.Left-Right\nChapter 23.A Beautiful Cloth\nChapter 24.Web of Life\nFor more information on CBSE exams, syllabus and notifications, stay tuned with BYJU’S. At BYJU’S, CBSE students are also provided with the latest sample papers, question papers, worksheets and other exam materials to help them learn in a better way.",
  "pdf_content": "",
  "pdf_urls": [],
  "extracted_at": "2026-01-29T11:00:39.277820"
}