{
  "url": "https://byjus.com/cbse-class-3-maths-syllabus/",
  "title": "",
  "description": "",
  "units": [
    {
      "headers": [
        "Unit",
        "Unit Name",
        "Section"
      ],
      "rows": [
        [
          "1",
          "Geometry",
          "Shapes and Spatial Understanding"
        ],
        [
          "2",
          "Numbers",
          "Number Sequence Up to 1000Addition and SubtractionMultiplicationDivisionMental Arithmetic"
        ],
        [
          "3",
          "Money",
          "Money"
        ],
        [
          "4",
          "Measurement",
          "LengthWeightVolumeTime"
        ],
        [
          "5",
          "Data Handling",
          "Data Handling"
        ],
        [
          "6",
          "Patterns",
          "Patterns"
        ]
      ]
    }
  ],
  "chapters": [],
  "topics": [],
  "marking_scheme": [],
  "raw_content": "CBSE Syllabus for Class 3 Mathsis prepared to give students all the information needed for their understanding. Maths is one of the most important subjects in Class 3. CBSE is popularly known for its well-designed syllabus. The board takes proper steps for making the learning process of students useful and convenient. The CBSE Syllabus for Class 3 Maths is created in such a way that it develops and strengthens the logical and thinking skills of students. CBSE Class 3 Maths Syllabus is designed by subject experts associated with the board to make students learn and understand the subject effectively. Students are suggested to follow theCBSE Class 3 Syllabusfor their exam preparation strictly. To download the CBSE Maths syllabus for Class 3 students, click on the link below.\nCBSE Syllabus for Class 3 Maths PDF for 2023-24\nDownload PDF\n2023-24 CBSE Class 3 Maths Syllabus\nCBSE Class 3 Maths Syllabus is all about learning numbers, counting, charts, rupees and paisa, etc. which prepares the students for the concepts they are going to learn in their next class. Students ofCBSE Class 3should go through their CBSE Class 3 Maths Syllabus for the academic year 2023-2024 so that they feel confident while writing the exam.\nUnitUnit NameSection1GeometryShapes and Spatial Understanding2NumbersNumber Sequence Up to 1000Addition and SubtractionMultiplicationDivisionMental Arithmetic3MoneyMoney4MeasurementLengthWeightVolumeTime5Data HandlingData Handling6PatternsPatterns\nUnitUnit NameSection\nUnit\nUnit Name\nSection\n1GeometryShapes and Spatial Understanding\nGeometry\nShapes and Spatial Understanding\n2NumbersNumber Sequence Up to 1000Addition and SubtractionMultiplicationDivisionMental Arithmetic\nNumbers\nNumber Sequence Up to 1000Addition and SubtractionMultiplicationDivisionMental Arithmetic\nAddition and Subtraction\nMultiplication\nDivision\nMental Arithmetic\n3MoneyMoney\nMoney\nMoney\n4MeasurementLengthWeightVolumeTime\nMeasurement\nLengthWeightVolumeTime\nWeight\nVolume\nTime\n5Data HandlingData Handling\nData Handling\nData Handling\n6PatternsPatterns\nPatterns\nPatterns\nCBSE Class 3 Maths Syllabus Chapter List\nGet the latest syllabus of CBSE Class 3 Maths for the academic year 2023-2024. The CBSE Syllabus for Class 3 Maths covers the following topics.\nChapter 1:Where to Look From\nChapter 2:Fun With Numbers\nChapter 3: Give and Take\nChapter 4:Long and Short\nChapter 5:Shapes and Designs\nChapter 6:Fun With Give and Take\nChapter 7:Time Goes On\nChapter 8:Who is Heavier?\nChapter 9:How Many Times?\nChapter 10:Play With Patterns\nChapter 11:Jugs and Mugs\nChapter 12: Can We Share?\nChapter 13:Smart Charts!\nChapter 14:Rupees and Paise\nWe hope CBSE Syllabus for Class 3 Maths must have helped students in their exam preparation. Students can also access the complete Syllabus from Class 1 to 12 by clicking onCBSE Syllabus. For more study material and the latest updates on CBSE/ICSE/State Board/Competitive exams, keep visiting BYJU’S. Also, download the BYJU’S App for interactive study videos.Frequently Asked Questions on CBSE Class 3 Maths Syllabus 2023-24Q1How many chapters are available in the CBSE Class 3 Maths Syllabus?There are about 14 chapters in the CBSE Class 3 Maths Syllabus. Students can learn each of them effectively using the solutions curated by the subject experts at BYJU’S.Q2Why is it important to go through the CBSE Class 3 Maths Syllabus for 2023-24?Students need to go through the CBSE Class 3 Maths Syllabus as it will give a good idea of the important topics in the exam. The marks weightage and exam pattern can be well understood using it.Q3How to score full marks using the CBSE Class 3 Maths Syllabus?Students can score full marks by understanding the Syllabus of CBSE Class 3 Maths right from the beginning of the academic year. It will provide a hold on the important concepts in the exam.\nFrequently Asked Questions on CBSE Class 3 Maths Syllabus 2023-24\nHow many chapters are available in the CBSE Class 3 Maths Syllabus?\nWhy is it important to go through the CBSE Class 3 Maths Syllabus for 2023-24?\nHow to score full marks using the CBSE Class 3 Maths Syllabus?",
  "pdf_content": "=== PDF: class_3_maths_1.pdf ===\n--- Page 1 ---\n \n \n \n \nCBSE Class 3 Syllabus for Maths \n2023-24 \n \nGeometry (16 hrs.)  \nSHAPES & SPATIAL UNDERSTANDING  \n• Creates shapes through paper folding, paper cutting.  \n• Identifies 2-D shapes  \n• Describes the various 2-D shapes by counting their sides, corners and diagonals.  \n• Makes shapes on the dot-grid using straight lines and curves.  \n• Creates shapes using tangram pieces.  \n• Matches the properties of two 2-D shapes by observing their sides and corners (vertices).  \n• Tiles a given region using a tile of a given shape.  \n• Distinguishes between shapes that tile and that do not tile.  \n• Intuitive idea of a map. Reads simple maps (not necessarily scaled) • Draws some 3D-objects \n \nNumbers (42 hrs.) \nNUMBER SEQUENCE UPTO 1000  \n• Reads and writes 3-digit numbers.  \n• Expands a number w.r.t. place values.  \n• Counts in different ways - starting from any number.  \n• Compares numbers.  \n• Forms greatest and smallest numbers using given digits. \n \nADDITION AND SUBTRACTION  \n• Adds and subtracts numbers by writing them vertically in the following two cases: – without \nregrouping. – with regrouping.  \n• Uses the place value in standard algorithm of addition and subtraction.  \n• Solves addition and subtraction problems in different situations presented through pictures and stories. \n• Frames problems for addition and subtraction facts. • Estimates the sum of, and difference between, \ntwo given numbers. \n \n \n\n\n--- Page 2 ---\n \n \n \n \nMULTIPLICATION  \n• Explains the meaning of multiplication (as repeated addition).  \n• Identifies the sign of multiplication.  \n• Constructs the multiplication tables of 2, 3, 4, 5 and 10  \n• Uses multiplication facts in situations.  \n• Multiplies two digit numbers using standard algorithm and Lattice multiplication algorithm.  \n \nDIVISION  \n• Explains the meaning of division from context of equal grouping and sharing.  \n• Relates division with multiplication.  \n• Completes division facts: – by grouping – by using multiplication tables. \n \nMENTAL ARITHMETIC  \n• Adds and subtracts single digit numbers and two digit numbers mentally.  \n• Doubles two digit numbers mentally (result not exceeding two digits). \n \nMoney (5 hrs.)  \n• Converts Rupee. to Paise using play money.  \n• Adds and subtracts amounts using column addition, and subtraction without regrouping.  \n• Makes rate charts and bills.  \n \nMeasurement (21 hrs.)  \nLENGTH  \n• Appreciates the need for a standard unit. \n• Measures length using appropriate standard units of length by choosing between centimetres. and \nmetres.  \n• Estimates the length of given object in standard units and verifies by measuring.  \n• Uses a ruler  \n• Relates centimetre. and metre \n \nWEIGHT  \n• Weighs objects using non standard Units.  \n\n\n--- Page 3 ---\n \n \n \n \n• Appreciates the conservation of weight.  \n \nVOLUME  \n• Measures and compares the capacity of different containers in terms of non-standard units.  \n• Appreciates the conservation of volume.  \n \nTIME \n• Reads a calendar to find a particular day and date.  \n• Reads the time correct to the hour.  \n• Sequences the events chronologically \n \nData Handling (6 hrs.)  \n• Records data using tally marks.  \n• Collects data and represents in terms of pictograph choosing appropriate scale and unit for display \nthrough pictographs.  \n• Draws conclusions from the data by discussing with the teacher.  \n \nPatterns (6 hrs.)  \n• Identifies simple symmetrical shapes and patterns.  \n• Makes patterns and designs from straight lines and other geometrical shapes.  \n• Identifies patterns in the numerals for odd and even numbers and in adding odd and even numbers.  \n• Partitions a number in different ways.  \n• Identifies patterns in his surroundings  \n• Identifies patterns in multiplication with, and dividing by 10s. \n \n \n \n \n \n \n",
  "pdf_urls": [
    "https://cdn1.byjus.com/wp-content/uploads/2023/04/CBSE-Syllabus-for-April-20-Class-3-Maths-2023-24.pdf"
  ],
  "extracted_at": "2026-01-29T11:00:20.038927",
  "pdf_local_files": [
    "syllabus/pdfs/class_3_maths_1.pdf"
  ],
  "pdf_parsed_at": "2026-01-30T13:29:25.965130"
}