{
  "url": "https://byjus.com/cbse-class-3-english-syllabus/",
  "title": "",
  "description": "",
  "units": [],
  "chapters": [],
  "topics": [],
  "marking_scheme": [],
  "raw_content": "CBSE Class 3 English Syllabusis interesting for students as they get to enhance their knowledge of various topics. The CBSE Class 3 English Syllabus covers chapters that are more into making the learning interesting for Class 3 students. TheCBSE Class 3students should prepare themselves accordingly following the syllabus so that they feel confident while appearing for their English exam.\nCBSE Class 3 English Syllabus for 2023-24 Academic Year\nTo download the CBSE Class 3 English syllabus, click on the link below.\nDownload CBSE Class 3 English Syllabus PDF for 2023-2024\n2023-24 CBSE Class 3 English Syllabus\nGet the latest Syllabus of CBSE Class 3 English for the academic year 2023-2024 for the benefit of the students. They can have a look at the chapters covered under the syllabus below.\nCBSE Class 3 English Chapters\nUnit 1:Good Morning\nThe Magic Garden\nUnit 2:Bird Talk\nNina and the Baby Sparrows\nUnit 3:Little by Little\nThe Enormous Turnip\nUnit 4:Sea Song\nA Little Fish Story\nUnit 5:The Balloon Man\nThe Yellow Butterfly\nUnit 6:Trains\nThe Story of the Road\nUnit 7:Puppy and I\nLittle Tiger, Big Tiger\nUnit 8:What’s in the Mailbox?\nMy Silly Sister\nUnit 9:Don’t Tell\nHe is My Brother\nUnit 10:How Creatures Move\nThe Ship of the Desert\nStudents can get the complete syllabus from Classes 1 to 12 by clicking onCBSE Syllabus. Learn Maths and Science in an interactive and fun-loving way with BYJU’S App/Tablet.Frequently Asked Questions on CBSE Class 3 English Syllabus 2023-24Q1Which textbook is used for Class 3 English as per CBSE Syllabus?The textbook used for Class 3 English as per CBSE Syllabus is Marigold. Students have to read the chapters thoroughly to ace well in the exam.Q2How many chapters will I learn in Class 3 English according to CBSE Syllabus?Students will learn about 10 chapters in Class 3 English according to the CBSE Syllabus. To score more marks, the solutions PDF are also available at BYJU’S.Q3Why should I depend on the CBSE Class 3 English Syllabus?The CBSE Class 3 syllabus contains all the details that a student should know about the subject before preparing for the exam. It also offers in-depth knowledge of important concepts for the annual examination.\nFrequently Asked Questions on CBSE Class 3 English Syllabus 2023-24\nWhich textbook is used for Class 3 English as per CBSE Syllabus?\nHow many chapters will I learn in Class 3 English according to CBSE Syllabus?\nWhy should I depend on the CBSE Class 3 English Syllabus?",
  "pdf_content": "=== PDF: class_3_english_1.pdf ===\n--- Page 1 ---\n \n \n \n \nCBSE Class 3 Syllabus for English \n2023-24 \n \nCBSE Class 3 English Syllabus Chapter Name \nUnit 1: Good Morning \nThe Magic Garden \nUnit 2: Bird Talk \nNina and the Baby Sparrows \nUnit 3: Little by Little \nThe Enormous Turnip \nUnit 4: Sea Song \nA Little Fish Story \nUnit 5: The Balloon Man \nThe Yellow Butterfly \nUnit 6: Trains \nThe Story of the Road \nUnit 7: Puppy and I \nLittle Tiger, Big Tiger \nUnit 8: What’s in the Mailbox? \nMy Silly Sister \nUnit 9: Don’t Tell \nHe is My Brother \nUnit 10: How Creatures Move \nThe Ship of the Desert  \n",
  "pdf_urls": [
    "https://cdn1.byjus.com/wp-content/uploads/2023/04/CBSE-Syllabus-for-Class-3-English-2023-24.pdf"
  ],
  "extracted_at": "2026-01-29T11:00:29.104214",
  "pdf_local_files": [
    "syllabus/pdfs/class_3_english_1.pdf"
  ],
  "pdf_parsed_at": "2026-01-30T13:29:26.877025"
}