{
  "url": "https://byjus.com/cbse/class-11-biology-syllabus/",
  "title": "",
  "description": "",
  "units": [
    {
      "headers": [
        "Units",
        "Unit Names",
        "Sections"
      ],
      "rows": [
        [
          "I",
          "Diversity of Living Organisms",
          "The Living WorldBiological ClassificationPlant KingdomAnimal Kingdom"
        ],
        [
          "II",
          "Structural Organisation in Plants and Animals",
          "Morphology of Flowering PlantsAnatomy of Flowering PlantsStructural Organisation in Animals"
        ],
        [
          "III",
          "Cell: Structure and Function",
          "Cell: The Unit of LifeBiomoleculesCell Cycle and Cell Division"
        ],
        [
          "IV",
          "Plant Physiology",
          "Photosynthesis in Higher PlantsRespiration in PlantsPlant-Growth and Development"
        ],
        [
          "V",
          "Human Physiology",
          "Breathing and Exchange of GasesBody Fluids and CirculationExcretory Products and their EliminationLocomotion and MovementNeural Control and CoordinationChemical Coordination and Integration"
        ]
      ]
    }
  ],
  "chapters": [],
  "topics": [],
  "marking_scheme": [
    {
      "headers": [
        "Evaluation Scheme",
        "Marks"
      ],
      "rows": [
        [
          "One Major Experiment Part A (Experiment No – 1, 3, 7, 8)",
          "5"
        ],
        [
          "One Minor Experiment Part A (Experiment No – 6, 9, 10, 11, 12, 13)",
          "4"
        ],
        [
          "Slide Preparation Part A (Experiment No – 2, 4, 5)",
          "5"
        ],
        [
          "Spotting Part B",
          "7"
        ],
        [
          "Practical Record + Viva Voce",
          "4"
        ],
        [
          "Project Record + Viva Voce",
          "5"
        ],
        [
          "Total",
          "30"
        ]
      ]
    }
  ],
  "raw_content": "CBSE Class 11 Biology syllabusfor the year 2023-24 has been released by the CBSE board on its official website. Download CBSE Syllabus for Class 11 Biology from the PDF link provided below. The Class 11 Biology Syllabus for the year 2023-24 does not have many changes when compared to the 2022-23 syllabus. Therefore, kids can check out the PDF and start their preparation from the beginning of their academic session in order to perform well in exams. Going through theCBSE syllabusfor Biology for Class 11 students will help them enhance their knowledge of concepts for better learning outcomes.\nStudents must focus on their studies and cover topics mentioned in the CBSE Syllabus for Class 11 Biology. The syllabus contains information on the course structure, the distribution of marks for each topic and subtopics, along with the time duration required to cover a topic. The Biology question paper is prepared according to the syllabus designed by the CBSE Board for theCBSE Class 11. Therefore, students must go through the CBSE Class 11 Biology Syllabus before planning their studies.\nCBSE Class 11 Biology Syllabus 2023-24\nThe CBSE Syllabus for Class 11 Biology 2023-24 has been released by the board. Students can download the syllabus PDF and go through it to plan their studies. The Class 11 Biology Syllabus PDF includes a practical syllabus, assignments and project information. Studying as per the syllabus will surely help students to increase their academic scores.\nCBSE Class 11 Biology Syllabus PDF 2023-24\nDownload PDF\nCBSE Syllabus for Class 11 Biology 2023-24: Marking Scheme\nStudents can have a look at the mark allocation of the CBSE Class 11 Biology Syllabus in the table below.\nTime:3 Hours\nMax. Marks:70\nEvaluation SchemeTheoryUnitsTopicsMarksIDiversity of Living Organisms15IIStructural Organisation in Plants and Animals10IIICell: Structure and Function15IVPlant Physiology12VHuman Physiology18Total Theory70\nEvaluation Scheme\nEvaluation Scheme\nTheory\nTheory\nUnitsTopicsMarks\nUnits\nTopics\nMarks\nIDiversity of Living Organisms15\nDiversity of Living Organisms\nIIStructural Organisation in Plants and Animals10\nStructural Organisation in Plants and Animals\nIIICell: Structure and Function15\nIII\nCell: Structure and Function\nIVPlant Physiology12\nPlant Physiology\nVHuman Physiology18\nHuman Physiology\nTotal Theory70\nTotal Theory\nStudents can also have a look at the syllabus of all the subjects by visitingCBSE Class 11 Syllabuspage at BYJU’S.\nCBSE Class 11 Biology Syllabus 2023-24: Unit-Wise Syllabus\nBelow you will find the unit-wise CBSE Class 11 Biology syllabus for the academic year 2023-24.\nUnitsUnit NamesSectionsIDiversity of Living OrganismsThe Living WorldBiological ClassificationPlant KingdomAnimal KingdomIIStructural Organisation in Plants and AnimalsMorphology of Flowering PlantsAnatomy of Flowering PlantsStructural Organisation in AnimalsIIICell: Structure and FunctionCell: The Unit of LifeBiomoleculesCell Cycle and Cell DivisionIVPlant PhysiologyPhotosynthesis in Higher PlantsRespiration in PlantsPlant-Growth and DevelopmentVHuman PhysiologyBreathing and Exchange of GasesBody Fluids and CirculationExcretory Products and their EliminationLocomotion and MovementNeural Control and CoordinationChemical Coordination and Integration\nUnitsUnit NamesSections\nUnits\nUnit Names\nSections\nIDiversity of Living OrganismsThe Living WorldBiological ClassificationPlant KingdomAnimal Kingdom\nDiversity of Living Organisms\nThe Living WorldBiological ClassificationPlant KingdomAnimal Kingdom\nBiological Classification\nPlant Kingdom\nAnimal Kingdom\nIIStructural Organisation in Plants and AnimalsMorphology of Flowering PlantsAnatomy of Flowering PlantsStructural Organisation in Animals\nStructural Organisation in Plants and Animals\nMorphology of Flowering PlantsAnatomy of Flowering PlantsStructural Organisation in Animals\nAnatomy of Flowering Plants\nStructural Organisation in Animals\nIIICell: Structure and FunctionCell: The Unit of LifeBiomoleculesCell Cycle and Cell Division\nIII\nCell: Structure and Function\nCell: The Unit of LifeBiomoleculesCell Cycle and Cell Division\nBiomolecules\nCell Cycle and Cell Division\nIVPlant PhysiologyPhotosynthesis in Higher PlantsRespiration in PlantsPlant-Growth and Development\nPlant Physiology\nPhotosynthesis in Higher PlantsRespiration in PlantsPlant-Growth and Development\nRespiration in Plants\nPlant-Growth and Development\nVHuman PhysiologyBreathing and Exchange of GasesBody Fluids and CirculationExcretory Products and their EliminationLocomotion and MovementNeural Control and CoordinationChemical Coordination and Integration\nHuman Physiology\nBreathing and Exchange of GasesBody Fluids and CirculationExcretory Products and their EliminationLocomotion and MovementNeural Control and CoordinationChemical Coordination and Integration\nBody Fluids and Circulation\nExcretory Products and their Elimination\nLocomotion and Movement\nNeural Control and Coordination\nChemical Coordination and Integration\nCBSE Class 11 Biology Practical Syllabus: List of Experiments\nBelow you will find the Practical Biology syllabus 2023-24 below.\nEvaluation SchemeMarksOne Major Experiment Part A (Experiment No – 1, 3, 7, 8)5One Minor Experiment Part A (Experiment No – 6, 9, 10, 11, 12, 13)4Slide Preparation Part A (Experiment No – 2, 4, 5)5Spotting Part B7Practical Record + Viva Voce4Project Record + Viva Voce5Total30\nEvaluation SchemeMarks\nEvaluation Scheme\nMarks\nOne Major Experiment Part A (Experiment No – 1, 3, 7, 8)5\nOne Major Experiment Part A (Experiment No – 1, 3, 7, 8)\nOne Minor Experiment Part A (Experiment No – 6, 9, 10, 11, 12, 13)4\nOne Minor Experiment Part A (Experiment No – 6, 9, 10, 11, 12, 13)\nSlide Preparation Part A (Experiment No – 2, 4, 5)5\nSlide Preparation Part A (Experiment No – 2, 4, 5)\nSpotting Part B7\nSpotting Part B\nPractical Record + Viva Voce4\nPractical Record + Viva Voce\nProject Record + Viva Voce5\nProject Record + Viva Voce\nTotal30\nTotal\nCBSE Class 11 Biology Practical\nA: List of Experiments:\n1. Study and describe locally available common flowering plants from the family Solanaceae (Poaceae, Asteraceae or Brassicaceae can be substituted in case of particular geographical location), including dissection and display of floral whorls, anther and ovary to show a number of chambers (floral formulae and floral diagrams), type of root (tap and adventitious); type of stem (herbaceous and woody); leaf (arrangement, shape, venation, simple and compound).\n2. Preparation and study of T.S. of dicot and monocot roots and stems (primary).\n3. Study of osmosis by potato osmometer.\n4. Study of plasmolysis in epidermal peels (e.g. Rhoeo/lily leaves or flashy scale leaves of onion bulb).\n5. Study of distribution of stomata on the upper and lower surfaces of leaves.\n6. Comparative study of the rates of transpiration in the upper and lower surfaces of leaves.\n7. Test for the presence of sugar, starch, proteins and fats in suitable plant and animal materials.\n8. Separation of plant pigments through paper chromatography.\n9. Study of the rate of respiration in flower buds/leaf tissue and germinating seeds.\n10. Test for the presence of urea in urine.\n11. Test for the presence of sugar in urine.\n12. Test for the presence of albumin in urine.\n13. Test for the presence of bile salts in urine.\nB. Study and Observer the following (spotting):\n1. Parts of a compound microscope.\n2. Specimens/slides/models and identification with reasons – Bacteria, Oscillatoria, Spirogyra, Rhizopus, mushroom, yeast, liverwort, moss, fern, pine, one monocotyledonous plant, one dicotyledonous plant and one lichen.\n3. Virtual specimens/slides/models and identifying features of – Amoeba, Hydra, liverfluke, Ascaris, leech, earthworm, prawn, silkworm, honeybee, snail, starfish, shark, rohu, frog, lizard, pigeon and rabbit.\n4. Mitosis in onion root tip cells and animal cells (grasshopper) from permanent slides.\n5. Different types of inflorescence (cymose and racemose).\n6. Human skeleton and different types of joints with the help of virtual images/models only.\nCBSE Class 11 Biology Syllabus for Visually-Impaired Students\nBelow you will find the CBSE Class 11 Syllabus for Biology Practical.\nA. Items for Identification/Familiarity with the apparatus /equipment /animal and plant material/chemicals for assessment in practicals (All experiments)\nB. Equipment – compound microscope, test tube, petri dish, chromatography paper, chromatography chamber, beaker, scalpel\nChemical – alcoholModels – Model of Human skeleton to show – Ball and socket joints of girdles and limbs, Rib cage, Honeycomb, Mollusc shell, Pigeon and Starfish, cockroachSpecimen/Fresh Material – mushroom, succulents such as Aloe vera/ kalenchoe, raisins, potatoes, seeds of monocot and dicot- maize and gram or any other plant, plants of Solanaceae – Brinjal, Petunia, any other\nC. List of Practicals1. Study locally available common flowering plants of the family – Solanaceae, and identify the type of stem (Herbaceous or Woody) and type of leaves (Compound or Simple).2. Study the parts of a compound microscope- eyepiece and objective lens, mirror, stage, coarse and fine adjustment knobs.3. Differentiate between monocot and dicot plants on the basis of venation patterns.4. Study the following parts of the human skeleton (Model): Ball and socket joints of the thigh and shoulder5. Rib cage6. Study honeybee/butterfly, snail/sheik snail through the shell, Starfish, and Pigeon (through models).7. Identify the given specimen of a fungus – mushroom, gymnosperm-pine cone8. Identify and relate the experimental set-up with the aim of the experiment: For Potato Osmometer/endosmosis in raisins.\nVisit theCBSE Syllabuspage to get the syllabus of all subjects from Classes 1 to 12. Get access to interactive lessons and study videos with the BYJU’S App/ Tablet.Frequently Asked Questions on CBSE Class 11 Biology Syllabus 2023-24Q1What are the concepts covered in the CBSE Class 11 Biology Syllabus?The concepts covered in the CBSE Class 11 Biology Syllabus are a structural organization in plants and animals, diversity of living organisms, cell – structure and function, and plant and human physiology.Q2How much are the passing marks as per the CBSE Class 11 Biology Syllabus?Students should score a minimum of 35-40 marks out of 100 in the subject Biology in order to pass the final examination.Q3In the practical exam, how much are the marks for record and viva voce according to the CBSE Syllabus for Class 11 Biology?The mark for record and viva voce, according to the CBSE Syllabus for Class 11 Biology, is 9 marks.\nFrequently Asked Questions on CBSE Class 11 Biology Syllabus 2023-24\nWhat are the concepts covered in the CBSE Class 11 Biology Syllabus?\nHow much are the passing marks as per the CBSE Class 11 Biology Syllabus?\nIn the practical exam, how much are the marks for record and viva voce according to the CBSE Syllabus for Class 11 Biology?",
  "pdf_content": "=== PDF: class_11_biology_1.pdf ===\n--- Page 1 ---\n1 \nBIOLOGY (Code No. 044) \nClasses XI & XII (2023-24) \nThe present curriculum provides the students with updated concepts along with an extended \nexposure to contemporary areas of the subject. The curriculum also aims at emphasizing the \nunderlying principles that are common to animals, plants and microorganisms as well as \nhighlighting the relationship of Biology with other areas of knowledge. The format allows a simple, \nclear, sequential flow of concepts. It relates the study of biology to real life through the \ndevelopments in use of technology. It links the discoveries and innovations in biology to everyday \nlife such as environment, industry, health and agriculture. The updated curriculum also focuses on \nunderstanding and application of scientific principles, while ensuring that ample opportunities and \nscope for learning and appreciating basic concepts continue to be available within itsframework. \nThe prescribed syllabus is expected to: \n\npromote understanding of basic principles of Biology\n\nencourage learning of emerging knowledge and its relevance to individual and society\n\npromote rational/scientific attitude towards issues related to population, environment and\ndevelopment\n\nenhance awareness about environmental issues, problems and their appropriate solutions\n\ncreate awareness amongst the learners about diversity in the living organisms and\ndeveloping respect for other living beings\n\nappreciate that the most complex biological phenomena are built on essentially simple\nprocesses\nIt is expected that the students would get an exposure to various branches of Biology in the \ncurriculum in a more contextual and systematic manner as they study its various units. \nBIOLOGY (Code No. 044) \nCOURSE STRUCTURE \nCLASS XI (2023 -24) (THEORY) \nTime: 03 Hours \nMax. Marks: 70 \nUnit \nTitle \nMarks \nI \nDiversity of Living Organisms \n15 \nII \nStructural Organization in Plants and Animals \n10 \nIII \nCell: Structure and Function \n15 \nIV \nPlant Physiology \n12 \nV \nHuman Physiology \n18 \nTotal \n70 \nCBSE Class 11 Biology Syllabus 2023-24\n\n\n--- Page 2 ---\n2 \n \nUnit-I Diversity of Living Organisms \n \nChapter-1: The Living World \nBiodiversity; Need for classification; three domains of life; taxonomy and systematics; concept \nof species and taxonomical hierarchy; binomial nomenclature \n \nChapter-2: Biological Classification \nFive kingdom classification; Salient features and classification of Monera, Protista and Fungi \ninto major groups; Lichens, Viruses and Viroids. \n \nChapter-3: Plant Kingdom \nClassification of plants into major groups; Salient and distinguishing features and a few examples \nof Algae, Bryophyta, Pteridophyta, Gymnospermae (Topics excluded – Angiosperms, Plant Life \nCycle and Alternation of Generations) \n \nChapter-4: Animal Kingdom \nSalient features and classification of animals, non-chordates up to phyla level and chordates up \nto class level (salient features and at a few examples of each category). \n(No live animals or specimen should be displayed.) \n        Unit-II Structural Organization in Plant s      and Animals  \nChapter-5: Morphology of Flowering Plants \nMorphology of different parts of flowering plants: root, stem, leaf, inflorescence, flower, fruit and \nseed. Description of family Solanaceae \n \nChapter-6: Anatomy of Flowering Plants \nAnatomy and functions of tissue systems in dicots and monocots. \n \nChapter-7: Structural Organisation in Animals \nMorphology, Anatomy and functions of different systems (digestive, circulatory,respiratory, nervous and \nreproductive) of frog. \nUnit-III Cell: Structure and Function \nChapter-8: Cell-The Unit of Life \nCell theory and cell as the basic unit of life, structure of prokaryotic and eukaryotic cells; Plant cell \nand animal cell; cell envelope; cell membrane, cell wall; cell organelles - structure and function; \nendomembrane system, endoplasmic reticulum, golgi bodies, lysosomes, vacuoles, mitochondria, \nribosomes, plastids, microbodies; cytoskeleton, cilia, flagella, centrioles (ultrastructure and \nfunction); nucleus. \n\n\n--- Page 3 ---\n3 \nChapter-9: Biomolecules \nChemical constituents of living cells: biomolecules, structure and function of proteins, \ncarbohydrates, lipids, and nucleic acids; Enzyme - types, properties, enzyme action. (Topics \nexcluded: Nature of Bond Linking Monomers in a Polymer, Dynamic State of Body Constituents \n– Concept of Metabolism, Metabolic Basis of Living, The Living State)\nChapter-10: Cell Cycle and Cell Division \nCell cycle, mitosis, meiosis and their significance \nUnit-IV Plant Physiology \nChapter-13: Photosynthesis in Higher Plants \nPhotosynthesis as a means of autotrophic nutrition; site of photosynthesis, pigments involved in \nphotosynthesis (elementary idea); photochemical and biosynthetic phases of photosynthesis; cyclic \nand non-cyclic photophosphorylation; chemiosmotic hypothesis; photorespiration; C3 and C4 \npathways; factors affecting photosynthesis. \nChapter-14: Respiration in Plants \nExchange of gases; cellular respiration - glycolysis, fermentation (anaerobic), TCA cycle and \nelectron transport system (aerobic); energy relations - number of ATP molecules generated; \namphibolic pathways; respiratory quotient. \nChapter-15: Plant - Growth and Development \nSeed germination; phases of plant growth and plant growth rate; conditions of growth; \ndifferentiation, dedifferentiation and redifferentiation; sequence of developmental processes in a \nplant cell; plant growth regulators - auxin, gibberellin, cytokinin, ethylene, ABA. \nUnit-V Human Physiology \nChapter-17: Breathing and Exchange of Gases \nRespiratory organs in animals (recall only); Respiratory system in humans; mechanism of \nbreathing and its regulation in humans - exchange of gases, transport of gases and regulation of \nrespiration, respiratory volume; disorders related to respiration - asthma, emphysema, occupational \nrespiratory disorders. \nChapter-18: Body Fluids and Circulation \nComposition of blood, blood groups, coagulation of blood; composition of lymph and its function; \nhuman circulatory system - Structure of human heart and blood vessels; cardiac cycle, cardiac \noutput, ECG; double circulation; regulation of cardiac activity; disorders of circulatory system - \nhypertension, coronary artery disease, angina pectoris, heart failure. \n\n\n--- Page 4 ---\n4 \nChapter-19: Excretory Products and their Elimination \nModes of excretion - ammonotelism, ureotelism, uricotelism; human excretory system – structure \nand function; urine formation, osmoregulation; regulation of kidney function - renin - angiotensin, \natrial natriuretic factor, ADH and diabetes insipidus; role of other organs in excretion; disorders - \nuremia, renal failure, renal calculi, nephritis; dialysis and artificial kidney, kidney transplant. \nChapter-20: Locomotion and Movement \nTypes of movement - ciliary, flagellar, muscular; skeletal muscle, contractile proteins and muscle \ncontraction; skeletal system and its functions; joints; disorders of muscular and skeletal systems - \nmyasthenia gravis, tetany, muscular dystrophy, arthritis, osteoporosis, gout. \nChapter-21: Neural Control and Coordination \nNeuron and nerves; Nervous system in humans - central nervous system; peripheral nervous \nsystem and visceral nervous system; generation and conduction of nerve impulse \nChapter-22: Chemical Coordination and Integration \nEndocrine glands and hormones; human endocrine system - hypothalamus, pituitary, pineal, \nthyroid, parathyroid, adrenal, pancreas, gonads; mechanism of hormone action (elementary idea); \nrole of hormones as messengers and regulators, hypo - and hyperactivity and related disorders; \ndwarfism, acromegaly, cretinism, goiter, exophthalmic goitre, diabetes, Addison's disease. \nNote: Diseases related to all the human physiological systems to be taught in brief. \nPRACTICALS \nTime: 03 Hours \nMax. Marks: 30 \nEvaluation Scheme \nMarks \nOne Major Experiment Part A (Experiment No- 1,3,7,8) \n5 Marks \nOne Minor Experiment Part A (Experiment No- 6,9,10,11,12,13) \n4 Marks \nSlide Preparation Part A (Experiment No- 2,4,5) \n5 Marks \nSpotting Part B \n7 Marks \nPractical Record + Viva Voce \n(Credit to the student’s work over \nthe academic session may be \ngiven) \n4 Marks \nProject Record + Viva Voce \n5 Marks \nTotal \n30Marks \nA: List of Experiments \n1. Study and describe locally available common flowering plants, from family Solanaceae\n(Poaceae, Asteraceae or Brassicaceae can be substituted in case of particular geographical\nlocation) including dissection and display of floral whorls, anther and ovary to show\nnumber of chambers (floral formulae and floral diagrams), type of root (tap and\nadventitious); type of stem (herbaceous and woody); leaf (arrangement, shape, venation,\nsimple and compound).\n\n\n--- Page 5 ---\n5 \n2. Preparation and study of T.S. of dicot and monocot roots and stems (primary).\n3. Study of osmosis by potato osmometer.\n4. Study of plasmolysis in epidermal peels (e.g. Rhoeo/lily leaves or flashy scale leaves of\nonion bulb).\n5. Study of distribution of stomata on the upper and lower surfaces of leaves.\n6. Comparative study of the rates of transpiration in the upper and lower surfaces of leaves.\n7. Test for the presence of sugar, starch, proteins and fats in suitable plant and animal\nmaterials.\n8. Separation of plant pigments through paper chromatography.\n9. Study of the rate of respiration in flower buds/leaf tissue and germinating seeds.\n10. Test for presence of urea in urine.\n11. Test for presence of sugar in urine.\n12. Test for presence of albumin in urine.\n13. Test for presence of bile salts in urine.\nB. Study and Observe the following (spotting):\n1. Parts of a compound microscope.\n2. Specimens/slides/models and identification with reasons - Bacteria, Oscillatoria,\nSpirogyra, Rhizopus, mushroom, yeast, liverwort, moss, fern, pine, one monocotyledonous\nplant, one dicotyledonous plant and one lichen.\n3. Virtual specimens/slides/models and identifying features of - Amoeba, Hydra,liverfluke,\nAscaris, leech, earthworm, prawn, silkworm, honey bee, snail, starfish, shark, rohu, frog,\nlizard, pigeon and rabbit.\n4. Mitosis in onion root tip cells and animals cells (grasshopper) from permanent slides.\n5. Different types of inflorescence (cymose and racemose).\n6. Human skeleton and different types of joints with the help of virtual images/models only.\nPractical Examination for Visually Impaired Students Class XI \nNote: The ‘Evaluation schemes’ and ‘General Guidelines’ for visually impaired students as \ngiven for Class XII may be followed. \nA. Items for Identification/Familiarity with the apparatus /equipment /animal and plant\nmaterial / chemicals. for assessment in practicals (All experiments)\nB. Equipment - compound microscope, test tube, petri dish, chromatography paper,\nchromatography chamber, beaker, scalpel\nChemical – alcohol\nModels – Model of Human skeleton to show – Ball and socket joints of girdles and limbs, Rib cage, Honey\ncomb, Mollusc shell, Pigeon and Star fish, cockroach\nSpecimen/Fresh Material – mushroom, succulents such as Aloe vera/ kalenchoe, raisins, potatoes,\nseeds of monocot and dicot- maize and gram or any other plant, plants of Solanaceae - Brinjal, Petunia,\nany other\nC. List of Practicals\n1. Study locally available common flowering plants of the family – Solanaceae and\n\n\n--- Page 6 ---\n6 \nidentify type of stem (Herbaceous or Woody), type of leaves (Compound or Simple). \n2. Study the parts of a compound microscope- eye piece and objective lens, mirror, stage,\ncoarse and fine adjustment knobs.\n3. Differentiate between monocot and dicot plants on the basis of venation patterns.\n4. Study the following parts of human skeleton (Model): Ball and socket joints of thigh\nand shoulder\n5. Rib cage\n6. Study honeybee/butterfly, snail/sheik snail through shell, Starfish, Pigeon (through\nmodels).\n7. Identify the given specimen of a fungus – mushroom, gymnosperm-pine cone\n8. Identify and relate the experimental set up with the aim of experiment:\nFor Potato Osmometer/endosmosis in raisins.\nNote: The above practicals may be carried out in an experiential manner rather than only recording \nobservations. \nPrescribed Books: \n1. Biology Class-XI, Published by NCERT\n2. Other related books and manuals brought out by NCERT (including multimedia).\n\n\n--- Page 7 ---\n10 \nPractical Examination for Visually Impaired Students of Classes XI and XII \nEvaluation Scheme \nTime: 02 Hours \nMax. Marks: 30 \nTopic \nMarks \nIdentification/Familiarity with the apparatus \n5 \nWritten test (Based on given / prescribed practicals) \n10 \nPractical Records \n5 \nViva \n10 \nTotal \n30 \nGeneral Guidelines \n\nThe practical examination will be of two hour duration. A separate list of ten experiments\nis included here.\n\nThe written examination in practicals for these students will be conducted at the time of\npractical examination of all other students.\n\nThe written test will be of 30 minutes duration.\n\nThe question paper given to the students should be legibly typed. It should contain a total\nof 15 practical skill based very short answer type questions. A student would be required\nto answer any 10 questions.\n\nA writer may be allowed to such students as per CBSE examination rules.\n\nAll questions included in the question paper should be related to the listed practicals. Every\nquestion should require about two minutes to be answered.\n\nThese students are also required to maintain a practical file. A student is expected to record\nat least five of the listed experiments as per the specific instructions for each subject. These\npracticals should be duly checked and signed by the internal examiner.\n\nThe format of writing any experiment in the practical file should include aim, apparatus\nrequired, simple theory, procedure, related practical skills, precautions etc.\n\nQuestions may be generated jointly by the external/internal examiners and used for\nassessment.\n\nThe viva questions may include questions based on basic theory / principle / concept,\napparatus / materials / chemicals required, procedure, precautions, sources of error etc.\n",
  "pdf_urls": [
    "https://cdn1.byjus.com/wp-content/uploads/2023/04/CBSE-Syllabus-for-Class-11-Biology-2023-24.pdf"
  ],
  "extracted_at": "2026-01-29T11:04:46.988455",
  "pdf_local_files": [
    "syllabus/pdfs/class_11_biology_1.pdf"
  ],
  "pdf_parsed_at": "2026-01-30T13:29:27.750791"
}