{
  "url": "https://byjus.com/cbse-class-11-english-syllabus/",
  "title": "",
  "description": "",
  "units": [],
  "chapters": [],
  "topics": [
    "CBSE Class 11 English Core Syllabus PDF 2023-24",
    "CBSE Class 11 English Elective Syllabus PDF 2023-24",
    "Title",
    "Numbering and indenting",
    "Key/glossary",
    "Notes",
    "Content",
    "Expression",
    "The Portrait of a Lady (Prose)",
    "A Photograph (Poem)",
    "“We’re Not Afraid to Die… if we can be together",
    "Discovering Tut: the Saga Continues •The Laburnum Top (Poem)",
    "The Voice of the Rain (Poem) •Childhood (Poem)",
    "The Adventure",
    "Silk Road (Prose)",
    "Father to Son",
    "The Summer of the Beautiful White Horse (Prose)",
    "The Address (Prose)",
    "Mother’s Day (Play)",
    "Birth ( Prose)",
    "The Tale of Melon City",
    "Assessment of Listening Skills – 05 marks",
    "Assessment of Speaking Skills – 05 Marks",
    "Project Work – 10 Marks",
    "Presentation – book review /a play /a short story/a novel/novella (tale, table, parable) to be followed by a question answer session.",
    "Poetry reading to be followed by interpretative tasks based on close reading and literary analysis of the text.",
    "Critical review of a film or a play.",
    "Conducting a theatre workshop to be followed by a discussion",
    "The Lament -Anton Chekhov",
    "A Pair of Mustachios -Mulk Raj Anand",
    "The Rocking-horse Winner- D.H. Lawrence",
    "The Adventure of the Three Garridebs",
    "Pappachi’s Moth",
    "The Third and FinalContinent",
    "The Peacock- Sujata Bhatt",
    "Let me Not to the Marriage of True Minds William Shakespeare",
    "Coming- Philip Larkin",
    "Telephone Conversation – Wole Soyinka",
    "The World is tooMuch With Us",
    "Mother Tongue",
    "Hawk Roosting",
    "Ode to a Nightingale",
    "My Watch",
    "My Three Passions",
    "Patterns of Creativity",
    "Tribal Verse",
    "What is a Good Book?",
    "The Story",
    "Bridges"
  ],
  "marking_scheme": [],
  "raw_content": "CBSE Syllabus for Class 11 English Syllabusfor the academic year 2023-24 is provided here. Students can perform well in their English exam by understanding the CBSE board prescribed syllabus for English Core and English Elective. To score well in their English exam, students should prepare themselves according to the syllabus because the final question paper is prepared by referring to the prescribed syllabus. CBSE Syllabus for Class 11 English for academic year 2023-24 is provided here. It describes the course content along with marks weightage and time duration for each unit. TheCBSE Class 11 Syllabusalso provides information about the textbooks that need to be referred by Class 11 students.\nCBSE Class 11 English Syllabus 2023-2024\nThe CBSE Syllabus for Class 11 English 2023-24 is released by the board. Students can download the syllabus PDF and go through it to plan their studies.\nCBSE Class 11 English Core Syllabus PDF 2023-24\nCBSE Class 11 English Elective Syllabus PDF 2023-24\nThe CBSE Syllabus of English Core subject is provided in PDF format for downloading below. Also, students can find the link to download PDF for English Elective further below on this page. In the PDF, students will also find the marking scheme for each chapter.\nCBSE Class 11 Syllabus for English Core 2023-24\nSection A: Reading Skills\nI Reading Comprehension through Unseen Passage: 18 Marks\n1. One unseen passage to assess comprehension, interpretation inference and vocabulary. The passage may be factual, descriptive or literary.\n2. One unseen case-based passage with verbal/visual inputs like statistical data, charts etc.\nNote: The combined word limit for both the passages will be 600-750.Multiple Choice Questions / Objective Type Questions will be asked.\n3. Note Making and Summarization based on a passage of approximately 200-250 words.\ni. Note Making: 5 Marks\nTitle\nNumbering and indenting\nKey/glossary\nNotes\nii. Summary (up to 50 words): 3 Marks\nContent\nExpression\nV. Grammar and Creative Writing Skills  (23 Marks)\nSection B\nII. Grammar: 7 Marks4. Questions on Gap filling (Tenses, Clauses)5. Questions on re-ordering/transformation of sentences\nIII. Creative Writing Skills: 16 Marks\n6. Short Writing Tasks\nClassified Advertisements up to 50 words. One out of the two given questions to be answered (3 Marks: Format : 1 / Content : 1 / Expression : 1)\n7. Short Writing Task\nPoster up to 50 words. One out of the two given questions to be answered.(3marks:Format : 1 / Content : 1 / Expression : 1)\n8. Long Writing task:\nSpeech in 120-150 words based on verbal / visual cues related to contemporary / age-appropriate topic. One out of the two given questions to be answered. (5 Marks: Format: 1 / Content: 2 / Expression: 2)\\\n9. Long Writing Task:\nDebate based on visual/verbal inputs in 120-150 words, thematically related to contemporary, topical issues. One out of the two given questions to be answered. (5 Marks: Format: 1 / Content: 2 / Expression: 2)\nSection C:\nLiterature Textbook and Supplementary Reading Textbook\nThis section will have variety of assessment items including Multiple Choice Questions, Objective Type Questions, Short Answer Type Questions and Long Answer Type Questions to assess comprehension, analysis, interpretation and extrapolation beyond the text.\nVI. Reference to the Context\n10. One Poetry extract out of two from the book Hornbill to assess comprehension, interpretation, analysis and appreciation. (3×1=3 Marks)\n11. One Prose extract out of two from the book Hornbill to assess comprehension, interpretation, analysis and appreciation. (3×1=3 Marks)\n12. One prose extract out of two from the book Snapshots to assess comprehension, interpretation and analysis. (4×1=4 Marks)\n13. Two Short answer type question (one from Prose and one from Poetry from the book Hornbill), out of four, to be answered in 40-50 words. Questions should elicit inferential responses through critical thinking. (3×2=6 Marks)\n14. One Short answer type question, from the book Snapshots, to be answered I n 40- 50 words. Questions should elicit inferential responses through critical thinking. Any 1 out of 2 questions to be done. (3×1=3 Marks)\n15. One Long answer type question, from Prose/Poetry Hornbill, to be answered in 120-150 words. Questions can be based on incident / theme / passage / extract / event as reference points to assess extrapolation beyond and across the text. The question will elicit analytical and evaluative response from student. Any 1 out of 2 questions to be done. (1×6=6 Marks)\n16. One Long answer type question, based on the chapters from the book Snapshots to be answered in 120-150 words to assess global comprehension and extrapolation beyond the text. Questions to provide evaluative and analytical responses using incidents, events, themes as reference points. Any 1 out of 2 questions to be done. (1×6=6 Marks)\nPrescribed Books\n1. Hornbill:English Reader published by National Council of Education Research and Training, New Delhi\nThe Portrait of a Lady (Prose)\nA Photograph (Poem)\n“We’re Not Afraid to Die… if we can be together\nDiscovering Tut: the Saga Continues •The Laburnum Top (Poem)\nThe Voice of the Rain (Poem) •Childhood (Poem)\nThe Adventure\nSilk Road (Prose)\nFather to Son\n2. Snapshots:Supplementary Reader published by National Council of Education Research and Training, New Delhi\nThe Summer of the Beautiful White Horse (Prose)\nThe Address (Prose)\nMother’s Day (Play)\nBirth ( Prose)\nThe Tale of Melon City\nInternal Assessment for CBSE Class 11 English Core 2023-24\nAssessment of Listening Skills – 05 marks\nAssessment of Speaking Skills – 05 Marks\nProject Work – 10 Marks\nStudents can also have a look at the English Elective Syllabus PDF ofClass 11 CBSEbelow.\nCBSE Class 11 Syllabus for English Elective 2023-24\nSection A:\nReading Comprehension (25 Marks)\nTwo unseen passages and a poem\n1. 12 out of 15 questions from a literary or discursive passage of about 950-1000 words.\n2. 8 questions to test interpretation and appreciation of a poem of about 10-12 lines.\n3. 5 out of 7 questions from a case-based passage (with visual input- statistical data, chart etc.) of 100-120 words to test interpretation.\nSection B:\nCreative Writing Skills (15 Marks)\n4. An Essay on an argumentative/discursive/reflective/descriptive topic, leading to creative rendering, forming and defending of opinions, to be answered in 120-150 words. (5 marks)\n5. Article on one out of two topics to be answered in 120-150 words. Contemporary topical issues to be a part of Article writing. (5 marks)\n6. Speech on one out of two topics to be answered in 120-150 words. Contemporary topical issues to be a part of Speech writing. (5 marks)\nSection C\nThis section will have variety of assessment items including Multiple Choice Questions, Objective Type Questions, Short Answer Type Questions and Long Answer Type Questions to assess comprehension, analysis, interpretation and extrapolation beyond the text.\nBook-Woven Words\n7. Reference to the Contexti. One Prose extract out of two to assess comprehension, Literary, appreciation and inference.ii. One Poetry extract out of two to assess comprehension, Literary, appreciation and inference. (5+5=10 Marks)\n8. Two Short Answer Question out of three to be answered in 30-40 words to assess understanding, analysis and critical appreciation. Questions should elicit inferential responses through critical thinking. (2×2=4 marks)\n9. Two Short Answer Question out of three to be answered in 50-60 words to assess understanding, analysis and critical appreciation. Questions should elicit inferential responses through critical thinking. (3×2=6marks)\nArms and the Man – [Drama]\n10. Two Long Answer Questions out of three to be answered in 80-100 words to appreciate characters, events and episodes. Questions to provide analytical responses using incidents, events, themes as reference points. (5×2=10 marks)\nFiction\n11. One Short Answer Question out of two to be answered in 30-40 words to critically appreciate characters, events, episodes and interpersonal relationships and to form their opinions with reference to content, events and episode. (2 marks)\n12. One Short Answer Question out of two to be answered in 50-60 words to assess understanding, analysis and critical appreciation. Questions should elicit inferential responses through critical thinking. (3 marks)\n13. One Long Answer Question out of two to be answered in 120-150 words to test literary appreciation and to draw inferences. Questions should elicit creative responses and develop ability to form opinions. (5 marks)\nSeminar (20 Marks)\nPresentation – book review /a play /a short story/a novel/novella (tale, table, parable) to be followed by a question answer session.\nPoetry reading to be followed by interpretative tasks based on close reading and literary analysis of the text.\nCritical review of a film or a play.\nConducting a theatre workshop to be followed by a discussion\nPrescribed Books:\n1. Text book: Woven Words published by NCERT\n2. Fiction: The Old Man and the Sea (Novel unabridged) by Ernest Hemingway\n3. Drama: Arms and the Man by George Bernard Shaw\nBook-Woven Words – Short Stories\nThe Lament -Anton Chekhov\nA Pair of Mustachios -Mulk Raj Anand\nThe Rocking-horse Winner- D.H. Lawrence\nThe Adventure of the Three Garridebs\nPappachi’s Moth\nThe Third and FinalContinent\nBook-Woven Words – Poetry\nThe Peacock- Sujata Bhatt\nLet me Not to the Marriage of True Minds William Shakespeare\nComing- Philip Larkin\nTelephone Conversation – Wole Soyinka\nThe World is tooMuch With Us\nMother Tongue\nHawk Roosting\nOde to a Nightingale\nBook-Woven Words-Essays\nMy Watch\nMy Three Passions\nPatterns of Creativity\nTribal Verse\nWhat is a Good Book?\nThe Story\nBridges\nLearn Maths & Science as perCBSE Syllabusin an interactive and fun-loving way, with BYJU’S App/Tablet.Frequently Asked Questions on CBSE Class 11 English Syllabus 2023-24Q1How is the CBSE Class 11 English Syllabus 2023-24 divided?The syllabus of CBSE Class 11 English Elective Syllabus is divided into three reading comprehension, creative writing skills and literature textbook, whereas, the CBSE Class 11 English Core Syllabus is divided into reading comprehension through unseen passages, grammar and creative writing skills and literature textbook and supplementary reading text.Q2What is the marks weightage for each section in the CBSE Class 11 English Syllabus?The marks weightage for each section in the CBSE Class 11 English Elective Syllabus is 25 marks for reading skills, 15 marks for creative writing skills and 20 marks for literature skills, whereas the mark weightage for CBSE Class 11 English Core Syllabus is 18 marks for reading comprehension through unseen passages, 23 marks for grammar and creative writing skills and 31 marks for literature textbook and supplementary reading text.Q3What are the prescribed books for the CBSE Class 11 English Syllabus?The prescribed books for the CBSE Class 11 English Syllabus is Hornbill and Snapshots.\nFrequently Asked Questions on CBSE Class 11 English Syllabus 2023-24\nHow is the CBSE Class 11 English Syllabus 2023-24 divided?\nWhat is the marks weightage for each section in the CBSE Class 11 English Syllabus?\nWhat are the prescribed books for the CBSE Class 11 English Syllabus?",
  "pdf_content": "=== PDF: class_11_english_1.pdf ===\n--- Page 1 ---\nENGLISH CORE \nCODE NO. 301 \nCLASS – XI  \n  2023-24 \nSection A – 26 Marks \nReading Skills \nI Reading Comprehension through Unseen Passages \n(10+8=18 Marks) \n1. One unseen passage to assess comprehension, interpretation, analysis, inference\nand vocabulary. The passage may be factual, descriptive or literary.\n2. One unseen case-based factual passage with verbal/visual inputs like statistical data,\ncharts etc.to assess comprehension, interpretation, analysis, inference and evaluation.\nNote: The combined word limit for both the passages will be 600-750. \nMultiple Choice Questions / Objective Type Questions will be asked. \n3. Note Making and Summarization based on a passage of approximately 200-250 words.\ni.\nNote Making:\n5 Marks \n○\nTitle:\n1 \n○\nNumbering and indenting:\n1 \n○\nKey/glossary:\n1 \n○\nNotes:\n2 \nii.\nSummary (up to 50 words):\n3 Marks \n○\nContent:\n2 \n○\nExpression:\n1 \nSection B – 23 Marks \nGrammar and Creative Writing Skills \nII Grammar \n7 Marks \n4. Questions on Gap filling (Tenses, Clauses)\n5. Questions on re-ordering/transformation of sentences\n(Total seven questions to be done out of the eight given). \nIII Creative Writing Skills \n16 Marks \n6. Short writing task – Classified Advertisements, up to 50 words. One out of the two\ngivenquestions to be answered (3 Marks: Format : 1 / Content : 1 / Expression : 1)\nCBSE Class 11 English Core Syllabus 2023-24\n\n\n--- Page 2 ---\n7. Short writing task –Poster up to 50 words. One out of the two given questions to be\nanswered.(3 marks:Format : 1 / Content : 1 / Expression : 1)\n8. Long Writing task: Speech in 120-150 words based on verbal / visual cues related to\ncontemporary / age-appropriate topic. One out of the two given questions to be answered.\n(5 Marks: Format: 1 / Content: 2 / Expression: 2)\n9. Long Writing Task: Debate based on visual/verbal inputs in 120-150 words,\nthematically related to contemporary, topical issues. One out of the two given questions\nto be answered.  (5 Marks: Format: 1 / Content: 2 / Expression: 2)\nSection C – 31 Marks \nLiterature Text Book and Supplementary Reading Text \nThis section will have variety of assessment items including Multiple Choice Questions, \nObjective Type Questions, Short Answer Type Questions and Long Answer Type \nQuestions \nto \nassess \ncomprehension, \ninterpretation, \nanalysis, \nevaluation \nand \nextrapolation beyond the text. \n10. One Poetry extract out of two, from the book Hornbill, to assess comprehension,\ninterpretation, analysis, inference and appreciation. \n(3x1=3 Marks) \n11. One Prose extract out of two, from the book Hornbill, to assess\ncomprehension, interpretation, analysis, evaluation and appreciation. (3x1=3 Marks)\n12. One prose extract out of two, from the book Snapshots, to assess comprehension,\ninterpretation, analysis, inference and appreciation. \n(4x1=4 Marks)\n13. Two Short answer type questions (one from Prose and one from Poetry, from the\nbook Hornbill), out of four, to be answered in 40-50 words. Questions should elicit\ninferential responses through critical  thinking. \n(3x2=6 Marks) \n14. One Short answer type question, from the book Snapshots, to be answered in 40- 50\nwords. Questions should elicit inferential responses through critical thinking. One out\nof two questions to be done.                                                                (3x1=3 Marks)\n15.\nOne Long answer type question, from Prose/Poetry of Hornbill, to be answered in\n120-150 words. Questions can be based on incident / theme / passage / extract /\nevent, as reference points to assess extrapolation beyond and across the text. The\nquestion will elicit analytical and evaluative response from the student. Any one out\nof two questions to be done. \n(1x6=6 Marks) \n16. One Long answer type question, based on the chapters from the book Snapshots,\nto be answered in 120-150 words, to assess global comprehension and\nextrapolation beyond the text. Questions to provide analytical and evaluative\nresponses, using incidents, events, themes, as reference points. Any one out of two\nquestions to be done. \n(1x6=6 Marks)\n\n\n--- Page 3 ---\nPrescribed Books \n1. Hornbill: English Reader published by National Council of Education Research\nand Training, New Delhi\n• The Portrait of a Lady (Prose)\n• A Photograph\n(Poem) \n• “We’re Not Afraid to Die… if We Can be Together\n• Discovering Tut: the Saga Continues\n• The Laburnum Top (Poem)\nThe Voice of the Rain (Poem)\n• Childhood (Poem)\n The Adventure\n• Silk Road (Prose)\n Father to Son\n2. Snapshots: Supplementary Reader published by National Council of Education\nResearch and Training, New Delhi\n• The Summer of the Beautiful White Horse (Prose)\n• The Address (Prose)\n• Mother’s Day (Play)\n• Birth ( Prose)\nThe Tale of Melon City\nINTERNAL ASSESSMENT \nAssessment of Listening Skills - 05 marks. \nAssessment of Speaking Skills – 05 Marks \nProject Work \n- 10 Marks \n\n\n--- Page 4 ---\nQuestion Paper Design  \nEnglish CORE XI (Code No. 301) \n2023-24 \nSection \nCompetencies \nTotal \nmarks \nReading Skills \nConceptual \nunderstanding, \ndecoding, \nAnalyzing, \ninferring, \ninterpreting, \nappreciating, \nliterary, \nconventions \nand \nvocabulary, \nsummarizing \nand \nusing \nappropriate format/s. \n26 \nGrammar and Creative \nWriting Skills \nConceptual Understanding, application of \nrules, Analysis, Reasoning, appropriacy of \nstyle and tone, using appropriate format and \nfluency, inference, analysis, evaluation and \ncreativity. \n23 \nLiterature Text Book \nand \nSupplementary \nReading Text \nRecalling, reasoning, appreciating literary \nconvention, inference, analysis, creativity \nwith fluency, Critical Thinking. \n31 \nTOTAL \n80 \nInternal Assessment \nAssessment of Listening and Speaking Skills \n\nListening\n\nSpeaking\n10 \n5+5 \n\nProject Work\n10 \nGRAND TOTAL \n100 \n\n\n--- Page 5 ---\nAnnexure I \nGuidelines for Internal Assessment \nClasses XI-XII \nALS must be seen as an integrated component of all four language skills rather than a compartment \nof two. Suggested activities, therefore, take into consideration an integration of the four language skills \nbut during assessment, emphasis will be given to speaking and listening, since reading and writing are \nalready being assessed in the written exam. \nClasses XI-XII \nTotal Marks: 20 \nAssessment of Listening and Speaking Skills: (5+5=10 Marks) \ni.\nActivities:\n●\nSubject teachers must refer to books prescribed in the syllabus.\n●\nIn addition to the above, teachers may plan their own activities and create their own\nmaterial for assessing the listening and speaking skills.\nii.\nParameters for Assessment: The listening and speaking skills are to be assessed on the\nfollowing parameters:\na.\nInteractive competence (Initiation & turn taking, relevance to the topic)\nb.\nFluency (cohesion, coherence and speed of delivery)\nc.\nPronunciation\nd.\nLanguage (grammar and vocabulary)\nA suggestive rubric is given below: \nInteraction \n1. \n2. \n3. \n4. \n        5. \n Contributions are mainly \nunrelated to those of\nother speakers\n Shows hardly any\ninitiative in the\ndevelopment of\nconversation\n Very limited interaction\nContributions are\noften unrelated\nto  those of the\nother speaker\nGenerally passive\nin the\ndevelopment of\nconversation\n\nDevelops\ninteraction\nadequately,\nmakes however\nminimal effort to\ninitiate\nconversation\n\nNeeds constant\nprompting to take \nturns\n\nInteraction is\nadequately\ninitiated\nand developed\n\nTakes turn but\nneeds some\nprompting\nInitiates &\nlogically\ndevelops     simple\nconversation on\nfamiliar topics\nTakes turns\nappropriately\nFluency & \nCoherence \n\nNoticeably/\nlong\npauses; \nrate \nof\nspeech is slow \n\nFrequent repetition\nand/or self- \ncorrection this is all\nright in informal\nconversation\n\nLinks only basic\nsentences;\nbreakdown of\ncoherence evident.\nUsually fluent;\nproduces simple\nspeech fluently,\nbut loses\ncoherence in\ncomplex\ncommunication\nOften hesitates\nand/or resorts to\nslow speech\n\nTopics partly\ndeveloped; not\nalways\nconcluded\nlogically\n Is willing to \nspeak at length, \nhowever \nrepetition is \nnoticeable \nHesitates and/or \nself corrects;\noccasionally\nloses coherence\nTopics\ndeveloped, but\nusually not\nlogically\nconcluded \n\nSpeaks without\nnoticeable\neffort, with a\nlittle repetition\n\nDemonstrates\nhesitation to\nfind words or\nuse correct\ngrammatical\nstructures\nand/or self- \ncorrection\n\nTopics not fully\ndeveloped to\nmerit.\n\nSpeaks fluently\nalmost with no\nrepetition &\nminimal\nhesitation\nDevelops topic\nfully &\ncoherently\n\n\n--- Page 6 ---\niii.\nSchedule:\nThe practice of listening and speaking skills should be done throughout the academic year.\nThe final assessment of the skills is to be done as per the convenience and schedule of the\nschool.\nProject Work + Viva: 10 Marks \nOut of ten marks, 5 marks will be allotted for the project report/script /essay etc. and 5 marks for the viva. \nI.\nSchedule:\n●\nSchools may refer to the suggestive timeline given in these guidelines for the planning,\npreparation and viva-voce of ALS based projects.\n●\nThe final assessment of the skills may be done on the basis of parameters suggested by the\nBoard. Language teachers, however, have the option to adopt/ modify these parameters\naccording to their school specific requirements.\nII.\nSuggestions for Project Work:\n\nThe Project can be inter-disciplinary in theme. The ideas/issues highlighted in the chapters/\npoems/ drama given the prescribed books can also be developed in the form of a project.\nStudents can also take up any relevant and age-appropriate theme.\nSuch topics may be taken up that provide students with opportunities for listening\nand speaking. Some suggestions are as follows:\na) Interview-Based research:\nExample: \n\nStudents can choose a topic on which to do their research/ interview, e.g. a student can choose\nthe topic : “ Evolving food tastes in my neighbourhood” or “Corona pandemic and the fallout on\nfamilies.” Read the available literature.\n\nThe student then conducts interviews with a few neighbours on the topic. For an interview, with\nthe help of the teacher, student will frame questions based on the preliminary\nresearch/background.\nPronunciation \n\nFrequent\ninaccurate\npronunciation\n\nCommunication is\nseverely affected\n\nFrequently\nunintelligible\narticulation\n\nFrequent\nphonological\nerrors\nMajor\ncommunication\nproblems\nLargely correct\npronunciation\n& clear\narticulation\nexcept\noccasional\nerrors\n\nMostly correct\npronunciation &\nclear articulation\n\nIs clearly\nunderstood most\nof the time; very\nfew phonological\nerrors\n\nPronounces\ncorrectly &\narticulates clearly\n\nIs always\ncomprehensible\n\nuses appropriate\nintonation\nVocabulary & \nGrammar \n\nDemonstrates\nalmost no\nflexibility, and\nmostly\nstruggles  for\nappropriate\nwords\n\nMany\nGrammatical\nerrors\nimpacting\ncommunication\nIs able to\ncommunicate\non some of the\ntopics, with\nlimited\nvocabulary.\nFrequent\nerrors, but self-\ncorrects\nIs able to\ncommunicate\non most of\nthe topics,\nwith limited\nvocabulary.\nA few\ngrammatical\nerrors\nIs able to\ncommunicate\non  most of the\ntopics  with\nappropriate\nvocabulary\nMinor errors\nthat do not\nhamper\ncommunication\nIs able to\ncommunicate on\nmost of the\ntopics  using a\nwide range of\nappropriate\nvocabulary,\nusing new words\nand expressions\nNo grammatical\nerrors\n\n\n--- Page 7 ---\n\nThe student will then write an essay/ write up / report etc. up to 1000 words on his/her research\nand submit it. He\n/ She will then take a viva on the research project. The project can be done in individually or in\npairs/ groups\nb)\nStudents listen to podcasts/ interviews/radio or TV documentary on a topic and prepare a report\ncountering or agreeing with the speakers. Write an 800 - 1000 words report and submit. Take a\nviva on the report.\nc)\nStudents create their own video/ Audio, after writing a script. Before they decide a format, the\nfollowing elements can be taken into consideration:\n●\nTheme/topic of the audio / video. Would the child like to pick a current issue or something artistic\nlike theatre?\n●\nWhat are the elements that need to be part of the script?\n●\nWill the video/audio have an interview with one or more guests?\n●\nWould they prefer to improvise while chatting with guests, or work from a script?\n●\nWhat would be the duration?\n●\nHow would they present the script/report to the teacher, e.g. Can it be in the form of a narrative?\nd) Students write, direct and present a theatrical production, /One act play\nThis will be a project which will be done as a team. It will involve planning, preparation and\npresentation. In short, various language skills will be utilised. There will be researching, discussion,\nwriting the script, auditioning and ultimately producing the play. The project will end with a\npresentation and subsequently a viva. Teachers will be able to assess the core language skills of\nthe students and help them grow as 21st century critical thinkers.\nIII. Instructions for the Teachers:-\n1.\nProperly orient students about the Project work, as per the present Guidelines.\n2.\nFacilitate the students in the selection of theme and topic.\n3.\nCreate a rubric for assessment and share with the students before they start so that they\nknow the parameters of assessment:\n\nTeachers need to familiarize themselves with the method of assessing students with\nthe rubric-- a table with different criteria and a grading scale.\n\nChoose the criteria on which you will grade students and list them along the left side of the\npage.\n\nCreate an even number of columns along the top of the page. These columns will\nrepresent potential skill levels of the students.\n\nAssessing students on four/five criteria is an easy way to begin. For each criterion,\ndefine the ability that a student would exhibit at each of the levels.\n\nThe more detailed you make your criteria, the easier it will be to evaluate each\nstudent and define the level at which the student is presenting.\n{Sample Rubric is attached at the end for reference} \nIV. Parameters for Overall Assessment:-\n1. Pronunciation:\n\nWhen evaluating the pronunciation of the students, teachers must listen for clearly articulated\nwords, pronunciation of unusual spellings and intonation.\n\nAssess the students for the pronunciation skills and determine at which level the student needs\nimprovement.\n\n\n--- Page 8 ---\n2. Vocabulary:\n\nAfter noting their pronunciation levels, evaluate the students on the use of extensive and\nappropriate vocabulary during the viva. Check if students are using vocabulary appropriate to\nthe context about which they are speaking.\n3.\nAccuracy:\n\nGrammar has always been an important component of language skills. As students speak/\nanswer the questions during the viva, listen to their grammatical structures. Are they\ncompetent enough to use multiple tenses? Is their word order correct in a given sentence? An\neffective speaker will automatically use the correct grammatical structures of his language.\n4. Communication:\n\nAssessing the communication skills of the students means looking at more than language.\nLook at how creatively students use the language to make their points understood. Students\nwith a low level of vocabulary and grammar may still have good communication skills if they are\nable to make the teacher understand their point of view.\n5. Interaction:\n\nDuring the viva teachers need to ask the students some questions. Questions need to be based\non the projects that have been suggested or chosen by the students.\n\nIt is imperative for a teacher to read the essays/project reports before they can be ready to ask\nquestions.\n\nTeachers need to observe how students answer the questions that are posed to them: Are they\nable to understand and answer questions independently or can they answer only when the\nquestions are translated into simpler words or repeated? Are they able to give appropriate\nresponses in a conversation?\n\nThese elements of interaction are necessary for clear and effective communication. A\nstudent with effective interaction skills will be able to answer questions with relative ease and\nfollow the flow of conversation.\n6. Fluency:\n\nFluency may be the easiest quality to judge in the students’ speech: How comfortable are they\nas they speak and express themselves? How easily do the words come out? Are there\ninappropriate pauses and gaps in the way a student speaks?\n\nFluency is a judgement of this communication and is an important criterion when evaluating\nspeaking skills. These criteria: pronunciation, vocabulary, accuracy, interaction and fluency are\nall the hallmarks of a student's overall speaking abilities.\n\nTeachers must also remember that some students may excel in one area and struggle in\nanother. Helping the students understand these issues will enable them to become effective\nspeakers in future. Let your students know that you will be assessing them in these various\nareas when you evaluate their progress and encourage them to work and improve in these\nareas.\n\nFinally, teachers must remember that a proper evaluation of the students will take into\nconsideration more than just one oral interview on the final ASL project. Teachers must\ntake note of a student’s progress throughout the academic year.\nV.\nProject-Portfolio/ Project Report\nThe Project-Portfolio/Project Report is a compilation of the work that the students produce during the \nprocess of working on their ALS Project. \nThe Project-Portfolio may include the following: \n●\nCover page, with title of project, school details/details of students.\n\n\n--- Page 9 ---\n●\nStatement of purpose/objectives/goals\n●\nCertificate of completion under the guidance of the teacher.\n●\nStudents Action Plan for the completion of assigned tasks.\n●\nMaterials such as scripts for the theatre/role play, questionnaires for interview, written\nassignments, essays, survey-reports and other material evidence of learning progress and\nacademic accomplishment.\n●\nThe 800-1000 words essay/Script/Report.\n●\nStudent/group reflections.\n●\nIf possible, Photographs that capture the positive learning experiences of the student(s).\n●\nList of resources/bibliography.\nThe following points must be kept for consideration while assessing the project portfolios: \n●\nQuality of content of the project\n●\nAccuracy of information\n●\nAdherence to the specified timeline\n●\nContent in respect of (spellings, grammar ,punctuation)\n●\nClarity of thoughts and ideas\n●\nCreativity\n●\nContributions by group members\n●\nKnowledge and experience gained\n\n\n--- Page 10 ---\nVI.\nSuggestive Timeline:\nThe FIVE Steps in Project Plan \nMonth \nObjectives \nPlanning and \nResearch for the \nProject Work \nPreferably\ntil\nl November-\nDecember\n●\nTeachers plan a day to orient students about the ALS projects,\ndetails are shared with all stakeholders.\n●\nStudents choose a project, select team members and develop\nproject- plan.\n●\nGroup meets (preferably online) and reports to the team leader\nabout the progress: shortfalls and successes are detailed.\n●\nTeam leader apprises teacher-mentor.\n●\nStudents working individually or in pairs also update the teachers.\n●\nA logical, deliverable and practical plan is drafted by the team/\npair/individual. Goals/objectives are clearly defined for all.\n●\nWork is delegated to team members by the team leader. Students\nwishing to work alone develop their own plan of Action.\n●\nDetailed project schedules are shared with the teacher.\nDecember- \nJanuary \n●\nSuggestions and improvements are shared by the teacher,\nwherever necessary.\n●\nGroup members coordinate and keep communication channels\nopen for interaction.\n●\nGaps ( if any) are filled with the right skill sets by the Team\nLeader/ individual student.\n●\nThe final draft of the project portfolio/ report is prepared and\nsubmitted for evaluation.\nJanuary-February \n●\nStudents are assessed on their group/pair/individual\npresentations on allotted days. Final Viva is conducted by the\nExternal/Internal examiner.\nFebruary-\nMarch or \nas per the \ntimelines given by \nthe Board \n●\nMarks are uploaded on the CBSE website.\nPROJECT-INITIATION \nPROJECT-PLANNING \nCLOSURE \nIMPLEMENTATION \nEXECUTION \n\n\n--- Page 11 ---\nSAMPLE RUBRIC FOR ALS Project Work \n(For Theatre/Role Play/Oral \npresentation/Interview/Podcast) \nCATEGORY \n1 \n2 \n3 \n4 \n5 \nTIME LIMIT \nPresentation \nis \nless than or more \nthan 5 minutes \nlong \nPresentation \nexceeded or less \nthan specified \ntime limit by 4 to \n5 minutes \nPresentation \nexceeded or \nless than \nspecified time \nlimit by 3 to 4 \nminutes \nPresentation \nexceeded or \nless than \nspecified  time \nlimit by 2 to 3 \nminutes \nStudent/ group \nadhered to the \ngiven time limit \nCONTENT/SCRIPT/ \nQUESTIONNAIRE \nScript \nis \nnot \nrelated to topic or \nissue \nWell written \nscript/ content \nshows little \nunderstanding of \nparts of topic \nWell written \nscript/ content \nshows good \nunderstanding \nof parts of topic \nWell written \nscript/ content \nshows a good \nunderstanding \nof subject topic \nWell written \nscript/ \n content \nshows \nfull \nunderstanding \nof subject topic \nCREATIVITY \nNo \nprops/costumes/ \nstage \npresentation \nlack- lustre \nSome work \ndone, average \nstage \nset- \nup and \ncostumes \nWell organized \npresentation, \ncould have \nimproved \nLogical use of \nprops \n, \nreasonable work \ndone, creative \nSuitable props \n/ honest effort \nseen/ \nconsiderable \nwork done/ \nCreative and \nrelevant \ncostumes \nPREPAREDNESS \nStudent \n/group \nseems \nto \nbe \nunprepared \nSome \npreparedness \nvisible, but \nRehearsal is \nlacking \nSomewhat \nprepared, \nrehearsal is \nlacking \nGood \npreparedness  , \nbut  need better \nrehearsal \nComplete \npreparedness/ \nrehearsed \npresentation \nCLARITY OF \nSPEECH \nLack of clarity in \npresentation \nmany words \nmispronounced \nSpeaks \nclearly, \nsome words are \nmispronounced \nSpeaks clearly \n90% of the \ntime/ a few \nmispronounced \nwords \nSpeaks clearly \nand distinctly \n95%  of \ntime/ \nfew \nmispronounced \nwords \nSpeaks clearly \ndistinctly 95% of \ntime/ fluency in \npronunciation \nUSE OF PROPS \n( Theatre/Role Play)\nOnly 1/no \nrelevant props \nused \n1 to 2 relevant \nprops used \n2 to 3 relevant \nprops used \n3 to 4 relevant \nprops used \n4 to 5 relevant \nprops used \nEXPRESSION/ \nBODY \nLANGUAGE \nVery little use of \nfacial \nexpressions/ \nbody  language, \ndoes not \ngenerate much \ninterest \nLittle \nUse \nof \nfacial \nexpressions and \nbody language \nFacial \nexpressions \nand  body \nlanguage are \nused to try to \ngenerate some \nenthusiasm \nFacial \nexpression  and \nbody \nlanguage \nsometimes \ngenerate strong \nenthusiasm with \nthe topic \nFacial \nexpression and \nbody \nlanguage \ngenerate strong \nenthusiasm with \nthe topic \nPORTFOLIO- \nPRESENTATION \nInadequate & \nunimpressive \nSomewhat \nsuitable & \nconvincing \nAdequate & \nrelevant \nInteresting, \nenjoyable   & \nrelevant \nBrilliant, \ncreative & \nexceptional \n\n\n=== PDF: class_11_english_2.pdf ===\n--- Page 1 ---\nENGLISH ELECTIVE \n(Code No. 001) \nCLASS – XI  2023-24 \nSection A \nReading Comprehension     \n 25 Marks \nTwo unseen passages and a poem \n1. 12 out of 15 Multiple Choice / Objective Type Questions, from a literary or discursive\npassage of about 950-1000 words to assess comprehension, interpretation, inference,\nanalysis, appreciation and vocabulary.                                                  (1x12=12 marks)\n2. 8 out of 9 Multiple Choice Questions / Objective Type Questions to test interpretation,\ninference and appreciation of a poem of about 10-12 lines.  \n  (1x8=8 marks) \n3. 5 out of 7 Multiple Choice Questions / Objective Type Questions from a case-based\npassage (with visual input- statistical data, chart etc.) of 100-120 words to test\ninterpretation, analysis and evaluation.                                                (1x5=5 marks)\n Section B \nCreative Writing Skills \n15 Marks \n4. An Essay on an argumentative/discursive/reflective/descriptive topic, leading to creative\nrendering, forming and defending of opinions, to be answered in 120-150 words.\n(5 marks) \n5. Article on one out of two topics to be answered in 120-150 words pertaining to\ncontemporary topical  issues. \n (5 marks) \n6. Speech on one out of two topics to be answered in 120-150 words pertaining to\ncontemporary topical  issues.  \n (5 marks) \nSection C \nThis section will have variety of assessment items including Multiple Choice Questions, \nObjective Type Questions, Short Answer Type Questions and Long Answer Type \nQuestions to assess comprehension, interpretation, analysis and extrapolation beyond \nthe text. \nTextbook                                                                                                                20 Marks \n7.\nReference to the Context\ni. One Prose extract, out of two, to assess comprehension, literary appreciation and\ninference.\nii. One Poetry extract, out of two, to assess comprehension, literary appreciation and\ninference.                                                                                                 (5+5=10 Marks)\n8. Two Short Answer Questions out of three, to be answered in 30-40 words to assess\nunderstanding, analysis and critical appreciation. Questions should elicit inferential\nresponses through critical thinking.                                                               (2x2=4 marks)\n9. Two Short Answer Questions, out of three, to be answered in 50-60 words to assess\nunderstanding, analysis and critical appreciation. Questions should elicit inferential\nresponses through critical thinking.                                                              (3x2=6 marks)\nCBSE Class 11 English Elective Syllabus 2023-24\n\n\n--- Page 2 ---\nArms and the Man - [Drama]   \n  10 Marks \n10. Two Long Answer Questions, out of three, to be answered in 80-100 words to appreciate\ncharacters, events and episodes. Questions to provide analytical responses using\nincidents, events, themes, as reference points. \n  (5x2=10 marks) \nFiction  \n  10 Marks \n11. One Short Answer Question, out of two, to be answered in 30-40 words to critically\nappreciate characters, events, episodes, interpersonal relationships and formation of\npersonal points of view, with reference to content, events and episodes.\n(2 marks) \n12. One Short Answer Question, out of two, to be answered in 50-60 words to assess\nunderstanding, analysis and critical appreciation. Questions should elicit inferential\nresponses through critical thinking. \n(3 marks)\n13. One Long Answer Question, out of two, to be answered in 120-150 words to test literary\nappreciation and to draw inferences. Questions should elicit creative responses and\ndevelop ability to form personal points of view. \n(5 marks)\nSeminar (20 marks) \n\nPresentation - book review /a play /a short story/a novel/novella (tale, fable, and\nparable) to be followed by a question-answer session.\n\nPoetry reading to be followed by interpretative tasks based on close reading and\nliterary analysis of the text.\n\nCritical review of a film/ documentary or a play.\n\nConducting a theatre workshop to be followed by a discussion\nNote: Teachers may develop their own rubrics to assess the performance of students \nobjectively \nThe parameters for assessing Speaking skills, as given in the curriculum for English Core, \nmay be referred to. \nPrescribed Books: \n1. Text book: Woven Words published by NCERT\n2. Fiction: The Old Man and the Sea (Novel unabridged) by Ernest Hemingway\n3. Drama: Arms and the Man by George Bernard Shaw\n\n\n--- Page 3 ---\nBook-Woven Words- Short Stories \n\nThe Lament\n\nA Pair of Mustachios\n\nThe Rocking-horse Winner\n\nThe Adventure of the Three Garridebs\n\nPappachi’s Moth\n\nThe Third and Final Continent\nBook-Woven Words-Poetry \n\nThe Peacock\n\nLet me Not to the Marriage of True Minds\n\nComing\n\nTelephone Conversation\n\nThe World is too Much With Us\n\nMother Tongue\n\nHawk Roosting\n\nOde to a Nightingale\nBook-Woven Words-Essays \n\nMy Watch\n\nMy Three Passions\n\nPatterns of Creativity\n\nTribal Verse\n\nWhat is a Good Book?\n\nThe Story\n\nBridges\n\n\n--- Page 4 ---\nQuestion Paper Design \nEnglish Elective Class XI \n2023-24 \nMARKS 80+20=100 \nSection \nCompetencies \nTotal marks \n% \nWeightage & \nSuggestive no. of \nPeriods \nReading \nComprehension \nConceptual \nunderstanding, \ndecoding, \nanalyzing, \ninferring,\ninterpreting, appreciating, literary,\nconventions and vocabulary \n25 \n31.25% \n35  Periods \nCreative Writing \nReasoning, appropriacy of style \nand tone, use of appropriate format \nand  fluency \n15 \n18.75% \n15 Periods \nTextbook \nRecalling, reasoning, appreciating \nliterary conventions illustrating with \nrelevant quotations from the texts, \ngiving opinions and justifying with \nfluency \n20 \n25% \n25 Periods \nDrama \nRecalling, reasoning, appreciating \nliterary conventions, illustrating with \nrelevant quotations from the texts, \ngiving opinions and justifying with \nfluency \n10 \n12.50% \n40 Periods \nFiction \nRecalling, reasoning, appreciating \nliterary conventions, illustrating with \nrelevant quotations from the texts, \ngiving opinions and justifying with \nfluency \n10 \n12.50% \n30 Periods \nTOTAL \n80 \n100% \nSeminar \nSeeking information and clarifying, \nillustrating with relevant quotations \nfrom the texts, reasoning, diction, \narticulation clarity of pronunciation, \nusing \nappropriate \nlanguage \nconventions \nAddressing \nparticipants \nusing \nappropriate titles or nomenclatures \nandoverall fluency \n20 \n- \nGrand Total \n100 \n",
  "pdf_urls": [
    "https://cdn1.byjus.com/wp-content/uploads/2023/04/CBSE-Class-11-English-Core-Syllabus-2023-24.pdf",
    "https://cdn1.byjus.com/wp-content/uploads/2023/04/CBSE-Class-11-English-Elective-Syllabus-2023-24.pdf"
  ],
  "extracted_at": "2026-01-29T11:04:53.756636",
  "pdf_local_files": [
    "syllabus/pdfs/class_11_english_1.pdf",
    "syllabus/pdfs/class_11_english_2.pdf"
  ],
  "pdf_parsed_at": "2026-01-30T13:29:27.698015"
}