{
  "url": "https://byjus.com/cbse/class-11-economics-syllabus/",
  "title": "",
  "description": "",
  "units": [],
  "chapters": [],
  "topics": [
    "CBSE Class 11 Economics Syllabus PDF 2023-24"
  ],
  "marking_scheme": [
    {
      "headers": [
        "Units",
        "",
        "Marks"
      ],
      "rows": [
        [
          "Part A",
          "Statistics for Economics",
          ""
        ],
        [
          "",
          "Introduction",
          "15"
        ],
        [
          "",
          "Collection, Organisation and Presentation of Data"
        ],
        [
          "",
          "Statistical Tools and Interpretation",
          "25"
        ],
        [
          "",
          "Sub Total",
          "40"
        ],
        [
          "Part B",
          "Introductory Microeconomics",
          ""
        ],
        [
          "",
          "Introduction",
          "4"
        ],
        [
          "",
          "Consumer’s Equilibrium and Demand",
          "14"
        ],
        [
          "",
          "Producer Behaviour and Supply",
          "14"
        ],
        [
          "",
          "Forms of Market and Price Determination under perfect competition with simple applications",
          "08"
        ],
        [
          "",
          "Sub Total",
          "40"
        ],
        [
          "Part C",
          "Project Work",
          "20"
        ]
      ]
    }
  ],
  "raw_content": "CBSE Class 11 Economics Syllabusprovides an extensive range of concepts and introduction to the subject. Here, we have provided the detailed CBSE Class 11 Economics Syllabus for the academic year 2023-24. Students must go through it before planning their studies. Students can directly download theCBSE Syllabus for Class 11for the year 2023- 24 Economics in this page.\nCBSE Class 11 Economics Syllabus 2023-24\nThe CBSE Syllabus for Class 11 Economics 2023-24 is released by the board. Students can download the syllabus PDF and go through it to plan their studies.\nCBSE Class 11 Economics Syllabus PDF 2023-24\nMarks Distribution of the CBSE Class 11 Economics Syllabus 2023-24\nBefore going in depth into the CBSE Economics Syllabus of Class 11, students must have a look at the marks distribution.\nTheory: 80 MarksTime:3 Hours\nUnitsMarksPart AStatistics for EconomicsIntroduction15Collection, Organisation and Presentation of DataStatistical Tools and Interpretation25Sub Total40Part BIntroductory MicroeconomicsIntroduction4Consumer’s Equilibrium and Demand14Producer Behaviour and Supply14Forms of Market and Price Determination under perfect competition with simple applications08Sub Total40Part CProject Work20\nUnitsMarks\nUnits\nMarks\nPart AStatistics for Economics\nPart A\nStatistics for Economics\nIntroduction15\nIntroduction\nCollection, Organisation and Presentation of Data\nCollection, Organisation and Presentation of Data\nStatistical Tools and Interpretation25\nStatistical Tools and Interpretation\nSub Total40\nSub Total\nPart BIntroductory Microeconomics\nPart B\nIntroductory Microeconomics\nIntroduction4\nIntroduction\nConsumer’s Equilibrium and Demand14\nConsumer’s Equilibrium and Demand\nProducer Behaviour and Supply14\nProducer Behaviour and Supply\nForms of Market and Price Determination under perfect competition with simple applications08\nForms of Market and Price Determination under perfect competition with simple applications\nSub Total40\nSub Total\nPart CProject Work20\nPart C\nProject Work\n2023-23 CBSE Syllabus for Class 11 Economics\nBelow you will find unit-wise syllabus of Economics for Class 11 students.\nPart A: Statistics for Economics\nIn this course, learners are expected to acquire skills in collection, organisation and presentation of quantitative and qualitative information pertaining to various simple economic aspects systematically. It also intends to provide some basic statistical tools to analyse and interpret any economic information and draw appropriate inferences. In this process, the learners are also expected to understand the behaviour of various economic data.\nUnit 1: Introduction\nWhat is Economics?\nMeaning, scope, functions and importance of statistics in Economics\nUnit 2: Collection, Organisation and Presentation of data\nCollection of data– sources of data – primary and secondary; how basic data is collected with concepts of Sampling; methods of collecting data; some important sources of secondary data: Census of India and National Sample Survey Organisation.\nOrganisation of Data:Meaning and types of variables; Frequency Distribution.\nPresentation of Data:Tabular Presentation and Diagrammatic Presentation of Data: (i) Geometric forms (bar diagrams and pie diagrams), (ii) Frequency diagrams (histogram, polygon and Ogive) and (iii) Arithmetic line graphs (time series graph).\nUnit 3: Statistical Tools and Interpretation\nFor all the numerical problems and solutions, the appropriate economic interpretation may be attempted. This means, the students need to solve the problems and provide interpretation for the results derived.\nMeasures of Central Tendency –Arithmetic mean, median and mode.\nCorrelation– meaning and properties, scatter diagram; Measures of correlation – Karl Pearson’s method (two variables ungrouped data) Spearman’s rank correlation.\nIntroduction to Index Numbers– meaning, types – wholesale price index, consumer price index and index of industrial production, uses of index numbers; Inflation and index numbers.\nPart B: Introductory Microeconomics\nUnit 4: Introduction\nMeaning of microeconomics and macroeconomics; positive and normative economics\nWhat is an economy? Central problems of an economy: what, how and for whom to produce; concepts of production possibility frontier and opportunity cost.\nUnit 5: Consumer’s Equilibrium and Demand\nConsumer’s equilibrium – meaning of utility, marginal utility, law of diminishing marginal utility, conditions of consumer’s equilibrium using marginal utility analysis.\nIndifference curve analysis of consumer’s equilibrium-the consumer’s budget (budget set and budget line), preferences of the consumer (indifference curve, indifference map) and conditions of consumer’s equilibrium.\nDemand, market demand, determinants of demand, demand schedule, demand curve and its slope, movement along and shifts in the demand curve; price elasticity of demand – factors affecting price elasticity of demand; measurement of price elasticity of demand – percentage-change method and total expenditure method.\nUnit 6: Producer Behaviour and Supply\nMeaning of Production Function – Short-Run and Long-RunTotal Product, Average Product and Marginal Product.Returns to a FactorCost: Short run costs – total cost, total fixed cost, total variable cost; Average cost; Average fixed cost, average variable cost and marginal cost-meaning and their relationships.Revenue – total, average and marginal revenue – meaning and their relationship.Producer’s equilibrium-meaning and its conditions in terms of marginal revenue marginal cost. Supply, market supply, determinants of supply, supply schedule, supply curve and its slope, movements along and shifts in supply curve, price elasticity of supply; measurement of price elasticity of supply – percentage-change method.\nUnit 7: Forms of Market and Price Determination under Perfect Competition with simple applications.\nPerfect competition – Features; Determination of market equilibrium and effects of shifts in demand and supply.\nSimple Applications of Demand and Supply: Price ceiling, price floor.\nPart C: Project in Economics\nGuidelines as given in class XI curriculum\nWe hope this information on Class 11 EconomicsCBSE Syllabuswill help students in their exam preparation. Download the BYJU’S App to get interactive study videos and stay tuned for the latest update on CBSE/ICSE/State Board/Competitive exams.Frequently Asked Questions on CBSE Class 11 Syllabus for Economics 2023-24Q1How many chapters are there in part A and B of CBSE Economics Syllabus for Class 11 2023-24?About 3 chapters are there in part A and 4 chapters are there in part B of CBSE Class 11 Economics syllabus 2023-24.Q2In CBSE Class 11 Economics Syllabus, what is part A and B?In CBSE Class 11 Economics Syllabus, part A is statistics for economics and part B is introductory microeconomics.Q3What type of questions can be expected in the CBSE Class 11 Economics exam as per the syllabus?The type of questions in the CBSE Class 11 Economics exam will be based on remembering and understanding, applying, analysing, evaluating and creating.\nFrequently Asked Questions on CBSE Class 11 Syllabus for Economics 2023-24\nHow many chapters are there in part A and B of CBSE Economics Syllabus for Class 11 2023-24?\nIn CBSE Class 11 Economics Syllabus, what is part A and B?\nWhat type of questions can be expected in the CBSE Class 11 Economics exam as per the syllabus?",
  "pdf_content": "=== PDF: class_11_economics_1.pdf ===\n--- Page 1 ---\n2\nECONOMICS (030) \nCLASS – XI (2023-24) \nTheory: 80 Marks \n3 Hours \nProject: 20 Marks \nUnits\nMarks\nPeriods\nPart A\nStatistics for Economics\nIntroduction \n15 \n10 \nCollection, Organisation and Presentation of Data \n30 \nStatistical Tools and Interpretation \n25 \n50 \n40\nPart B \nIntroductory Microeconomics\nIntroduction\n04 \n10 \nConsumer's Equilibrium and Demand\n14 \n40 \nProducer Behaviour and Supply\n14 \n35 \nForms of Market and Price Determination under \nperfect competition with simple applications \n08 \n25 \n40\n200\nPart C\nProject Work\n20\n20\nPart A: Statistics for Economics \nIn this course, the learners are expected to acquire skills in collection, organisation and \npresentation of quantitative and qualitative information pertaining to various simple \neconomic aspects systematically. It also intends to provide some basic statistical tools \nto analyse, and interpret any economic information and draw appropriate inferences. In \nthis process, the learners are also expected to understand the behaviour of various \neconomic data. \nUnit 1: Introduction \n10 Periods \nWhat is Economics? \nMeaning, scope, functions and importance of statistics in Economics \nUnit 2: Collection, Organisation and Presentation of data  \n \n \n30 Periods \nCollection of data - sources of data - primary and secondary; how basic data is \ncollected with concepts of Sampling; methods of collecting data; some important \nsources of secondary data: Census of India and National Sample Survey Organisation. \nOrganisation of Data: Meaning and types of variables; Frequency Distribution. \nCBSE Class 11 Economics Syllabus 2023-24\n\n\n--- Page 2 ---\n3\nPresentation of Data: Tabular Presentation and Diagrammatic Presentation of Data: \n(i) Geometric forms (bar diagrams and pie diagrams), (ii) Frequency diagrams\n(histogram, polygon and Ogive) and (iii) Arithmetic line graphs (time series graph). \nUnit 3: Statistical Tools and Interpretation  \n \n \n \n \n50 Periods \nFor all the numerical problems and solutions, the appropriate economic interpretation may be \nattempted. This means, the students need to solve the problems and provide interpretation for \nthe results derived. \nMeasures of Central Tendency- Arithmetic mean, Median and Mode \nCorrelation – meaning and properties, scatter diagram; measures of correlation - Karl \nPearson's \nmethod \n(two \nvariables \nungrouped \ndata) \nSpearman's \nrank \ncorrelation \n(Non-Repeated Ranks and Repeated Ranks). \nIntroduction to Index Numbers - meaning, types - Wholesale Price Index, Consumer Price \nIndex and index of industrial production, uses of index numbers; Inflation and Index Numbers, \nSimple Aggregative Method. \nPart B: Introductory Microeconomics \nUnit 4: Introduction   \n \n \n \n \n \n \n \n10 Periods \nMeaning of microeconomics and macroeconomics; positive and normative economics \nWhat is an economy? Central problems of an economy: what, how and for whom to \nproduce; concepts of Production Possibility Frontier and Opportunity Cost. \nUnit 5: Consumer's Equilibrium and Demand  \n \n \n \n \n40 Periods \nConsumer's equilibrium - meaning of Utility, Marginal Utility, Law of Diminishing \nMarginal Utility, conditions of consumer's equilibrium using marginal utility analysis. \nIndifference curve analysis of consumer's equilibrium-the consumer's budget (budget \nset and budget line), preferences of the consumer (indifference curve, indifference \nmap) and conditions of consumer's equilibrium. \nDemand, market demand, determinants of demand, demand schedule, demand curve \nand its slope, movement along and shifts in the demand curve; price elasticity of \ndemand - factors affecting price elasticity of demand; measurement of price elasticity of \ndemand – percentage-change method and total expenditure method.  \n\n\n--- Page 3 ---\n \n4\n \nUnit 6: Producer Behaviour and Supply   \n \n \n \n \n35 Periods \nMeaning of Production Function – Short-Run and Long-Run \nTotal Product, Average Product and Marginal Product. \nReturns to a Factor  \nCost – Short run costs - Total Cost, Total Fixed Cost, Total Variable Cost; Average \nCost; Average Fixed Cost, Average Variable Cost and Marginal Cost - meaning and \ntheir relationships. \nRevenue – Total Revenue, Average Revenue and Marginal Revenue - meaning and \ntheir relationship. \nProducer's Equilibrium - meaning and its conditions in terms of Marginal Revenue-\nMarginal Cost.  \nSupply, market supply, determinants of supply, supply schedule, supply curve and its \nslope, movements along and shifts in supply curve, price elasticity of supply; \nmeasurement of price elasticity of supply - percentage-change method. \n \nUnit 7: Perfect Competition - Price Determination and simple applications.  \n \n \n \n \n \n \n \n \n \n \n \n25 Periods \nPerfect competition - Features; Determination of market equilibrium and effects of \nshifts in demand and supply. (Short Run Only)  \n \nSimple Applications of Demand and Supply: Price ceiling, Price floor. \n \n \n \n \n \n \n \n \n \nPart C: Project in Economics  \n \n \n \n \n        20 Periods \nGuidelines as given in Class XII curriculum  \n \n\n\n--- Page 4 ---\n \n5\nSuggested Question Paper Design \nEconomics (Code No. 030) \nClass XI (2023-24) \nMarch 2024 Examination \n \nMarks: 80  \n \n \n \n \n \n \n \n \nDuration: 3 hrs. \n \nSN\nTypology of Questions\nMarks\nPercentage\n1 \nRemembering and Understanding:  \nExhibit memory of previously learned material by recalling \nfacts, terms, basic concepts, and answers. \nDemonstrate understanding of facts and ideas by \norganizing, comparing, translating, interpreting, giving \ndescriptions, and stating main ideas \n44 \n55% \n2 \nApplying: Solve problems to new situations by applying \nacquired knowledge, facts, techniques and rules in a \ndifferent way. \n18 \n22.5% \n3 \nAnalysing, Evaluating and Creating: \nExamine and break information into parts by identifying \nmotives or causes. Make inferences and find evidence to \nsupport generalizations.  \nPresent and defend opinions by making judgments about \ninformation, validity of ideas, or quality of work based on a \nset of criteria. \nCompile information together in a different way by \ncombining elements in a new pattern or proposing \nalternative solutions. \n \n18 \n22.5% \nTotal\n80\n100%\n \n\n\n--- Page 5 ---\n10\nGuidelines for Project Work in Economics (Class XI and XII) \nThe objectives of the project work are to enable learners to: \n\nprobe deeper into theoretical concepts learnt in classes XI and XII\n\nanalyse and evaluate real world economic scenarios using theoretical constructs and\narguments\n\ndemonstrate the learning of economic theory\n\nfollow up aspects of economics in which learners have interest\n\ndevelop the communication skills to argue logically\nThe expectations of the project work are that: \nlearners will complete only ONE project in each academic session\nproject should be of 3,500-4,000 words (excluding diagrams & graphs), preferably\nhand-written\nit will be an independent, self-directed piece of study\nRole of the teacher: \nThe teacher plays a critical role in developing thinking skills of the learners. A teacher should: \n\nhelp each learner select the topic based on recently published extracts from the news\nmedia, government policies, RBI bulletin, NITI Aayog reports, IMF/World Bank reports etc.,\nafter detailed discussions and deliberations of the topic\n\nplay the role of a facilitator and supervisor to monitor the project work of the learner\nthrough periodic discussions\n\nguide the research work in terms of sources for the relevant data\n\neducate learner about plagiarism and the importance of quoting the source of the\ninformation to ensure authenticity of research work\n\nprepare the learner for the presentation of the project work\n\narrange a presentation of the project file\nScope of the project: \n Learners may work upon the following lines as a suggested flow chart: \nChoose a title/topic \nCollection of the research material/data \n Organization of material/data \nPresent material/data \nAnalysing the material/data for conclusion \nDraw the relevant conclusion \nPresentation of the Project Work \n\n\n--- Page 6 ---\n11\nExpected Checklist: \n\nIntroduction of topic/title\n\nIdentifying the causes, consequences and/or remedies\n\nVarious stakeholders and effect on each of them\n\nAdvantages and disadvantages of situations or issues identified\n\nShort-term and long-term implications of economic strategies suggested in the course of\nresearch\n\nValidity, reliability, appropriateness and relevance of data used for research work and\nfor presentation in the project file\n\nPresentation and writing that is succinct and coherent in project file\n\nCitation of the materials referred to, in the file in footnotes, resources section,\nbibliography etc.\nMode of presentation/submission of the Project: \nAt the end of the stipulated term, each learner will present the research work in the Project File \nto the External and Internal examiner. The questions should be asked from the Research \nWork/ Project File of the learner. The Internal Examiner should ensure that the study \nsubmitted by the learner is his/her own original work. In case of any doubt, authenticity \nshould be checked and verified.  \nMarking Scheme: \nMarks are suggested to be given as – \nS. No.\nHeading\nMarks Allotted\n1.\nRelevance of the topic\n3 \n2.\nKnowledge Content/Research Work\n6 \n3.\nPresentation Technique\n3 \n4.\nViva-voce\n8 \nTotal \n20 Marks \nSuggestive List of Projects: \nClass XI \n\nEffect on PPC due to various government\npolicies\n\nInvisible Hand (Adam Smith)\n\nOpportunity Cost as an Economic Tool\n(taking real life situations)\n\nEffect of Price Change on a Substitute Good\n(taking prices from real life visiting local\nmarket)\n\nEffect on Equilibrium Prices in Local Market\n(taking real life situation or recent news)\n\nEffect of Price Change on a Complementary\nGood (taking prices from real life visiting\nlocal market)\n\nSolar Energy, a Cost-Effective Comparison\nwith Conventional Energy Sources\n\nBumper Production- Boon or Bane for the\nFarmer\n\nAny other newspaper article and its\nevaluation on basis of economic principles\n\nAny other topic\n",
  "pdf_urls": [
    "https://cdn1.byjus.com/wp-content/uploads/2023/04/CBSE-Class-11-Economics-Syllabus-2023-24.pdf"
  ],
  "extracted_at": "2026-01-29T11:05:49.315103",
  "pdf_local_files": [
    "syllabus/pdfs/class_11_economics_1.pdf"
  ],
  "pdf_parsed_at": "2026-01-30T13:29:26.547428"
}