{
  "url": "https://byjus.com/cbse/class-9-maths-syllabus/",
  "title": "",
  "description": "",
  "units": [
    {
      "headers": [
        "Unit",
        "Unit Name",
        "Section"
      ],
      "rows": [
        [
          "I",
          "Number System",
          "Real Numbers"
        ],
        [
          "II",
          "Algebra",
          "PolynomialsLinear Equations in Two Variables"
        ],
        [
          "III",
          "Coordinate Geometry",
          "Coordinate Geometry"
        ],
        [
          "IV",
          "Geometry",
          "Introduction to Elucid’s GeometryLines and AnglesTrianglesQuadrilateralsCircles"
        ],
        [
          "V",
          "Mensuration",
          "AreasSurface areas and volumes"
        ],
        [
          "VI",
          "Statistics",
          "Statistics"
        ]
      ]
    }
  ],
  "chapters": [],
  "topics": [
    "Pen Paper Test and Multiple Assessment (5+5 Marks) : 10 Marks",
    "Portfolio: 5 Marks",
    "Lab Practical (Lab activities to be done from the prescribed books): 5 Marks",
    "Total Marks: 20 Marks"
  ],
  "marking_scheme": [
    {
      "headers": [
        "Units",
        "Unit Name",
        "Marks"
      ],
      "rows": [
        [
          "I",
          "Number System",
          "10"
        ],
        [
          "II",
          "Algebra",
          "20"
        ],
        [
          "III",
          "Coordinate Geometry",
          "04"
        ],
        [
          "IV",
          "Geometry",
          "27"
        ],
        [
          "V",
          "Mensuration",
          "13"
        ],
        [
          "VI",
          "Statistics",
          "06"
        ],
        [
          "",
          "Total",
          "80"
        ],
        [
          "",
          "Internal Assessment",
          "20"
        ],
        [
          "",
          "Grand Total",
          "100"
        ]
      ]
    }
  ],
  "raw_content": "CBSE Syllabus for Class 9 Mathshas been released by the CBSE board on their official website. The CBSE Class 9 Maths Syllabus for the 2023-24 academic year is provided here for students. Here, students can download the CBSE Class 9 Maths Syllabus in PDF format for free. Maths Syllabus forCBSE Class 9will help students to prepare their study plan in an effective way. The CBSE syllabus for the year 2023-24 will not have major changes when compared to the 2022-23 syllabus. Therefore, students can go through and plan their studies accordingly.\nMaths is a scoring subject for CBSE Class 9 students. They can score good grades in Maths if they know the concepts well. For this, they have to cover the entire CBSE Class 9 Maths syllabus and solve all the questions that are provided in the Maths textbook. Also, students must know the CBSE Syllabus for Class 9 Maths right from the beginning of the academic year of 2023-24 so that they can learn all chapters and prepare for the exam in advance.\nTo download the CBSE Class 9 Maths Syllabus, click on the PDF link given below. This is the officialCBSE syllabusthat is prescribed by the CBSE Board. The final question paper for the academic exam will be prepared based on the CBSE Syllabus of Class 9 Maths.\nCBSE Class 9 Maths Syllabus for 2023-24 Academic Year\nStudents can download the latest released CBSE Class 9 Syllabus for the academic year 2023-24 from the link below. The syllabus topic will help them understand what they are going to learn in the academic year.\nCBSE Syllabus for Class 9 Maths 2023-24 PDF\nDownload PDF\n2023-24 CBSE Class 9 Maths Syllabus\nUnitUnit NameSectionINumber SystemReal NumbersIIAlgebraPolynomialsLinear Equations in Two VariablesIIICoordinate GeometryCoordinate GeometryIVGeometryIntroduction to Elucid’s GeometryLines and AnglesTrianglesQuadrilateralsCirclesVMensurationAreasSurface areas and volumesVIStatisticsStatistics\nUnitUnit NameSection\nUnit\nUnit Name\nSection\nINumber SystemReal Numbers\nNumber System\nReal Numbers\nIIAlgebraPolynomialsLinear Equations in Two Variables\nAlgebra\nPolynomialsLinear Equations in Two Variables\nLinear Equations in Two Variables\nIIICoordinate GeometryCoordinate Geometry\nIII\nCoordinate Geometry\nCoordinate Geometry\nIVGeometryIntroduction to Elucid’s GeometryLines and AnglesTrianglesQuadrilateralsCircles\nGeometry\nIntroduction to Elucid’s GeometryLines and AnglesTrianglesQuadrilateralsCircles\nLines and Angles\nTriangles\nQuadrilaterals\nCircles\nVMensurationAreasSurface areas and volumes\nMensuration\nAreasSurface areas and volumes\nSurface areas and volumes\nVIStatisticsStatistics\nStatistics\nStatistics\nCBSE Syllabus for Class 9 Maths 2023-24 Course Structure\nUnitsUnit NameMarksINumber System10IIAlgebra20IIICoordinate Geometry04IVGeometry27VMensuration13VIStatistics06Total80Internal Assessment20Grand Total100\nUnitsUnit NameMarks\nUnits\nUnit Name\nMarks\nINumber System10\nNumber System\nIIAlgebra20\nAlgebra\nIIICoordinate Geometry04\nIII\nCoordinate Geometry\nIVGeometry27\nGeometry\nVMensuration13\nMensuration\nVIStatistics06\nStatistics\nTotal80\nTotal\nInternal Assessment20\nInternal Assessment\nGrand Total100\nGrand Total\n100\nCBSE Class 9 Maths Internal Assessment\nPen Paper Test and Multiple Assessment (5+5 Marks) : 10 Marks\nPortfolio: 5 Marks\nLab Practical (Lab activities to be done from the prescribed books): 5 Marks\nTotal Marks: 20 Marks\nTo get the syllabus for other subjects of Class 9, go through theCBSE Syllabus for Class 9page. Learn Maths & Science in an interactive & fun-loving way with BYJU’S App/Tablet.Frequently asked questions on CBSE Syllabus for Class 9 MathsQ1How many units are there in CBSE Class 9 Mathematics Syllabus 2023-24?The CBSE Class 9 Mathematics Syllabus 2023-24 consists of 6 units, such as Coordinate geometry, number systems, algebra, statistics, geometry and mensuration are all covered in the CBSE Class 9 Mathematics Syllabus 2023-24.Q2Are NCERT books for Class 9 relevant to the CBSE Syllabus for Class 9 Maths curriculum?Yes, the NCERT books are indeed related to the CBSE Syllabus for the Class 9 Maths course curriculum.Q3How many chapters of Mathematics are there in CBSE Class 9?Maths for Class 9 in the CBSE has 15 chapters.\nFrequently asked questions on CBSE Syllabus for Class 9 Maths\nHow many units are there in CBSE Class 9 Mathematics Syllabus 2023-24?\nAre NCERT books for Class 9 relevant to the CBSE Syllabus for Class 9 Maths curriculum?\nHow many chapters of Mathematics are there in CBSE Class 9?",
  "pdf_content": "=== PDF: class_9_maths_1.pdf ===\n--- Page 1 ---\n2 \nCBSE Class 9 Syllabus for Maths 2023-24\nUnits \nUnit Name \nMarks \nI \nNUMBER SYSTEMS \n10 \nII \nALGEBRA \n20 \nIII \nCOORDINATE GEOMETRY \n04 \nIV \nGEOMETRY \n27 \nV \nMENSURATION \n13 \nVI \nSTATISTICS \n06 \nTotal \n80 \nUNIT I: NUMBER SYSTEMS \n1.\nREAL NUMBERS\n(18) Periods\n1. Review of representation of natural numbers, integers, and rational numbers on the number\nline. Rational numbers as recurring/ terminating decimals. Operations on real numbers.\n2. Examples of non-recurring/non-terminating decimals. Existence of non-rational numbers\n(irrational numbers) such as\n, \n and their representation on the number line. Explaining\nthat every real number is represented by a unique point on the number line and conversely,\nviz. every point on the number line represents a unique real number.\n3. Definition of nth root of a real number.\n4. Rationalization (with precise meaning) of real numbers of the type\n and \n (and their combinations) where x and y are natural number and a and b are \nintegers. \n5. Recall of laws of exponents with integral powers. Rational exponents with positive real bases\n(to be done by particular cases, allowing learner to arrive at the general laws.)\nUNIT II: ALGEBRA \n1.\nPOLYNOMIALS \n \n \n \n \n \n \n \n       (26) Periods\nDefinition of a polynomial in one variable, with examples and counter examples. Coefficients\nof a polynomial, terms of a polynomial and zero polynomial. Degree of a polynomial. Constant,\nlinear, quadratic and cubic polynomials. Monomials, binomials, trinomials. Factors and\nmultiples. Zeros of a polynomial. Motivate and State the Remainder Theorem with examples.\nStatement and proof of the Factor Theorem. Factorization of ax2 + bx + c, a ≠ 0 where a, b and\nc are real numbers, and of cubic polynomials using the Factor Theorem.\nRecall of algebraic expressions and identities. Verification of identities:\n +\nand their use in factorization of polynomials. \n\n\n--- Page 2 ---\n3 \n2.\nLINEAR EQUATIONS IN TWO VARIABLES \n(16) Periods\nRecall of linear equations in one variable. Introduction to the equation in two variables.\nFocus on linear equations of the type ax + by + c=0.Explain that a linear equation in two \nvariables has infinitely many solutions and justify their being written as ordered pairs of real \nnumbers, plotting them and showing that they lie on a line.\nUNIT III: COORDINATE GEOMETRY \n    COORDINATE GEOMETRY \n(7) Periods\nThe Cartesian plane, coordinates of a point, names and terms associated with the \ncoordinate plane, notations. \nUNIT IV: GEOMETRY \n1.\nINTRODUCTION TO EUCLID'S GEOMETRY                                              (7) Periods\nHistory - Geometry in India and Euclid's geometry. Euclid's method of formalizing observed\nphenomenon \ninto \nrigorous \nMathematics \nwith \ndefinitions, \ncommon/obvious \nnotions,\naxioms/postulates and theorems. The five postulates of Euclid. Showing the relationship\nbetween axiom and theorem, for example:\n(Axiom) 1. Given two distinct points, there exists one and only one line through them.\n(Theorem) 2. (Prove) Two distinct lines cannot have more than one point in common.\n2.\nLINES AND ANGLES\n(15) Periods\n1. (Motivate) If a ray stands on a line, then the sum of the two adjacent angles so formed is 180O\nand the converse.\n2. (Prove) If two lines intersect, vertically opposite angles are equal.\n3. (Motivate) Lines which are parallel to a given line are parallel.\n3.\nTRIANGLES\n(22) Periods\n1. (Motivate) Two triangles are congruent if any two sides and the included angle of one triangle\nis equal to any two sides and the included angle of the other triangle (SAS Congruence).\n2. (Prove) Two triangles are congruent if any two angles and the included side of one triangle is\nequal to any two angles and the included side of the other triangle (ASA Congruence).\n\n\n--- Page 3 ---\n4 \n3. (Motivate) Two triangles are congruent if the three sides of one triangle are equal to three\nsides of the other triangle (SSS Congruence).\n4. (Motivate) Two right triangles are congruent if the hypotenuse and a side of one triangle are\nequal (respectively) to the hypotenuse and a side of the other triangle. (RHS Congruence)\n5. (Prove) The angles opposite to equal sides of a triangle are equal.\n6. (Motivate) The sides opposite to equal angles of a triangle are equal.\n4.\nQUADRILATERALS\n(13) Periods\n1. (Prove) The diagonal divides a parallelogram into two congruent triangles.\n2. (Motivate) In a parallelogram opposite sides are equal, and conversely.\n3. (Motivate) In a parallelogram opposite angles are equal, and conversely.\n4. (Motivate) A quadrilateral is a parallelogram if a pair of its opposite sides is parallel and equal.\n5. (Motivate) In a parallelogram, the diagonals bisect each other and conversely.\n6. (Motivate) In a triangle, the line segment joining the mid points of any two sides is parallel to\nthe third side and in half of it and (motivate) its converse.\n5.\nCIRCLES \n   (17) Periods\n1.(Prove) Equal chords of a circle subtend equal angles at the center and (motivate) its\nconverse. \n2.(Motivate) The perpendicular from the center of a circle to a chord bisects the chord and \nconversely, the line drawn through the center of a circle to bisect a chord is perpendicular to \nthe chord. \n3. (Motivate) Equal chords of a circle (or of congruent circles) are equidistant from the center\n(or their respective centers) and conversely.\n4.(Prove) The angle subtended by an arc at the center is double the angle subtended by it at any \npoint on the remaining part of the circle. \n5.(Motivate) Angles in the same segment of a circle are equal. \n6.(Motivate) If a line segment joining two points subtends equal angle at two other points lying \non the same side of the line containing the segment, the four points lie on a circle. \n7.(Motivate) The sum of either of the pair of the opposite angles of a cyclic quadrilateral is 180° \nand its converse. \nUNIT V: MENSURATION \n1.\nAREAS\n(5) Periods\nArea of a triangle using Heron's formula (without proof)\n2.\nSURFACE AREAS AND VOLUMES \n     (17) Periods\nSurface areas and volumes of spheres (including hemispheres) and right circular cones.\n\n\n--- Page 4 ---\n5 \nUNIT VI: STATISTICS \n   STATISTICS \n(15) Periods\nBar graphs, histograms (with varying base lengths), and frequency polygons. \nMATHEMATICS  \nQUESTION PAPER DESIGN \nCLASS – IX (2023-24) \nTime: 3 Hrs.  \n   Max. Marks: 80 \nS. \nNo. Typology of Questions \nTotal \nMarks \n% \nWeightage \n(approx.) \n1 \nRemembering: Exhibit memory of previously learned material by \nrecalling facts, terms, basic concepts, and answers. \nUnderstanding: Demonstrate understanding of facts and ideas by \norganizing, comparing, translating, interpreting, giving descriptions, \nand stating main ideas \n43 \n54 \n2 \nApplying: Solve problems to new situations by applying acquired \nknowledge, facts, techniques and rules in a different way. \n19 \n24 \n3 \nAnalysing : \nExamine and break information into parts by identifying motives or \ncauses. \nMake \ninferences \nand \nfind \nevidence \nto \nsupport \ngeneralizations \nEvaluating: \nPresent and defend opinions by making judgments about \ninformation, validity of ideas, or quality of work based on a set of \ncriteria. \nCreating:  \nCompile information together in a different way by combining \nelements in a new pattern or proposing alternative solutions \n18 \n22 \nTotal \n80 \n100 \nINTERNAL ASSESSMENT \n 20 MARKS \nPen Paper Test and Multiple Assessment  (5+5)    \n 10 Marks \nPortfolio  \n 05 Marks \nLab Practical (Lab activities to be done from the prescribed books) \n  05 Marks \n",
  "pdf_urls": [
    "https://cdn1.byjus.com/wp-content/uploads/2023/04/CBSE-Syllabus-for-Class-9-April-11-Maths-2023-24.pdf"
  ],
  "extracted_at": "2026-01-29T11:02:52.998888",
  "pdf_local_files": [
    "syllabus/pdfs/class_9_maths_1.pdf"
  ],
  "pdf_parsed_at": "2026-01-30T13:29:25.581972"
}