{
  "url": "https://byjus.com/cbse/class-11-maths-syllabus/",
  "title": "",
  "description": "",
  "units": [],
  "chapters": [],
  "topics": [
    "CBSE Class 11 Maths Syllabus PDF 2023-24"
  ],
  "marking_scheme": [
    {
      "headers": [
        "No.",
        "Units",
        "Marks"
      ],
      "rows": [
        [
          "I.",
          "Sets and Functions",
          "23"
        ],
        [
          "II.",
          "Algebra",
          "25"
        ],
        [
          "III.",
          "Coordinate Geometry",
          "12"
        ],
        [
          "IV.",
          "Calculus",
          "08"
        ],
        [
          "V.",
          "Statistics and Probability",
          "12"
        ],
        [
          "",
          "Total Theory",
          "80"
        ],
        [
          "",
          "Internal Assessment",
          "20"
        ],
        [
          "",
          "Grand Total",
          "100"
        ]
      ]
    }
  ],
  "raw_content": "CBSE Syllabus for Class 11 Mathsfor 2023-24 is released by the board. The Class 11 Maths Syllabus 2023-24 consists of 5 units which account for 80 marks in the theory exam. The CBSE Class 11 Maths Syllabus is a crucial resource for students that help them in exam preparation. It provides the details on the course structure, exam pattern and marks weightage in the maths exam. Before preparing for the Class 11 Maths exam, students should go through the syllabus to know what they will study for the 2023-2024 academic year. Referring to the Maths Syllabus will work as a checklist for students ofCBSE Class 11. They can quickly analyse the topics that they have covered and the topics they need to complete.\nCBSE Class 11 Maths Syllabus 2023-24\nThe CBSE Syllabus for Class 11 Maths 2023-24 has been released by the board. Students can download the syllabus PDF and go through it to plan their studies. After knowing theCBSE Syllabus, students can easily create a study plan for themselves. Accordingly, they can make the exam strategy and efficiently prepare for Maths Class 11 exams.\nCBSE Class 11 Maths Syllabus PDF 2023-24\nMaths generate analytical and problem-solving skills in students. It is a scoring subject for students. By following the correct strategy and approach, students can score full marks in the subject. They can access the CBSE Class 11 Maths Syllabus for the examinations 2023-24 along with marks distribution from the PDF link provided above.\nCBSE Class 11 Maths Syllabus for 2023-24 with Marking Scheme\nCBSE syllabus for class 11 Maths is divided into 5 units. The table below shows the units, number of periods and marks allocated for maths subject. The maths theory paper is of 80 marks and the internal assessment is of 20 marks.\nNo.UnitsMarksI.Sets and Functions23II.Algebra25III.Coordinate Geometry12IV.Calculus08V.Statistics and Probability12Total Theory80Internal Assessment20Grand Total100\nNo.UnitsMarks\nNo.\nUnits\nMarks\nI.Sets and Functions23\nSets and Functions\nII.Algebra25\nII.\nAlgebra\nIII.Coordinate Geometry12\nIII.\nCoordinate Geometry\nIV.Calculus08\nIV.\nCalculus\nV.Statistics and Probability12\nStatistics and Probability\nTotal Theory80\nTotal Theory\nInternal Assessment20\nInternal Assessment\nGrand Total100\nGrand Total\n100\n2023-24 CBSE Class 11 Maths Syllabus\nBelow you will find the CBSE Class Maths Syllabus for students.\nUnit-I: Sets and Functions\n1. Sets\nSets and their representations, empty sets, finite and infinite sets, equal sets, subsets, and subsets of a set of real numbers, especially intervals (with notations), universal set, Venn diagrams, union and intersection of sets, difference of sets, complement of a set and properties of complement.\n2. Relations & Functions\nOrdered pairs, Cartesian product of sets, number of elements in the Cartesian product of two finite sets, Cartesian product of the set of reals with itself (upto R x R x R), definition of relation, pictorial diagrams, domain, co-domain and range of a relation. Function as a special type of relation. Pictorial representation of a function, domain, co-domain and range of a function. Real valued functions, domain and range of these functions, constant, identity, polynomial, rational, modulus, signum, exponential, logarithmic and greatest integer functions, with their graphs. Sum, difference, product and quotients of functions.\n3. Trigonometric Functions\nPositive and negative angles, measuring angles in radians and in degrees and conversion from one measure to another, definition of trigonometric functions with the help of unit circle, truth of the identity, signs of trigonometric functions, domain and range of trigonometric functions and their graphs, expressing sin (x±y) and cos (x±y) in terms of sinx, siny, cosx & cosy and their simple applications.\nUnit-II: Algebra\n1. Complex Numbers and Quadratic Equations\nNeed for complex numbers, especially√−1, to be motivated by the inability to solve some of the quadratic equations. Algebraic properties of complex numbers, Argand plane.\n2. Linear Inequalities\nLinear inequalities, algebraic solutions of linear inequalities in one variable and their representation on the number line.\n3. Permutations and Combinations\nThe fundamental principle of counting. Factorial n. (n!) Permutations and combinations, derivation of Formulae fornPrandnCrand their connections, simple applications.\n4. Binomial Theorem\nHistorical perspective, statement and proof of the binomial theorem for positive integral indices, Pascal’s triangle, simple applications.\n5. Sequence and Series\nSequence and series, arithmetic progression (A. P.), arithmetic mean (A.M.),  geometric progression (G.P.), general term of a G.P., sum of n terms of a G.P., infinite G.P. and its sum, geometric mean (G.M.), relation between A.M. and G.M.\nUnit-III: Coordinate Geometry\n1. Straight Lines\nBrief recall of two-dimensional geometry from earlier classes. Slope of a line and angle between two lines. Various forms of equations of a line: parallel to axis, point-slope form, slope-intercept form, two-point form, intercept form and normal form. General equation of a line. Distance of a point from a line.\n2. Conic Sections\nSections of a cone: circles, ellipse, parabola, hyperbola, a point, a straight line and a pair of intersecting lines as a degenerated case of a conic section. Standard equations and simple properties of parabola, ellipse and hyperbola. Standard equation of a circle.\n3. Introduction to Three-Dimensional Geometry\nCoordinate axes and coordinate planes in three dimensions. Coordinates of a point. Distance between two points.\nUnit-IV: Calculus\n1. Limits and Derivatives\nDerivative introduced as rate of change both as that of distance function and geometrically, intuitive idea of limit, limits of polynomials and rational functions trigonometric, exponential and logarithmic functions, definition of derivative relate it to the slope of the tangent of the curve, derivative of sum, difference, product and quotient of functions. Derivatives of polynomial and trigonometric functions.\nUnit-V: Statistics and Probability\n1. Statistics\nMeasures of Dispersion: Range, mean deviation, variance and standard deviation of ungrouped/grouped data.\n2. Probability\nEvents; occurrence of events, ‘not’, ‘and’ and ‘or’ events, exhaustive events, mutually exclusive events, Axiomatic (set theoretic) probability, connections with other theories of earlier classes. Probability of an event, probability of ‘not’, ‘and’ and ‘or’ events.\nStudents can also get the syllabus of all the subjects by visitingCBSE Class 11 Syllabuspage. Learn Maths & Science in an interactive & fun-loving way with BYJU’S App/Tablet.Frequently Asked Questions on CBSE Class 11 Maths Syllabus 2023-24Q1What is the marks distribution for internals and theory exams according to the CBSE Maths Syllabus for Class 11?The marks distribution for internals is 20 marks and the theory exam is 80 marks based on the CBSE Class 11 Maths Syllabus.Q2Which is the most important chapter in the CBSE Class 11 Maths Syllabus?The important chapter in the CBSE Class 11 Maths Syllabus is Algebra which is for 25 marks in the overall weightage.Q3What are the chapters covered in Unit III of the CBSE Class 11 Maths Syllabus?The chapters covered in Unit III of the CBSE Class 11 Maths Syllabus are straight lines, conic sections and an introduction to three-dimensional geometry.\nFrequently Asked Questions on CBSE Class 11 Maths Syllabus 2023-24\nWhat is the marks distribution for internals and theory exams according to the CBSE Maths Syllabus for Class 11?\nWhich is the most important chapter in the CBSE Class 11 Maths Syllabus?\nWhat are the chapters covered in Unit III of the CBSE Class 11 Maths Syllabus?",
  "pdf_content": "=== PDF: class_11_maths_1.pdf ===\n--- Page 1 ---\nCOURSE STRUCTURE \nCLASS XI (2023-24) \nOne Paper \n Total Period–240 [35 Minutes each] \nThree Hours \nMax Marks: 80 \nNo. \nUnits \nNo. of Periods \nMarks \nI. \nSets and Functions \n60 \n23 \nII. \nAlgebra \n50 \n25 \nIII. \nCoordinate Geometry \n50 \n12 \nIV. \nCalculus \n40 \n08 \nV. \nStatistics and Probability \n40 \n12 \nTotal \n240 \n80 \nInternal Assessment \n20 \n*No chapter/unit-wise weightage. Care to be taken to cover all the chapters.\nUnit-I: Sets and Functions \n1.\nSets\n(20) Periods\nSets and their representations, Empty set, Finite and Infinite sets, Equal sets, Subsets, Subsets of \na set of real numbers especially intervals (with notations). Universal set. Venn diagrams. Union \nand Intersection of sets. Difference of sets. Complement of a set. Properties of Complement. \n2.\nRelations & Functions\n(20) Periods\nOrdered pairs. Cartesian product of sets. Number of elements in the Cartesian product of two finite \nsets. Cartesian product of the set of reals with itself (upto R x R x R).Definition of relation, pictorial \ndiagrams, domain, co-domain and range of a relation. Function as a special type of relation. \nPictorial representation of a function, domain, co-domain and range of a function. Real valued \nfunctions, domain and range of these functions, constant, identity, polynomial, rational, modulus, \nsignum, exponential, logarithmic and greatest integer functions, with their graphs. Sum, difference, \nproduct and quotients of functions. \n3.\nTrigonometric Functions\n(20) Periods\nPositive and negative angles. Measuring angles in radians and in degrees and conversion from \none measure to another. Definition of trigonometric functions with the help of unit circle. Truth of \nCBSE Class 11 Mathematics Syllabus 2023-24\n\n\n--- Page 2 ---\nthe identity sin2x + cos2x = 1, for all x. Signs of trigonometric functions. Domain and range of \ntrigonometric functions and their graphs. Expressing sin (x±y) and cos (x±y) in terms of sinx, siny, \ncosx & cosy and their simple applications. Deducing identities like the following: \ntan(x ± y) = tan x ± tan y\n1 ∓tan x tan y , cot(x ± y) = cot x cot y ∓1\ncot y ± cot x\nsinα ± sinβ = 2sin 1\n2 (α ± β)cos1\n2 (α ∓β) \ncosα + cosβ = 2cos 1\n2 (α + β)cos 1\n2 (α −β) \n𝑐𝑜𝑠𝛼−𝑐𝑜𝑠𝛽= −2𝑠𝑖𝑛1\n2 (𝛼+ 𝛽)𝑠𝑖𝑛1\n2 (𝛼−𝛽) \nIdentities related to sin2x, cos2x, tan2 x, sin3x, cos3x and tan3x. \nUnit-II: Algebra \n1.\nComplex Numbers and Quadratic Equations\n(10) Periods\nNeed for complex numbers, especially√−1, to be motivated by inability to solve some of the \nquadratic equations. Algebraic properties of complex numbers. Argand plane  \n2.\nLinear Inequalities\n(10) Periods\nLinear inequalities. Algebraic solutions of linear inequalities in one variable and their representation \non the number line.  \n3.\nPermutations and Combinations\n(10) Periods\nFundamental principle of counting. Factorial n. (n!) Permutations and combinations, derivation of \nFormulae for nPr  and nCr and their connections, simple applications. \n4.\nBinomial Theorem\n(10) Periods\nHistorical perspective, statement and proof of the binomial theorem for positive integral indices. \nPascal’s triangle, simple applications. \n5.\nSequence and Series\n(10) Periods\nSequence and Series. Arithmetic Mean (A.M.) Geometric Progression (G.P.), general term of a \nG.P., sum of n terms of a G.P., infinite G.P. and its sum, geometric mean (G.M.), relation between\nA.M. and G.M.\n\n\n--- Page 3 ---\nUnit-III: Coordinate Geometry \n1.\nStraight Lines\n(15) Periods\nBrief recall of two dimensional geometry from earlier classes. Slope of a line and angle between \ntwo lines. Various forms of equations of a line: parallel to axis, point -slope form, slope-intercept \nform, two-point form, intercept form, Distance of a point from a line. \n2.\nConic Sections\n(25) Periods\nSections of a cone: circles, ellipse, parabola, hyperbola, a point, a straight line and a pair of \nintersecting lines as a degenerated case of a conic section. Standard equations and simple \nproperties of parabola, ellipse and hyperbola. Standard equation of a circle. \n3.\nIntroduction to Three-dimensional Geometry\n(10) Periods\nCoordinate axes and coordinate planes in three dimensions. Coordinates of a point. Distance \nbetween two points. \nUnit-IV: Calculus \n1.\nLimits and Derivatives\n(40) Periods\nDerivative introduced as rate of change both as that of distance function and geometrically. Intuitive \nidea of limit. Limits of polynomials and rational functions trigonometric, exponential and logarithmic \nfunctions. Definition of derivative relate it to scope of tangent of the curve, derivative of sum, \ndifference, product and quotient of functions. Derivatives of polynomial and trigonometric functions. \nUnit-V Statistics and Probability \n1.\nStatistics\n(20) Periods\nMeasures of Dispersion: Range, Mean deviation, variance and standard deviation of \nungrouped/grouped data.  \n2.\nProbability\n(20) Periods\nEvents; occurrence of events, ‘not’, ‘and’ and ‘or’ events, exhaustive events, mutually exclusive \nevents, Axiomatic (set theoretic) probability, connections with other theories of earlier classes. \nProbability of an event, probability of ‘not’, ‘and’ and ‘or’ events. \n\n\n--- Page 4 ---\nMATHEMATICS  \nQUESTION PAPER DESIGN \nCLASS – XI (2023-24) \nTime: 3 Hours \n \n \n \n \n \n \n \n \nMax. Marks: 80 \n \nS. \nNo. \nTypology of Questions \nTotal \nMarks \n% \nWeight\nage \n \n1 \n \nRemembering: Exhibit memory of previously learned material by \nrecalling facts, terms, basic concepts, and answers. \n \nUnderstanding: Demonstrate understanding of facts and ideas by \norganizing, comparing, translating, interpreting, giving descriptions, \nand stating main ideas \n44 \n55 \n2 \nApplying: Solve problems to new situations by applying acquired \nknowledge, facts, techniques and rules in a different way. \n20 \n25 \n3 \nAnalysing : \nExamine and break information into parts by identifying motives or \ncauses. Make inferences and find evidence to support \ngeneralizations \n \nEvaluating: \nPresent and defend opinions by making judgments about \ninformation, validity of ideas, or quality of work based on a set of \ncriteria. \n \nCreating: \nCompile information together in a different way by combining \nelements in a new pattern or proposing alternative solutions \n \n16 \n20 \n \nTotal  \n80 \n100 \n \n1. \nNo chapter wise weightage. Care to be taken to cover all the chapters \n2. \nSuitable internal variations may be made for generating various templates keeping the overall \nweightage to different form of questions and typology of questions same. \nChoice(s): \nThere will be no overall choice in the question paper. \nHowever, 33% internal choices will be given in all the sections \n \nNote: Please refer the guidelines given under XII Mathematics Syllabus: \nINTERNAL ASSESSMENT  \n \n \n \n \n \n \n20 MARKS \nPeriodic Tests ( Best 2 out of 3 tests conducted)  \n \n \n \n       10 Marks \nMathematics Activities                                                                                          10 Marks \n",
  "pdf_urls": [
    "https://cdn1.byjus.com/wp-content/uploads/2023/04/CBSE-Syllabus-for-Class-11-Mathematics-2023-24.pdf"
  ],
  "extracted_at": "2026-01-29T11:04:26.233967",
  "pdf_local_files": [
    "syllabus/pdfs/class_11_maths_1.pdf"
  ],
  "pdf_parsed_at": "2026-01-30T13:29:26.908643"
}