{
  "url": "https://byjus.com/cbse/class-11-chemistry-syllabus/",
  "title": "",
  "description": "",
  "units": [],
  "chapters": [
    "CBSE Class 11 Chemistry Syllabus PDF 2023-24"
  ],
  "topics": [
    "Determination of pH of some solutions obtained from fruit juices, solution of known and varied concentrations of acids, bases and salts using pH paper or universal indicator.",
    "Comparing the pH of solutions of strong and weak acids of same concentration.",
    "Study the pH change in the titration of a strong base using universal indicator.",
    "Checking the bacterial contamination in drinking water by testing sulphide ion",
    "Study of the methods of purification of water.",
    "Testing the hardness, presence of Iron, Fluoride, Chloride, etc., depending upon the regionalvariation in drinking water and study of causes of presence of these ions above permissiblelimit (if any).",
    "Investigation of the foaming capacity of different washing soaps and the effect of addition ofSodium carbonate on it.",
    "Study the acidity of different samples of tea leaves.",
    "Determination of the rate of evaporation of different liquids Study the effect of acids andbases on the tensile strength of fibres.",
    "Study of acidity of fruit and vegetable juices."
  ],
  "marking_scheme": [
    {
      "headers": [
        "Unit No.",
        "Unit Name",
        "No. of Periods",
        "Marks"
      ],
      "rows": [
        [
          "Unit I",
          "Some Basic Concepts of Chemistry",
          "12",
          "7"
        ],
        [
          "Unit II",
          "Structure of Atom",
          "14",
          "9"
        ],
        [
          "Unit III",
          "Classification of Elements and Periodicity in Properties",
          "8",
          "6"
        ],
        [
          "Unit IV",
          "Chemical Bonding and Molecular Structure",
          "14",
          "7"
        ],
        [
          "Unit V",
          "Chemical Thermodynamics",
          "16",
          "9"
        ],
        [
          "Unit VI",
          "Equilibrium",
          "14",
          "7"
        ],
        [
          "Unit VII",
          "Redox Reactions",
          "6",
          "4"
        ],
        [
          "Unit VIII",
          "Organic Chemistry: Some Basic Principles and Techniques",
          "14",
          "11"
        ],
        [
          "Unit IX",
          "Hydrocarbons",
          "12",
          "10"
        ],
        [
          "",
          "Total",
          "",
          "70"
        ]
      ]
    },
    {
      "headers": [
        "Evaluation Scheme",
        "Marks"
      ],
      "rows": [
        [
          "Volumetric Analysis",
          "08"
        ],
        [
          "Salt Analysis",
          "08"
        ],
        [
          "Content Based Experiment",
          "06"
        ],
        [
          "Project Work",
          "04"
        ],
        [
          "Class record and viva",
          "04"
        ],
        [
          "Total",
          "30"
        ]
      ]
    }
  ],
  "raw_content": "CBSE Class 11 Chemistry Syllabusis a vast which needs a clear understanding of the concepts and topics. Knowing CBSE Class 11 Chemistry syllabus helps students to understand the course structure of Chemistry for the academic year 2023-24. Going through the syllabus,CBSE Class 11students will get to know what they have to study, marks distribution for each unit and time duration of the same effectively. Based on that, they can easily plan their study in a systematic way. Students must follow the CBSE Class 11 Chemistry syllabus as the final exam question paper will be framed based on that. PractisingCBSE syllabuswill help students get acquainted to the chapters and important topics they must study in order to score good academic marks.\nCBSE Class 11 Chemistry Syllabus 2023-24\nThe board has released theCBSE Syllabus for Class 11Chemistry. Students can download the syllabus in PDF format and go through it systematically to plan their studies. Besides detailed list of chapters, the CBSE Syllabus for Class 11 Chemistry includes the information about practicals, projects, assignments, etc. that need to be covered for the respective academic year 2023-24.\nCBSE Class 11 Chemistry Syllabus PDF 2023-24\nCBSE Class 11 Chemistry Syllabus 2023-24\nThe table below consists of chapter names, marks distribution for each chapter and number of periods allocated for Chemistry subject.\nUnit No.Unit NameNo. of PeriodsMarksUnit ISome Basic Concepts of Chemistry127Unit IIStructure of Atom149Unit IIIClassification of Elements and Periodicity in Properties86Unit IVChemical Bonding and Molecular Structure147Unit VChemical Thermodynamics169Unit VIEquilibrium147Unit VIIRedox Reactions64Unit VIIIOrganic Chemistry: Some Basic Principles and Techniques1411Unit IXHydrocarbons1210Total70\nUnit No.Unit NameNo. of PeriodsMarks\nUnit No.\nUnit Name\nNo. of Periods\nMarks\nUnit ISome Basic Concepts of Chemistry127\nUnit I\nSome Basic Concepts of Chemistry\nUnit IIStructure of Atom149\nUnit II\nStructure of Atom\nUnit IIIClassification of Elements and Periodicity in Properties86\nUnit III\nClassification of Elements and Periodicity in Properties\nUnit IVChemical Bonding and Molecular Structure147\nUnit IV\nChemical Bonding and Molecular Structure\nUnit VChemical Thermodynamics169\nUnit V\nChemical Thermodynamics\nUnit VIEquilibrium147\nUnit VI\nEquilibrium\nUnit VIIRedox Reactions64\nUnit VII\nRedox Reactions\nUnit VIIIOrganic Chemistry: Some Basic Principles and Techniques1411\nUnit VIII\nOrganic Chemistry: Some Basic Principles and Techniques\nUnit IXHydrocarbons1210\nUnit IX\nHydrocarbons\nTotal70\nTotal\nStudents can click on CBSE Class 11 Syllabus to know the syllabus for all the subjects.\n2023-24 Unit-wise CBSE Class 11 Syllabus for Chemistry 2023-24\nBelow is a list of detailed information on each unit for Class 11 Students.\nUNIT I – Some Basic Concepts of Chemistry\nGeneral Introduction: Importance and scope of Chemistry.\nNature of matter, laws of chemical combination, Dalton’s atomic theory: concept of elements,atoms and molecules.\nAtomic and molecular masses, mole concept and molar mass, percentage composition, empirical and molecular formula, chemical reactions, stoichiometry and calculations based on stoichiometry.\nUNIT II – Structure of Atom\nDiscovery of Electron, Proton and Neutron, atomic number, isotopes and isobars. Thomson’s model and its limitations. Rutherford’s model and its limitations, Bohr’s model and its limitations, concept of shells and subshells, dual nature of matter and light, de Broglie’s relationship, Heisenberg uncertainty principle, concept of orbitals, quantum numbers, shapes of s, p and d orbitals, rules for filling electrons in orbitals – Aufbau principle, Pauli’s exclusion principle and Hund’s rule, electronic configuration of atoms, stability of half-filled and completely filled orbitals.\nUNIT III – Classification of Elements and Periodicity in Properties\nSignificance of classification, brief history of the development of periodic table, modern periodic law and the present form of periodic table, periodic trends in properties of elements -atomic radii, ionic radii, inert gas radii, Ionization enthalpy, electron gain enthalpy, electronegativity, valency. Nomenclature of elements with atomic number greater than 100.\nUNIT IV – Chemical Bonding and Molecular Structure\nValence electrons, ionic bond, covalent bond, bond parameters, Lewis structure, polar character of covalent bond, covalent character of ionic bond, valence bond theory, resonance, geometry of covalent molecules, VSEPR theory, concept of hybridization, involving s, p and d orbitals and shapes of some simple molecules, molecular orbital theory of homonuclear diatomic molecules(qualitative idea only), Hydrogen bond.\nUNIT V – Chemical Thermodynamics\nConcepts of System and types of systems, surroundings, work, heat, energy, extensive and intensive properties, state functions. First law of thermodynamics – internal energy and enthalpy, measurement of U and H, Hess’s law of constant heat summation, enthalpy of bond dissociation, combustion, formation, atomization, sublimation, phase transition, ionization, solution and dilution. Second law of Thermodynamics (brief introduction)Introduction of entropy as a state function, Gibb’s energy change for spontaneous and nonspontaneous processes.Third law of thermodynamics (brief introduction).\nUNIT VI – Equilibrium\nEquilibrium in physical and chemical processes, dynamic nature of equilibrium, law of mass action, equilibrium constant, factors affecting equilibrium – Le Chatelier’s principle, ionic equilibrium- ionization of acids and bases, strong and weak electrolytes, degree of ionization,ionization of poly basic acids, acid strength, concept of pH, hydrolysis of salts (elementary idea), buffer solution, Henderson Equation, solubility product, common ion effect (with illustrative examples).\nUNIT VII – Redox Reactions\nConcept of oxidation and reduction, redox reactions, oxidation number, balancing redox reactions, in terms of loss and gain of electrons and change in oxidation number, applications of redox reactions.\nUNIT VIII – Organic Chemistry: Some basic Principles and Techniques\nGeneral introduction, classification and IUPAC nomenclature of organic compounds. Electronic displacements in a covalent bond: inductive effect, electromeric effect, resonance and hyper conjugation. Homolytic and heterolytic fission of a covalent bond: free radicals, carbocations, carbanions, electrophiles and nucleophiles, types of organic reactions.\nUNIT IX – Hydrocarbons\nClassification of HydrocarbonsAliphatic Hydrocarbons:Alkanes – Nomenclature, isomerism, conformation (ethane only), physical properties, chemical reactions.Alkenes – Nomenclature, structure of double bond (ethene), geometrical isomerism, physical properties, methods of preparation, chemical reactions: addition of hydrogen, halogen, water, hydrogen halides (Markovnikov’s addition and peroxide effect), ozonolysis, oxidation, mechanism of electrophilic addition.Alkynes – Nomenclature, structure of triple bond (ethyne), physical properties, methods of preparation, chemical reactions: acidic character of alkynes, addition reaction of – hydrogen, halogens, hydrogen halides and water.\nAromatic Hydrocarbons:\nIntroduction, IUPAC nomenclature, benzene: resonance, aromaticity, chemical properties: mechanism of electrophilic substitution. Nitration, sulphonation, halogenation, Friedel Craft’s alkylation and acylation, directive influence of functional group in monosubstituted benzene. Carcinogenicity and toxicity.\nTo know the CBSE Syllabus for all the classes from 1 to 12, visit the Syllabus page ofCBSE. Meanwhile, to get the Practical Syllabus of Class 11 Chemistry, read on to find out more about the syllabus and related information in this page.\nCBSE Class 11 Chemistry Practical Syllabus 2023-24 with Marking Scheme\nIn Chemistry subject, practical also plays a vital role in improving their academic scores in the subject. Students can understand the theory concepts easily by performing the experiments in the lab. Therefore, it is important that students must also know about the CBSE Syllabus of Chemistry Practical and list of experiments included in it. The overall weightage of Chemistry practical mentioned in the CBSE Class 11 Chemistry syllabus is 30 marks. So, students must try their best to score well in practicals along with theory. It will help in increasing their overall academic score.\nCBSE Class 11 Chemistry Practical Syllabus 2023-24\nThe experiments will be conducted under the supervision of subject teacher. CBSE Chemistry Practicals is for 30 marks. This contribute to the overall practical marks for the subject.\nThe table below consists of evaluation scheme of practical exams.\nEvaluation SchemeMarksVolumetric Analysis08Salt Analysis08Content Based Experiment06Project Work04Class record and viva04Total30\nEvaluation SchemeMarks\nEvaluation Scheme\nMarks\nVolumetric Analysis08\nVolumetric Analysis\nSalt Analysis08\nSalt Analysis\nContent Based Experiment06\nContent Based Experiment\nProject Work04\nProject Work\nClass record and viva04\nClass record and viva\nTotal30\nTotal\nCBSE Syllabus for Class 11 Chemistry Practical 2023-24\nMicro-chemical methods are available for several of the practical experiments. Wherever possible such techniques should be used.\nA. Basic Laboratory Techniques1. Cutting glass tube and glass rod2. Bending a glass tube3. Drawing out a glass jet4. Boring a cork\nB. Characterization and Purification of Chemical Substances1. Determination of melting point of an organic compound.2. Determination of boiling point of an organic compound.3. Crystallization of impure sample of any one of the following: Alum, Copper Sulphate, Benzoic Acid.\nC. Experiments based on pH\n1. Any one of the following experiments:\nDetermination of pH of some solutions obtained from fruit juices, solution of known and varied concentrations of acids, bases and salts using pH paper or universal indicator.\nComparing the pH of solutions of strong and weak acids of same concentration.\nStudy the pH change in the titration of a strong base using universal indicator.\n2. Study the pH change by common-ion in case of weak acids and weak bases.\nD. Chemical EquilibriumOne of the following experiments:\n1. Study the shift in equilibrium between ferric ions and thiocyanate ions by increasing/decreasing the concentration of either of the ions.2. Study the shift in equilibrium between [Co(H2O)6]2+and chloride ions by changing the concentration of either of the ions.\nE. Quantitative Estimationi. Using a mechanical balance/electronic balance.ii. Preparation of standard solution of Oxalic acid.iii. Determination of strength of a given solution of Sodium hydroxide by titrating it against standard solution of Oxalic acid.iv. Preparation of standard solution of Sodium carbonate.v. Determination of strength of a given solution of hydrochloric acid by titrating it against standard Sodium Carbonatesolution.\nF. Qualitative Analysis1) Determination of one anion and one cation in a given saltCations‐ Pb2+, Cu2+, As3+, Al3+, Fe3+, Mn2+, Ni2+, Zn2+, Co2+, Ca2+, Sr2+, Ba2+, Mg2+, NH4+Anions – (CO3)2‐, S2‐, NO2‐, SO32‐, SO2‐, NO‐, Cl‐, Br‐, I‐, PO43‐, C2O2‐ ,CH3COO‐(Note: Insoluble salts excluded)\n2) Detection of ‐ Nitrogen, Sulphur, Chlorine in organic compounds.\nG) PROJECTSScientific investigations involving laboratory testing and collecting information from other sources.\nA few suggested projects are as follows:\nChecking the bacterial contamination in drinking water by testing sulphide ion\nStudy of the methods of purification of water.\nTesting the hardness, presence of Iron, Fluoride, Chloride, etc., depending upon the regionalvariation in drinking water and study of causes of presence of these ions above permissiblelimit (if any).\nInvestigation of the foaming capacity of different washing soaps and the effect of addition ofSodium carbonate on it.\nStudy the acidity of different samples of tea leaves.\nDetermination of the rate of evaporation of different liquids Study the effect of acids andbases on the tensile strength of fibres.\nStudy of acidity of fruit and vegetable juices.\nNote: Any other investigatory project, which involves about 10 periods of work, can be chosen with theapproval of the teacher.\nPractical Examination for Visually Impaired Students of Class 11\nBelow is a list of practicals for the visually impaired students.\nA. List of apparatus for identification for assessment in practicals (All experiments)Beaker, tripod stand, wire gauze, glass rod, funnel, filter paper, Bunsen burner, test tube, test tube stand,dropper, test tube holder, ignition tube, china dish, tongs, standard flask, pipette, burette, conical flask, clampstand, dropper, wash bottle• Odour detection in qualitative analysis• Procedure/Setup of the apparatus\nB. List of Experiments A. Characterization and Purification of Chemical Substances1. Crystallization of an impure sample of any one of the following: copper sulphate, benzoic acidB. Experiments based on pH1. Determination of pH of some solutions obtained from fruit juices, solutions of known and variedconcentrations of acids, bases and salts using pH paper2. Comparing the pH of solutions of strong and weak acids of same concentration.\nC. Chemical Equilibrium1. Study the shift in equilibrium between ferric ions and thiocyanate ions by increasing/decreasingthe concentration of eitherions.2. Study the shift in equilibrium between [Co(H2O)6]2+ and chloride ions by changing theconcentration of either of the ions.\nD. Quantitative estimation1. Preparation of standard solution of oxalic acid.2. Determination of molarity of a given solution of sodium hydroxide by titrating it against standardsolution of oxalic acid.\nE. Qualitative Analysis1. Determination of one anion and one cation in a given salt2. Cations – NH+4Anions – (CO3)2-, S2-, (SO3)2-, Cl-, CH3COO-(Note: insoluble salts excluded)3. Detection of Nitrogen in the given organic compound.4. Detection of Halogen in the given organic compound.\nNote: The above practicals may be carried out in an experiential manner rather than recording observations.\nWe hope students must have found this information onCBSE Syllabususeful for their studying Chemistry. Learn Maths & Science in interactive and fun loving ways with BYJU’S App/Tablet.\nFrequently Asked Questions on CBSE Class 11 Chemistry Syllabus 2023-24\nHow many units are in the CBSE Class 11 Chemistry Syllabus?\nWhat is the total marks for practicals examination as per the CBSE Class 11 Chemistry Syllabus?\nWhich chapter carries more weightage as per the CBSE Syllabus for Class 11 Chemistry?",
  "pdf_content": "=== PDF: class_11_chemistry_1.pdf ===\n--- Page 1 ---\n COURSE STRUCTURE  \nCLASS–XI (THEORY) (2023-24) \nTime: 3 Hours \nTotal Marks70 \nS.No\nUNIT \nNo. of \nPeriods \nMarks \n1 Some Basic Concepts of Chemistry \n12 \n7 \n2 Structure of Atom \n14 \n9 \n3 Classification of Elements and Periodicity in \nProperties \n8 \n6 \n4 Chemical Bonding and Molecular Structure \n14 \n7 \n5 Chemical Thermodynamics \n16 \n9 \n6 Equilibrium \n14 \n7 \n7 Redox Reactions \n6 \n4 \n8 Organic Chemistry: Some basic Principles and \nTechniques \n14 \n11 \n9 Hydrocarbons \n12 \n10 \nTOTAL \n70 \nUnit I: \nSome Basic Concepts of Chemistry \n12 Periods \nGeneral Introduction: Importance and scope of Chemistry.  \nNature of matter, laws of chemical combination, Dalton's atomic theory: concept of elements, \natoms and molecules.  \nAtomic and molecular masses, mole concept and molar mass, percentage composition, \nempirical and molecular formula, chemical reactions, stoichiometry and calculations based on \nstoichiometry.   \nUnit II: \nStructure of Atom \n14 Periods \nDiscovery of Electron, Proton and Neutron, atomic number, isotopes and isobars. Thomson's \nmodel and its limitations. Rutherford's model and its limitations, Bohr's model and its \nlimitations, concept of shells and subshells, dual nature of matter and light, de Broglie's \nrelationship, Heisenberg uncertainty principle, concept of orbitals, quantum numbers, shapes \nof s, p and d orbitals, rules for filling electrons in orbitals - Aufbau principle, Pauli's exclusion \nprinciple and Hund's rule, electronic configuration of atoms, stability of half-filled and \ncompletely filled orbitals.  \nCBSE Class 11 Chemistry Syllabus 2023-24\n\n\n--- Page 2 ---\nUnit III:  \nClassification of Elements and Periodicity in Properties  \n08 Periods  \n  \nSignificance of classification, brief history of the development of periodic table, modern periodic \nlaw and the present form of periodic table, periodic trends in properties of elements -atomic \nradii, ionic radii, inert gas radii, Ionization enthalpy, electron gain enthalpy, electronegativity, \nvalency. Nomenclature of elements with atomic number greater than 100.   \n \nUnit IV:  \nChemical Bonding and Molecular Structure  \n  \n  14 Periods  \n  \nValence electrons, ionic bond, covalent bond, bond parameters, Lewis structure, polar character \nof covalent bond, covalent character of ionic bond, valence bond theory, resonance, geometry \nof covalent molecules, VSEPR theory, concept of hybridization, involving s, p and d orbitals and \nshapes of some simple molecules, molecular orbital theory of homonuclear diatomic \nmolecules(qualitative idea only), Hydrogen bond.   \n \n \nUnit VI:  \nChemical Thermodynamics  \n  \n  16 Periods  \n  \nConcepts of System and types of systems, surroundings, work, heat, energy, extensive and \nintensive properties, state functions.  \n  \nFirst law of thermodynamics -internal energy and enthalpy, heat capacity and specific heat, \nmeasurement of \nU and \nH, Hess's law of constant heat summation, enthalpy of bond \ndissociation, combustion, formation, atomization, sublimation, phase transition, ionization, \nsolution and dilution. Second law of Thermodynamics (brief introduction)  \n  \nIntroduction of entropy as a state function, Gibb's energy change for spontaneous and non- \nspontaneous processes, criteria for equilibrium.  \n  \nThird law of thermodynamics (brief introduction).   \nUnit VII:   Equilibrium  \n  \n  14 Periods  \n \n \n  \nEquilibrium in physical and chemical processes, dynamic nature of equilibrium, law of mass \naction, equilibrium constant, factors affecting equilibrium - Le Chatelier's principle, ionic \nequilibrium- ionization of acids and bases, strong and weak electrolytes, degree of ionization, \nionization of poly basic acids, acid strength, concept of pH, hydrolysis of salts (elementary idea), \nbuffer solution, Henderson Equation, solubility product, common ion effect (with illustrative \nexamples).  \nUnit VIII: Redox Reactions  \n  \n  06 Periods  \n                   Concept of oxidation and reduction, redox reactions, oxidation number, balancing redox \nreactions, in terms of loss and gain of electrons and change in oxidation number, applications \nof redox reactions.  \n \n  \nUnit XII:   Organic Chemistry -Some Basic Principles and Techniques  \n  \n  14 Periods \nGeneral introduction, methods of purification, qualitative and quantitative analysis, classification \nand IUPAC nomenclature of organic compounds. Electronic displacements in a covalent bond: \ninductive effect, electromeric effect, resonance and hyper conjugation. Homolytic and heterolytic \nfission of a covalent bond: free radicals, carbocations, carbanions, electrophiles and nucleophiles, \ntypes of organic reactions.  \n \n\n\n--- Page 3 ---\nUnit XIII: Hydrocarbons  \n  \n12 Periods  \n \nClassification of Hydrocarbons  \n \nAliphatic Hydrocarbons:  \n \nAlkanes - Nomenclature, isomerism, conformation (ethane only), physical properties, chemical \nreactions including free radical mechanism of halogenation, combustion and pyrolysis.  \n \nAlkenes - Nomenclature, structure of double bond (ethene), geometrical isomerism, physical \nproperties, methods of preparation, chemical reactions: addition of hydrogen, halogen, water, \nhydrogen halides (Markovnikov's addition and peroxide effect), ozonolysis, oxidation, mechanism \nof electrophilic addition.  \n \nAlkynes - Nomenclature, structure of triple bond (ethyne), physical properties, methods of \npreparation, chemical reactions: acidic character of alkynes, addition reaction of - hydrogen, \nhalogens, hydrogen halides and water.  \n \nAromatic Hydrocarbons:   \n \nIntroduction, IUPAC nomenclature, benzene: resonance, aromaticity, chemical properties: \nmechanism of electrophilic substitution. Nitration, sulphonation, halogenation, Friedel Craft's \nalkylation and acylation, directive influence of functional group in monosubstituted benzene. \nCarcinogenicity and toxicity.  \n  \nPRACTICALS  \n  \nEvaluation Scheme for Examination  \nMarks  \nVolumetric Analysis  \n08  \nSalt Analysis  \n08  \nContent Based Experiment  \n06  \nProject Work  \n04  \nClass record and viva  \n04  \nTotal  \n30  \n  \n \nPRACTICAL SYLLABUS  \nTotal Periods: 60  \nMicro-chemical methods are available for several of the practical experiments, wherever possible such \ntechniques should be used.  \n  \nA. Basic Laboratory Techniques  \n1. Cutting glass tube and glass rod  \n2. Bending a glass tube  \n3. Drawing out a glass jet  \n4. Boring a cork  \n\n\n--- Page 4 ---\n \nB. Characterization and Purification of Chemical Substances  \n1. Determination of melting point of an organic compound.  \n2. Determination of boiling point of an organic compound.  \n3. Crystallization of impure sample of any one of the following: Alum, Copper Sulphate, Benzoic Acid.  \nC. Experiments based on pH  \na) \nAny one of the following experiments:  \n• \nDetermination of pH of some solutions obtained from fruit juices, solution of known and \nvaried concentrations of acids, bases and salts using pH paper or universal indicator.  \n• \nComparing the pH of solutions of strong and weak acids of same concentration. \n \n \nStudy the pH change in the titration of a strong base using universal indicator.  \nb) \nStudy the pH change by common-ion in case of weak acids and weak bases.  \nD. Chemical Equilibrium  \n \n  \nOne of the following experiments:  \na) Study the shift in equilibrium between ferric ions and thiocyanate ions by increasing/decreasing \nthe concentration of either of the ions.  \nb) Study the shift in equilibrium between [Co(H2O)6]2+ and chloride ions by changing the \nconcentration of either of the ions.  \n     E.      Quantitative Estimation  \ni. Using a mechanical balance/electronic balance. ii. \nPreparation of standard solution of Oxalic acid.  \niii. Determination of strength of a given solution of Sodium hydroxide by titrating it against standard \nsolution of Oxalic acid.  \niv. Preparation of standard solution of Sodium carbonate.  \nv. Determination of strength of a given solution of hydrochloric acid by titrating it against standard \nSodium Carbonate solution.  \n F.       Qualitative Analysis  \na) Determination of one anion and one cation in a given salt  \nCations- Pb2+, Cu2+, As3+, Al3+, Fe3+, Mn2+, Ni2+, Zn2+, Co2+, Ca2+, Sr2+, Ba2+, Mg2+, NH4+  \nAnions – CO32-- , S2-,  NO2- , SO32--, SO42-, NO3- , Cl- , Br-, I-, PO43- , ,  CH3COO- (Note: Insoluble salts \nexcluded)  \n \nb) Detection of -Nitrogen, Sulphur, Chlorine in organic compounds.   \n  \nc) PROJECTS  \nScientific investigations involving laboratory testing and collecting information from other \nsources.  \n A few suggested Projects  \n• \nChecking the bacterial contamination in drinking water by testing sulphide ion  \n• \nStudy of the methods of purification of water  \n\n\n--- Page 5 ---\n• \nTesting the hardness, presence of Iron, Fluoride, Chloride, etc., depending upon the regional \nvariation in drinking water and study of causes of presence of these ions above permissible \nlimit (if any).  \n• \nInvestigation of the foaming capacity of different washing soaps and the effect of addition of \nSodium carbonate on it  \n• \nStudy the acidity of different samples of tea leaves.  \n• \nDetermination of the rate of evaporation of different liquids   Study the effect of acids and \nbases on the tensile strength of fibers.  \n• \n Study of acidity of fruit and vegetable juices.  \nNote: Any other investigatory project, which involves about 10 periods of work, can be chosen with the \napproval of the teacher.  \n  \n  \n  \nPractical Examination for Visually Impaired Students   \nClass XI  \nNote: Same Evaluation scheme and general guidelines for visually impaired students as given for Class XII may \nbe followed.  \nA. List of apparatus for identification for assessment in practicals (All experiments)  \nBeaker, tripod stand, wire gauze, glass rod, funnel, filter paper, Bunsen burner, test tube, test tube stand, \ndropper, test tube holder, ignition tube, china dish, tongs, standard flask, pipette, burette, conical flask, clamp \nstand, dropper, wash bottle  \n• \nOdour detection in qualitative analysis  \n• \nProcedure/Setup of the apparatus  \n  \nB.  List of Experiments A. Characterization and Purification of Chemical Substances  \n1. Crystallization of an impure sample of any one of the following: copper sulphate, benzoic acid  \nB. Experiments based on pH  \n1. Determination of pH of some solutions obtained from fruit juices, solutions of known and varied \nconcentrations of acids, bases and salts using pH paper  \n2. Comparing the pH of solutions of strong and weak acids of same concentration.  \nC. Chemical Equilibrium  \n1. Study the shift in equilibrium between ferric ions and thiocyanate ions by increasing/decreasing \nthe concentration of eitherions.  \n2. Study the shift in equilibrium between [Co(H2O)6]2+ and chloride ions by changing the \nconcentration of either of the ions.  \nD. Quantitative estimation  \n1. Preparation of standard solution of oxalic acid.  \n2. Determination of molarity of a given solution of sodium hydroxide by titrating it against standard \nsolution of oxalic acid.  \nE. Qualitative Analysis  \n1. Determination of one anion and one cation in a given salt  \n2. Cations - NH+4  \nAnions – (CO3)2-, S2-, (SO3)2-, Cl-, CH3COO-  \n(Note: insoluble salts excluded)  \n\n\n--- Page 6 ---\n3.\nDetection of Nitrogen in the given organic compound.\n4.\nDetection of Halogen in the given organic compound.\nNote: The above practicals may be carried out in an experiential manner rather than recording observations. \nPrescribed Books:  \n1.\nChemistry Part – I, Class-XI, Published by NCERT.\n2.\nChemistry Part – II, Class-XI, Published by NCERT.\n\n\n--- Page 7 ---\nCHEMISTRY (Code No. 043) QUESTION PAPER DESIGN CLASSES –XI and XII (2023-24) \nS \nDomains \nTotal Marks % \n1 \nRemembering and Understanding:  \nExhibit memory of previously learned material by recalling facts, terms, \nbasic concepts and answers. Demonstrate understanding of facts and \nideas by organizing, comparing, translating, interpreting, giving \ndescriptions and stating main ideas.  \n28 \n40 \n2 \nApplying:  \nSolve problems to new situations by applying acquired knowledge, facts, \ntechniques and rules in a different way.  \n21 \n30 \n3 \nAnalysing, Evaluating and Creating:  \nExamine and break information into parts by identifying motives or causes. \nMake inferences and find evidence to support generalizations. Present and \ndefend opinions by making judgments about information, validity of ideas \nor quality of work based on a set of criteria.  \nCompile information together in a different way by combining elements in \na new pattern or proposing alternative solutions.  \n21 \n30 \n1. No chapter wise weightage. Care to be taken to cover all the chapters.\n2. Suitable internal variations may be made for generating various templates. Choice(s):\n•\nThere will be no overall choice in the question paper.\n•\nHowever, 33% internal choices will be given in all the sections.\n",
  "pdf_urls": [
    "https://cdn1.byjus.com/wp-content/uploads/2023/04/CBSE-Syllabus-for-Class-11-Chemistry-2023-24.pdf"
  ],
  "extracted_at": "2026-01-29T11:04:41.323390",
  "pdf_local_files": [
    "syllabus/pdfs/class_11_chemistry_1.pdf"
  ],
  "pdf_parsed_at": "2026-01-30T13:29:26.458353"
}