{
  "url": "https://byjus.com/cbse/class-11-physics-syllabus/",
  "title": "",
  "description": "",
  "units": [],
  "chapters": [],
  "topics": [
    "CBSE Class 11 Physics Syllabus PDF 2023-24"
  ],
  "marking_scheme": [
    {
      "headers": [
        "Unit No.",
        "Name of Unit",
        "No. of Periods",
        "Marks"
      ],
      "rows": [
        [
          "Unit–I",
          "Physical World and Measurement",
          "08",
          "23"
        ],
        [
          "",
          "Chapter–1:Units and Measurements"
        ],
        [
          "Unit-II",
          "Kinematics",
          "24"
        ],
        [
          "",
          "Chapter–2:Motion in a Straight Line"
        ],
        [
          "",
          "Chapter–3:Motion in a Plane"
        ],
        [
          "Unit–III",
          "Laws of Motion",
          "14"
        ],
        [
          "",
          "Chapter–4:Laws of Motion"
        ],
        [
          "Unit–IV",
          "Work, Energy and Power",
          "14",
          "17"
        ],
        [
          "",
          "Chapter–5:Work, Energy and Power"
        ],
        [
          "Unit–V",
          "Motion of System of Particles and Rigid Body",
          "18"
        ],
        [
          "",
          "Chapter–6:System of Particles and Rotational Motion"
        ],
        [
          "Unit-VI",
          "Gravitation",
          "12"
        ],
        [
          "",
          "Chapter–7:Gravitation"
        ],
        [
          "Unit–VII",
          "Properties of Bulk Matter",
          "24",
          "20"
        ],
        [
          "",
          "Chapter–8:Mechanical Properties of Solids"
        ],
        [
          "",
          "Chapter–9:Mechanical Properties of Fluids"
        ],
        [
          "",
          "Chapter–10:Thermal Properties of Matter"
        ],
        [
          "Unit–VIII",
          "Thermodynamics",
          "12"
        ],
        [
          "",
          "Chapter–11:Thermodynamics"
        ],
        [
          "Unit–IX",
          "Behaviour of Perfect Gases and Kinetic Theory of Gases",
          "08"
        ],
        [
          "",
          "Chapter–12:Kinetic Theory"
        ],
        [
          "Unit–X",
          "Oscillations and Waves",
          "26",
          "10"
        ],
        [
          "",
          "Chapter–13:Oscillations"
        ],
        [
          "",
          "Chapter–14:Waves"
        ],
        [
          "",
          "Total",
          "160",
          "70"
        ]
      ]
    },
    {
      "headers": [
        "Topic",
        "Marks"
      ],
      "rows": [
        [
          "Two experiments, one from each section",
          "7 + 7"
        ],
        [
          "Practical record (experiment and activities)",
          "5"
        ],
        [
          "One activity from any section",
          "3"
        ],
        [
          "Investigatory Project",
          "3"
        ],
        [
          "Viva on experiments, activities and project",
          "5"
        ],
        [
          "Total",
          "30"
        ]
      ]
    },
    {
      "headers": [
        "Topic",
        "Marks"
      ],
      "rows": [
        [
          "Identification/Familiarity with the apparatus",
          "5"
        ],
        [
          "Written test (based on given/prescribed practicals)",
          "10"
        ],
        [
          "Practical Record",
          "5"
        ],
        [
          "Viva",
          "10"
        ],
        [
          "Total",
          "30"
        ]
      ]
    }
  ],
  "raw_content": "CBSE Syllabus for Class 11 Physicsis a helpful learning resource for students. CBSE 11 Physics Syllabus provides information on CBSE Physics topics sub-topics along with marks distribution for all chapters. TheCBSE Syllabusis designed by subject experts after thorough research to help Class 11 students learn and score good marks in exams. The syllabus includes all the necessary information that a student should know before preparing for the exam. The CBSE Syllabus for Class 11 Physics for the academic year 2023-24 is given here. It covers all the important topics and subtopics of CBSE Physics along with the marking scheme and time duration of the course completion.\nCBSE Class 11 Physics Syllabus 2023-24\nThe CBSE Syllabus for Class 11 Physics 2023-24 is released by the board. Students can download the syllabus in PDF format and go through it in order to plan their studies accordingly. This is the official CBSE Syllabus issued by the Board for class 11 students for the examinations 2023-24.\nCBSE Class 11 Physics Syllabus PDF 2023-24\nCBSE Class 11 Physics Syllabus with Course Structure 2023-24\nThe subject of Physics is divided into total of 10 units as per theCBSE Syllabus for Class 11. The table below shows the CBSE Physics unit name, marks distribution and time allocated to complete each unit of the CBSE 11 Physics Syllabus.\nTime:3 hoursMax Marks:70\nUnit No.Name of UnitNo. of PeriodsMarksUnit–IPhysical World and Measurement0823Chapter–1:Units and MeasurementsUnit-IIKinematics24Chapter–2:Motion in a Straight LineChapter–3:Motion in a PlaneUnit–IIILaws of Motion14Chapter–4:Laws of MotionUnit–IVWork, Energy and Power1417Chapter–5:Work, Energy and PowerUnit–VMotion of System of Particles and Rigid Body18Chapter–6:System of Particles and Rotational MotionUnit-VIGravitation12Chapter–7:GravitationUnit–VIIProperties of Bulk Matter2420Chapter–8:Mechanical Properties of SolidsChapter–9:Mechanical Properties of FluidsChapter–10:Thermal Properties of MatterUnit–VIIIThermodynamics12Chapter–11:ThermodynamicsUnit–IXBehaviour of Perfect Gases and Kinetic Theory of Gases08Chapter–12:Kinetic TheoryUnit–XOscillations and Waves2610Chapter–13:OscillationsChapter–14:WavesTotal16070\nUnit No.Name of UnitNo. of PeriodsMarks\nUnit No.\nName of Unit\nNo. of Periods\nMarks\nUnit–IPhysical World and Measurement0823\nUnit–I\nPhysical World and Measurement\nChapter–1:Units and Measurements\nChapter–1:Units and Measurements\nUnit-IIKinematics24\nUnit-II\nKinematics\nChapter–2:Motion in a Straight Line\nChapter–2:Motion in a Straight Line\nChapter–3:Motion in a Plane\nChapter–3:Motion in a Plane\nUnit–IIILaws of Motion14\nUnit–III\nLaws of Motion\nChapter–4:Laws of Motion\nChapter–4:Laws of Motion\nUnit–IVWork, Energy and Power1417\nUnit–IV\nWork, Energy and Power\nChapter–5:Work, Energy and Power\nChapter–5:Work, Energy and Power\nUnit–VMotion of System of Particles and Rigid Body18\nUnit–V\nMotion of System of Particles and Rigid Body\nChapter–6:System of Particles and Rotational Motion\nChapter–6:System of Particles and Rotational Motion\nUnit-VIGravitation12\nUnit-VI\nGravitation\nChapter–7:Gravitation\nChapter–7:Gravitation\nUnit–VIIProperties of Bulk Matter2420\nUnit–VII\nProperties of Bulk Matter\nChapter–8:Mechanical Properties of Solids\nChapter–8:Mechanical Properties of Solids\nChapter–9:Mechanical Properties of Fluids\nChapter–9:Mechanical Properties of Fluids\nChapter–10:Thermal Properties of Matter\nChapter–10:Thermal Properties of Matter\nUnit–VIIIThermodynamics12\nUnit–VIII\nThermodynamics\nChapter–11:Thermodynamics\nChapter–11:Thermodynamics\nUnit–IXBehaviour of Perfect Gases and Kinetic Theory of Gases08\nUnit–IX\nBehaviour of Perfect Gases and Kinetic Theory of Gases\nChapter–12:Kinetic Theory\nChapter–12:Kinetic Theory\nUnit–XOscillations and Waves2610\nUnit–X\nOscillations and Waves\nChapter–13:Oscillations\nChapter–13:Oscillations\nChapter–14:Waves\nChapter–14:Waves\nTotal16070\nTotal\n160\n2023-24 CBSE Unit-wise Class 11 Physics Syllabus\nBelow we have provided the details of the CBSE Physics topics under each unit as per the revised CBSE Class 11 Physics Syllabus for the 2023-24 academic year. Go through it to get the details of the chapters given below.\nUnit-I: Physical World and Measurement\nChapter 2: Units and Measurements\nNeed for measurement: Units of measurement; systems of units; SI units, fundamental and derived units. Length, mass and time measurements; accuracy and precision of measuring instruments; errors in measurement; significant figures.\nDimensions of physical quantities, dimensional analysis and its applications.\nUnit-II: Kinematics\nChapter 3: Motion in a Straight Line\nFrame of reference, Motion in a straight line, Elementary concepts of differentiation and integration for describing motion, uniform and nonuniform motion, and instantaneous velocity, uniformly accelerated motion, velocity-time and position-time graphs. Relations for uniformly accelerated motion (graphical treatment).\nChapter 4: Motion in a Plane\nScalar and vector quantities; position and displacement vectors, general vectors and their notations; equality of vectors, multiplication of vectors by a real number; addition and subtraction of vectors, relative velocity, Unit vector; resolution of a vector in a plane, rectangular components, Scalar and Vector product of vectors.\nMotion in a plane, cases of uniform velocity and uniform acceleration-projectile motion, uniform circular motion.\nUnit-III: Laws of Motion\nChapter 5: Laws of Motion\nIntuitive concept of force, Inertia, Newton’s first law of motion; momentum and Newton’s second law of motion; impulse; Newton’s third law of motion (recapitulation only). Law of conservation of linear momentum and its applications. Equilibrium of concurrent forces, Static and kinetic friction, laws of friction, rolling friction, lubrication.\nDynamics of uniform circular motion: Centripetal force, examples of circular motion (vehicle on a level circular road, vehicle on a banked road).\nUnit-IV: Work, Energy and Power\nChapter 6: Work, Energy and Power\nWork done by a constant force and a variable force; kinetic energy, work-energy theorem, power.\nNotion of potential energy, potential energy of a spring, conservative forces: conservation of mechanical energy (kinetic and potential energies); non-conservative forces: motion in a vertical circle; elastic and inelastic collisions in one and two dimensions.\nUnit-V: Motion of System of Particles and Rigid Body\nChapter 7: System of Particles and Rotational Motion\nCentre of mass of a two-particle system, momentum conservation and centre of mass motion. Centre of mass of a rigid body; centre of mass of a uniform rod. Moment of a force, torque, angular momentum, law of conservation of angular momentum and its applications.\nEquilibrium of rigid bodies, rigid body rotation and equations of rotational motion, comparison of linear and rotational motions.\nMoment of inertia, radius of gyration, values of moments of inertia for simple geometrical objects (no derivation).\nUnit-VI: Gravitation\nChapter 8: Gravitation\nKepler’s laws of planetary motion, universal law of gravitation. Acceleration due to gravity and its variation with altitude and depth. Gravitational potential energy and gravitational potential, escape speed, orbital velocity of a satellite.\nUnit-VII: Properties of Bulk Matter\nChapter 9: Mechanical Properties of Solids\nElasticity, Stress-strain relationship, Hooke’s law, Young’s modulus, bulk modulus, shear modulus of rigidity (qualitative idea only), Poisson’s ratio; elastic energy.\nChapter 10: Mechanical Properties of Fluids\nPressure due to a fluid column; Pascal’s law and its applications (hydraulic lift and hydraulic brakes), effect of gravity on fluid pressure.\nViscosity, Stokes’ law, terminal velocity, streamline and turbulent flow, critical velocity, Bernoulli’s theorem and its applications.\nSurface energy and surface tension, angle of contact, excess of pressure across a curved surface, application of surface tension ideas to drops, bubbles and capillary rise.\nChapter 11: Thermal Properties of Matter\nHeat, temperature,( recapitulation only) thermal expansion; thermal expansion of solids, liquids and gases, anomalous expansion of water; specific heat capacity; Cp, Cv – calorimetry; change of state – latent heat capacity.\nHeat transfer-conduction, convection and radiation (recapitulation only), thermal conductivity, qualitative ideas of Blackbody radiation, Wein’s displacement Law, Stefan’s law.\nUnit-VIII: Thermodynamics\nChapter 12: Thermodynamics\nThermal equilibrium and definition of temperature (zeroth law of thermodynamics), heat, work and internal energy. First law of thermodynamics, Second law of thermodynamics: gaseous state of matter, change of condition of gaseous state -isothermal, adiabatic, reversible, irreversible, and cyclic processes.\nUnit-IX: Behaviour of Perfect Gases and Kinetic Theory of Gases\nChapter 13: Kinetic Theory\nEquation of state of a perfect gas, work done in compressing a gas.\nKinetic theory of gases – assumptions, concept of pressure. Kinetic interpretation of temperature; rms speed of gas molecules; degrees of freedom, law of equi-partition of energy (statement only) and application to specific heat capacities of gases; concept of mean free path, Avogadro’s number.\nUnit-X: Oscillations and Waves\nChapter 14: Oscillations\nPeriodic motion – time period, frequency, displacement as a function of time, periodic functions and their application.\nSimple harmonic motion (S.H.M) and its equations of motion; phase; oscillations of a loaded spring- restoring force and force constant; energy in S.H.M. Kinetic and potential energies; simple pendulum derivation of expression for its time period.\nChapter 15: Waves\nWave motion: Transverse and longitudinal waves, speed of travelling wave, displacement relation for a progressive wave, principle of superposition of waves, reflection of waves, standing waves in strings and organ pipes, fundamental mode and harmonics, Beats.\nStudents can also access the syllabus for other subjects by visiting Syllabus page ofCBSE Class 11.\nCBSE Syllabus for Class 11 Physics Practical 2023-24\nBelow are the list of the experiments of Physics practicals.\nEvaluation Scheme for Class 11 Physics Practical 2023-24\nTopicMarksTwo experiments, one from each section7 + 7Practical record (experiment and activities)5One activity from any section3Investigatory Project3Viva on experiments, activities and project5Total30\nTopicMarks\nTopic\nMarks\nTwo experiments, one from each section7 + 7\nTwo experiments, one from each section\n7 + 7\nPractical record (experiment and activities)5\nPractical record (experiment and activities)\nOne activity from any section3\nOne activity from any section\nInvestigatory Project3\nInvestigatory Project\nViva on experiments, activities and project5\nViva on experiments, activities and project\nTotal30\nTotal\nCBSE Class 11 Physics Practical Syllabus\nSection – A\nCBSE 11 Physics Syllabus Experiments\n1. To measure the diameter of a small spherical/cylindrical body and to measure internal diameter and depth of a given beaker/calorimeter using Vernier Callipers and hence find its volume.2. To measure the diameter of a given wire and thickness of a given sheet using screw gauge.3. To determine the volume of an irregular lamina using the screw gauge.4. To determine the radius of curvature of a given spherical surface by a spherometer.5. To determine the mass of two different objects using a beam balance.6. To find the weight of a given body using parallelogram law of vectors.7. Using a simple pendulum, plot its L-T2graph and use it to find the effective length of second’s pendulum.8. To study variation of time period of a simple pendulum of a given length by taking bobs of same size but different masses and interpret the result.9. To study the relationship between force of limiting friction and normal reaction and to find the co- efficient of friction between a block and a horizontal surface.10. To find the downward force, along an inclined plane, acting on a roller due to gravitational pull of the earth and study its relationship with the angle of inclination θ by plotting graph between force and sin θ.\nCBSE 11 Physics Syllabus Activities\n1. To make a paper scale of given least count, e.g., 0.2cm, 0.5 cm.2. To determine mass of a given body using a metre scale by principle of moments.3. To plot a graph for a given set of data, with proper choice of scales and error bars.4. To measure the force of limiting friction for rolling of a roller on a horizontal plane.5. To study the variation in range of a projectile with angle of projection.6. To study the conservation of energy of a ball rolling down on an inclined plane (using a double inclined plane).7. To study dissipation of energy of a simple pendulum by plotting a graph between square of amplitude and time.\nSection – B\nCBSE 11 Physics Syllabus Experiments\n1. To determine Young’s modulus of elasticity of the material of a given wire.2. To find the force constant of a helical spring by plotting a graph between load and extension.3. To study the variation in volume with pressure for a sample of air at constant temperature by plotting graphs between P and V, and between P and 1/V.4. To determine the surface tension of water by capillary rise method.5. To determine the coefficient of viscosity of a given viscous liquid by measuring terminal velocity of a given spherical body.6. To study the relationship between the temperature of a hot body and time by plotting a cooling curve.7. To determine specific heat capacity of a given solid by method of mixtures.8. To study the relation between frequency and length of a given wire under constant tension using sonometer.9. To study the relation between the length of a given wire and tension for constant frequency using sonometer.10. To find the speed of sound in air at room temperature using a resonance tube by two resonance positions.\nCBSE 11 Physics Syllabus Activities\n1. To observe change of state and plot a cooling curve for molten wax.2. To observe and explain the effect of heating on a bi-metallic strip.3. To note the change in level of liquid in a container on heating and interpret the observations.4. To study the effect of detergent on surface tension of water by observing capillary rise.5. To study the factors affecting the rate of loss of heat of a liquid.6. To study the effect of load on depression of a suitably clamped metre scale loaded at (i) its end (ii) in the middle.7. To observe the decrease in pressure with increase in velocity of a fluid.\nPractical Examination for Visually Impaired Students of Class 11 Evaluation Scheme\nTime:2 HoursMax. Marks:30\nTopicMarksIdentification/Familiarity with the apparatus5Written test (based on given/prescribed practicals)10Practical Record5Viva10Total30\nTopicMarks\nTopic\nMarks\nIdentification/Familiarity with the apparatus5\nIdentification/Familiarity with the apparatus\nWritten test (based on given/prescribed practicals)10\nWritten test (based on given/prescribed practicals)\nPractical Record5\nPractical Record\nViva10\nViva\nTotal30\nTotal\nA. Items for Identification/Familiarity of the apparatus for assessment inpracticals (All experiments).\nSpherical ball, Cylindrical objects, vernier calipers, beaker, calorimeter, Screw gauge, wire, Beam balance, spring balance, weight box, gram and milligram weights, forcep, Parallelogram law of vectors apparatus, pulleys and pans used in the same ‘weights’ used, Bob and string used in a simple pendulum, meter scale, split cork, suspension arrangement, stop clock/stop watch, Helical spring, suspension arrangement used, weights, arrangement used for measuring extension, Sonometer, Wedges, pan and pulley used in it, ‘weights’ Tuning Fork, Meter scale, Beam balance, Weight box, gram andmilligram weights, forceps, Resonance Tube, Tuning Fork, Meter scale, Flask/Beaker used for adding water.\nB. List of Practicals\n1. To measure diameter of a small spherical/cylindrical body using vernier calipers.2. To measure the internal diameter and depth of a given beaker/calorimeter using vernier calipers and hence find its volume.3. To measure diameter of given wire using screw gauge.4. To measure thickness of a given sheet using screw gauge.5. To determine the mass of a given object using a beam balance.6. To find the weight of given body using the parallelogram law of vectors.7. Using a simple pendulum plot L-T and L-T2 graphs. Hence find the effective length of second’s pendulum using appropriate length values.8. To find the force constant of given helical spring by plotting a graph between load and extension.9. (i) To study the relation between frequency and length of a given wire under constant tension using a sonometer.(ii) To study the relation between the length of a given wire and tension, forconstant frequency, using a sonometer.10. To find the speed of sound in air, at room temperature, using a resonance tube, by observing the two resonance positions.\nNote: The above practicals of CBSE 11 Physics Syllabus may be carried out in an experiential manner rather than recording observations.\nFrequently Asked Questions on CBSE Class 11 Physics Syllabus 2023-24\nAccording to the CBSE Class 11 Physics Syllabus 2023-24, which are the units of high marks weightage?\nHow is the practical syllabus of the CBSE Class 11 Physics divided into sections A and B?\nWhich are the basic concepts present in the CBSE Syllabus for Class 11 Physics?",
  "pdf_content": "=== PDF: class_11_physics_1.pdf ===\n--- Page 1 ---\n PHYSICS (Code No. 042) \n COURSE STRUCTURE \n Class XI – 2023-24 (Theory) \n Time: 3 hrs. \n Max Marks: 70 \n No. of \n Periods \n Marks \n Unit–I \n Physical World and Measurement \n 08 \n 23 \n Chapter–2: Units and Measurements \n Unit-II \n Kinematics \n 24 \n Chapter–3: Motion in a Straight Line \n Chapter–4: Motion in a Plane \n Unit–III \n Laws of Motion \n 14 \n Chapter–5: Laws of Motion \n Unit–IV \n Work, Energy and Power \n 14 \n 17 \n Chapter–6: Work, Energy and Power \n Unit–V \n Motion of System of Particles and Rigid \n Body \n 18 \n Chapter–7: System of Particles and \n Rotational Motion \n Unit-VI \n Gravitation \n 12 \n Chapter–8: Gravitation \n Unit–VII  Properties of Bulk Matter \n 24 \n 20 \n Chapter–9: Mechanical Properties of Solids \n Chapter–10: Mechanical Properties of Fluids \n Chapter–11: Thermal Properties of Matter \n Unit–VIII  Thermodynamics \n 12 \n Chapter–12: Thermodynamics \n Unit–IX \n Behaviour of Perfect Gases and Kinetic \n Theory of Gases \n 08 \n Chapter–13: Kinetic Theory \n Unit–X \n Oscillations and Waves \n 26 \n 10 \n Chapter–14: Oscillations \n Chapter–15: Waves \n Total \n 160 \n 70 \nCBSE Class 11 Physics Syllabus 2023-24\n\n\n--- Page 2 ---\n Unit I: \n Physical World and Measurement\n08 Periods \n Chapter–2: Units and Measurements \n Need  for  measurement:  Units  of  measurement;  systems  of  units;  SI  units, \n fundamental  and  derived  units.  significant  figures.  Dimensions  of  physical \n quantities, dimensional analysis and its applications. \n Unit II: \n Kinematics \n 24 Periods \n Chapter–3: Motion in a Straight Line \n Frame  of  reference,  Motion  in  a  straight  line,  Elementary  concepts  of \n differentiation  and  integration  for  describing  motion,  uniform  and  non- \n uniform  motion,  and  instantaneous  velocity,  uniformly  accelerated  motion, \n velocity  -  time  and  position-time  graphs.  Relations  for  uniformly  accelerated \n motion (graphical treatment). \n Chapter–4: Motion in a Plane \n Scalar  and  vector  quantities;  position  and  displacement  vectors,  general \n vectors  and  their  notations;  equality  of  vectors,  multiplication  of  vectors  by  a \n real  number;  addition  and  subtraction  of  vectors,  Unit  vector;  resolution  of  a \n vector  in  a  plane,  rectangular  components,  Scalar  and  Vector  product  of \n vectors. \n Motion  in  a  plane,  cases  of  uniform  velocity  and  uniform  acceleration- \n projectile motion, uniform circular motion. \n Unit III:  Laws of Motion \n 14 Periods \n Chapter–5: Laws of Motion \n Intuitive  concept  of  force,  Inertia,  Newton's  first  law  of  motion;  momentum \n and Newton's second law of motion; impulse; Newton's third law of motion. \n Law of conservation of linear momentum and its applications. \n\n\n--- Page 3 ---\n Equilibrium of concurrent forces, Static and kinetic friction, laws of friction, rolling \n friction, lubrication. \n Dynamics of uniform circular motion: Centripetal force, examples of circular \n motion (vehicle on a level circular road, vehicle on a banked road). \n Unit IV: \n Work, Energy and Power \n 14 Periods \n Chapter–6: Work, Energy and Power \n Work  done  by  a  constant  force  and  a  variable  force;  kinetic  energy,  work- \n energy theorem, power. \n Notion  of  potential  energy,  potential  energy  of  a  spring,  conservative  forces: \n non-conservative  forces,  motion  in  a  vertical  circle;  elastic  and  inelastic \n collisions in one and two dimensions. \n Unit V: \n Motion of System of Particles and Rigid Body\n18 Periods \n Chapter–7: System of Particles and Rotational Motion \n Centre of mass of a two-particle system, momentum conservation and \n Centre of mass motion. Centre of mass of a rigid body; centre of mass of a \n uniform rod. \n Moment of a force, torque, angular momentum, law of conservation \n of angular momentum and its applications. \n Equilibrium of rigid bodies, rigid body rotation and equations of rotational \n motion, comparison of linear and rotational motions. \n Moment of inertia, radius of gyration, values of moments of inertia for simple \n geometrical objects (no derivation). \n Unit VI:  Gravitation \n 12 Periods \n Chapter–8: Gravitation \n Kepler's laws of planetary motion, universal law of gravitation. \n Acceleration due to gravity and its variation with altitude and depth. \n Gravitational potential energy and gravitational potential, escape speed, \n\n\n--- Page 4 ---\n orbital velocity of a satellite. \n Unit VII:  Properties of Bulk Matter\n24 Periods \n Chapter–9: Mechanical Properties of Solids \n Elasticity,  Stress-strain  relationship,  Hooke's  law,  Young’s  modulus,  bulk \n modulus,  shear  modulus  of  rigidity  (qualitative  idea  only),  Poisson's \n ratio; elastic energy. \n Chapter–10: Mechanical Properties of Fluids \n Pressure  due  to  a  fluid  column;  Pascal's  law  and  its  applications  (hydraulic \n lift and hydraulic brakes), effect of gravity on fluid pressure. \n Viscosity,  Stokes'  law,  terminal  velocity,  streamline  and  turbulent  flow,  critical \n velocity, Bernoulli's theorem and its simple applications. \n Surface  energy  and  surface  tension,  angle  of  contact,  excess  of  pressure \n across  a  curved  surface,  application  of  surface  tension  ideas  to  drops, \n bubbles and capillary rise. \n Chapter–11: Thermal Properties of Matter \n Heat,  temperature,  thermal  expansion;  thermal  expansion  of  solids,  liquids \n and  gases,  anomalous  expansion  of  water;  specific  heat  capacity;  Cp,  Cv  - \n calorimetry; change of state - latent heat capacity. \n Heat  transfer-conduction,  convection  and  radiation,  thermal  conductivity, \n qualitative  ideas  of  Blackbody  radiation,  Wein's  displacement  Law,  Stefan's \n law . \n Unit VIII: Thermodynamics \n 12 Periods \n Chapter–12: Thermodynamics \n Thermal \n equilibrium  and  definition  of  temperature,  zeroth  law  of \n thermodynamics, \n heat, \n work \n and \n internal \n energy. \n First \n law \n of \n thermodynamics, \n Second law of thermodynamics: gaseous state of matter, change of condition \n\n\n--- Page 5 ---\n of  gaseous  state  -isothermal,  adiabatic,  reversible,  irreversible,  and  cyclic \n processes. \n Unit IX:Behavior of Perfect Gases and Kinetic Theory of Gases          08 Periods \n Chapter–13: Kinetic Theory \n Equation of state of a perfect gas, work done in compressing a gas. \n Kinetic  theory  of  gases  -  assumptions,  concept  of  pressure.  Kinetic \n interpretation  of  temperature;  rms  speed  of  gas  molecules;  degrees  of \n freedom,  law  of  equi-partition  of  energy  (statement  only)  and  application  to \n specific  heat  capacities  of  gases;  concept  of  mean  free  path,  Avogadro's \n number. \n Unit X: \n Oscillations and Waves \n 26 Periods \n Chapter–14: Oscillations \n Periodic motion - time period, frequency, displacement as a function of time, \n periodic functions and their applications. \n Simple harmonic motion (S.H.M) and its equations of motion; phase; oscillations \n of a loaded spring- restoring force and force constant; energy in S.H.M. \n Kinetic and potential energies; simple pendulum derivation of expression for its \n time period. \n Chapter–15: Waves \n Wave  motion:  Transverse  and  longitudinal  waves,  speed  of  travelling  wave, \n displacement  relation  for  a  progressive  wave,  principle  of  superposition  of \n waves,  reflection  of  waves,  standing  waves  in  strings  and  organ  pipes, \n fundamental mode and harmonics, Beats. \n\n\n--- Page 6 ---\n PRACTICALS \n Total Periods: 60 \n The record, to be submitted by the students, at the time of their annual examination, \n has to include: \n •\n Record of at least 8 Experiments [with 4 from each section], to be performed\n by the students.\n •\n Record of at least 6 Activities [with 3 each from section A and section B], to\n be performed by the students.\n •\n Report of the project carried out by the students.\n EVALUATION SCHEME \n Time 3 hours \n Max. Marks: 30 \n Topic \n Marks \n Two experiments one from each section \n 7+7 \n Practical record (experiment and activities) \n 5 \n One activity from any section \n 3 \n Investigatory Project \n 3 \n Viva on experiments, activities and project \n 5 \n Total \n 30 \n SECTION–A \n Experiments \n 1.  To  measure  diameter  of  a  small  spherical/cylindrical  body  and  to  measure  internal\n diameter  and  depth  of  a  given  beaker/calorimeter  using  Vernier  Callipers  and\n hence find its volume.\n 2.  To  measure  diameter  of  a  given  wire  and  thickness  of  a  given  sheet  using  screw\n gauge.\n\n\n--- Page 7 ---\n 3.  To determine volume of an irregular lamina using screw gauge.\n 4.  To determine radius of curvature of a given spherical surface by a spherometer.\n 5.  To determine the mass of two different objects using a beam balance.\n 6.  To find the weight of a given body using parallelogram law of vectors.\n 7.  Using  a  simple  pendulum,  plot  its  L-T  2  graph  and  use  it  to  find  the  effective  length\n of second's pendulum.\n 8.  To  study  variation  of  time  period  of  a  simple  pendulum  of  a  given  length  by  taking\n bobs of same size but different masses and interpret the result.\n 9.  To  study  the  relationship  between  force  of  limiting  friction  and  normal  reaction  and\n to find the co- efficient of friction between a block and a horizontal surface.\n 10.  To  find  the  downward  force,  along  an  inclined  plane,  acting  on  a  roller  due  to\n gravitational  pull  of  the  earth  and  study  its  relationship  with  the  angle  of  inclination\n θ by plotting graph between force and Sinθ.\n Activities \n 1.  To make a paper scale of given least count, e.g., 0.2cm, 0.5 cm.\n 2.  To determine mass of a given body using a metre scale by principle of moments.\n 3.  To plot a graph for a given set of data, with proper choice of scales and error bars.\n 4.  To measure the force of limiting friction for rolling of a roller on a horizontal plane.\n 5.  To study the variation in range of a projectile with angle of projection.\n 6.  To  study  the  conservation  of  energy  of  a  ball  rolling  down  on  an  inclined  plane\n (using a double inclined plane).\n 7.  To  study  dissipation  of  energy  of  a  simple  pendulum  by  plotting  a  graph  between\n square of amplitude and time.\n\n\n--- Page 8 ---\n SECTION–B \n Experiments \n 1.  To determine Young's modulus of elasticity of the material of a given wire.\n 2.  To find the force constant of a helical spring by plotting a graph between load and\n extension.\n 3.  To study the variation in volume with pressure for a sample of air at constant\n temperature by plotting graphs between P and V, and between P and 1/V.\n 4.  To determine the surface tension of water by capillary rise method.\n 5.  To determine the coefficient of viscosity of a given viscous liquid by measuring\n terminal velocity of a given spherical body.\n 6.  To study the relationship between the temperature of a hot body and time by\n plotting a cooling curve.\n 7.  To determine specific heat capacity of a given solid by method of mixtures.\n 8.  To study the relation between frequency and length of a given wire under constant\n tension using sonometer.\n 9.  To study the relation between the length of a given wire and tension for constant\n frequency using sonometer.\n 10.  To find the speed of sound in air at room temperature using a resonance tube by\n two resonance positions.\n Activities \n 1.  To observe change of state and plot a cooling curve for molten wax.\n 2.  To observe and explain the effect of heating on a bi-metallic strip.\n 3.  To note the change in level of liquid in a container on heating and interpret the\n observations.\n 4.  To study the effect of detergent on surface tension of water by observing capillary\n rise.\n 5.  To study the factors affecting the rate of loss of heat of a liquid.\n 6.  To study the effect of load on depression of a suitably clamped metre scale loaded\n at (i) its end (ii) in the middle.\n 7.  To observe the decrease in pressure with increase in velocity of a fluid.\n\n\n--- Page 9 ---\n Practical Examination for Visually Impaired \n Students Class XI \n Note:  Same Evaluation scheme and general guidelines  for visually impaired students as \n given for Class XII may be followed. \n A.\n Items for Identification/Familiarity of the apparatus for assessment in\n practical’s (All experiments)\n Spherical  ball,  Cylindrical  objects,  vernier  calipers,  beaker,  calorimeter,  Screw\n gauge,  wire,  Beam  balance,  spring  balance,  weight  box,  gram  and  milligram\n weights,  forceps,  Parallelogram  law  of  vectors  apparatus,  pulleys  and  pans  used  in\n the  same  ‘weights’  used,  Bob  and  string  used  in  a  simple  pendulum,  meter  scale,\n split  cork,  suspension  arrangement,  stop  clock/stop  watch,  Helical  spring,\n suspension  arrangement  used,  weights,  arrangement  used  for  measuring\n extension,  Sonometer,  Wedges,  pan  and  pulley  used  in  it,  ‘weights’  Tuning  Fork,\n Meter  scale,  Beam  balance,  Weight  box,  gram  and  milligram  weights,  forceps,\n Resonance Tube, Tuning Fork, Meter scale, Flask/Beaker used for adding water.\n B.\n List of Practicals\n 1.\n To measure diameter of a small spherical/cylindrical body using vernier calipers.\n 2.\n To measure the internal diameter and depth of a given beaker/calorimeter\n using vernier calipers and hence find its volume.\n 3.\n To measure diameter of given wire using screw gauge.\n 4.\n To measure thickness of a given sheet using screw gauge.\n 5.\n To determine the mass of a given object using a beam balance.\n 6.\n To find the weight of given body using the parallelogram law of vectors.\n 7.\n Using a simple pendulum plot L-T and L-T  2  graphs.  Hence find the\n effective length of second’s pendulum using appropriate length values.\n 8.\n To find the force constant of given helical spring by plotting a graph between\n load and extension.\n 9.\n (i) To study the relation between frequency and length of a given wire\n under constant tension using a sonometer.\n\n\n--- Page 10 ---\n (ii) To study the relation between the length of a given wire and tension, for\n constant frequency, using a sonometer.\n 10.  To find the speed of sound in air, at room temperature, using a resonance\n tube, by observing the two resonance positions.\n Note:  The above practicals may be carried out in an  experiential manner rather than \n recording observations. \n Prescribed Books: \n 1.  Physics Part-I, Textbook for Class XI, Published by NCERT\n 2.  Physics Part-II, Textbook for Class XI, Published by NCERT\n 3.  Laboratory Manual of Physics, Class XI Published by NCERT\n 4.  The list of other related books and manuals brought out by\n NCERT (consider multimedia also).\n Note: \n The content indicated in NCERT textbooks as excluded for the year 2023-24 is not to \n be tested by schools. \n\n\n--- Page 11 ---\n Practical Examination for Visually Impaired Students of \n Classes XI and XII Evaluation Scheme \n Time 2 hours \n Max. Marks: 30 \n Identification/Familiarity with the apparatus \n 5 marks \n Written test (based on given/prescribed practicals) \n 10 marks \n Practical Record \n 5 marks \n Viva \n 10 marks \n Total \n 30 marks \n General Guidelines \n The practical examination will be of two-hour duration. \n A separate list of ten experiments is included here. \n The written examination in practicals for these students will be conducted at the time \n of practical examination of all other students. \n The written test will be of 30 minutes duration. \n The  question  paper  given  to  the  students  should  be  legibly  typed.  It  should  contain \n a  total  of  15  practical  skill  based  very  short  answer  type  questions.  A  student  would \n be required to answer any 10 questions. \n A writer may be allowed to such students as per CBSE examination rules. \n All  questions  included  in  the  question  papers  should  be  related  to  the  listed  practicals. \n Every question should require about two minutes to be answered. \n These  students  are  also  required  to  maintain  a  practical  file.  A  student  is  expected  to \n record  at  least  five  of  the  listed  experiments  as  per  the  specific  instructions  for  each \n subject.  These  practicals  should  be  duly  checked  and  signed  by  the  internal \n examiner. \n The  format  of  writing  any  experiment  in  the  practical  file  should  include  aim, \n apparatus  required,  simple  theory,  procedure,  related  practical  skills,  precautions \n etc. \n Questions  may  be  generated  jointly  by  the  external/internal  examiners  and  used  for \n assessment. \n The  viva  questions  may  include  questions  based  on  basic  theory/principle/concept, \n apparatus/  materials/chemicals  required,  procedure,  precautions,  sources  of  error \n etc. \n\n\n--- Page 12 ---\n QUESTION PAPER DESIGN \n Theory (Class: XI/XII) \n Maximum Marks: 70 \n Duration: 3 hrs. \n S No. \n Typology of Questions \n Total \n Marks \n Approximate \n Percentage \n 1 \n Remembering :  Exhibit  memory  of  previously  learned \n material  by  recalling  facts,  terms,  basic  concepts,  and \n answers. \n Understanding : Demonstrate understanding of facts  and \n ideas  by  organizing,  comparing,  translating,  interpreting, \n giving descriptions, and stating main ideas \n 27 \n 38 % \n 2 \n Applying : Solve problems to new situations by applying \n acquired knowledge, facts, techniques and rules in a \n different way. \n 22 \n 32% \n 3 \n Analysing  :  Examine  and  break  information  into  parts  by \n identifying  motives  or  causes.  Make  inferences  and  find \n evidence to support generalizations \n Evaluating: \n Present  and  defend  opinions  by  making  judgments  about \n information,  validity  of  ideas,  or  quality  of  work  based  on \n a set of criteria. \n Creating : \n Compile  information  together  in  a  different  way  by \n combining elements in a new pattern or proposing \n alternative solutions. \n 21 \n 30% \n Total Marks  70 \n 100 \n Practical  30 \n Gross Total  100 \n Note: \n The  above  template  is  only  a  sample.  Suitable  internal  variations  may  be  made  for \n generating  similar  templates  keeping  the  overall  weightage  to  different  form  of  questions \n and typology of questions same . \n For  more  details  kindly  refer  to  Sample  Question  Paper  of  class  XII  for  the  year \n 2023- 24 to be published by CBSE at its website. \n",
  "pdf_urls": [
    "https://cdn1.byjus.com/wp-content/uploads/2023/04/CBSE-Syllabus-for-Class-11-Physics-2023-24.pdf"
  ],
  "extracted_at": "2026-01-29T11:04:33.326097",
  "pdf_local_files": [
    "syllabus/pdfs/class_11_physics_1.pdf"
  ],
  "pdf_parsed_at": "2026-01-30T13:29:25.890238"
}