{
  "url": "https://byjus.com/cbse/cbse-class-10-syllabus/",
  "title": "",
  "description": "",
  "units": [],
  "chapters": [],
  "topics": [
    "It gives the students an overview of the topics they are going to study in the academic session.",
    "It works as a guide for the students of Class 10 while preparing for their Board exams.",
    "The syllabus of Class 10 CBSE is structured in such a way that it provides information from basic to complex topics effectively.",
    "It helps students to comprehend which topics they need to concentrate.",
    "It helps students to prepare confidently for their Class 10 Board exams.",
    "It helps students to explore their inner potential and enhance self-awareness.",
    "Inculcate moral values and foster learning in students.",
    "Provide students with the knowledge of technology so that they can use it for the betterment of society.",
    "Develop the ability to showcase talents.",
    "It promotes physical fitness, health and arts-integrated learning."
  ],
  "marking_scheme": [],
  "raw_content": "CBSE Syllabus for Class 10for the 2023-24 academic year has been released by the board. The CBSE Class 10 Syllabus is a valuable resource for students preparing for board exams. It includes the course structure, distribution of unit marks and number of periods allocated for each unit. Along with this, the CBSE Syllabus for Class 10 also provides information about reference books, projects, assignments and practicals. A thorough understanding of the CBSE Syllabus for Class 10 will help students plan their studies better. Here, we have provided the links to all major subjects of the CBSE Class 10 Syllabus PDF. Covering theCBSE syllabusfor students of Class 9 will help them enhance their academic knowledge for better learning outcomes.\nStudents ofCBSE Class 10should go through the syllabus of each subject before diving into exam preparation. Through the CBSE board syllabus for Class 10, students will get to know the topics and concepts to be covered in each subject. Also, the board exam question paper is prepared as per the CBSE 10th syllabus.\nCBSE Class 10 Syllabus for all Subjects 2023-24 – Download Syllabus\nStudents must study as per the CBSE Class 10 Syllabus guidelines. To access the CBSE Class 10 Syllabus of all subjects, click on the links below. Apart from the CBSE board syllabus for Class 10 of the theory subject, students will also find the practical Syllabus for CBSE Class 10.\nCBSE Syllabus for Class 10 MathsCBSE Syllabus for Class 10 ScienceCBSE Syllabus for Class 10 Social ScienceCBSE Syllabus for Class 10 EnglishCBSE Syllabus for Class 10 Hindi ACBSE Syllabus for Class 10 Hindi BCBSE Syllabus for Class 10 Information Technology\nCBSE Syllabus for Class 10 Maths\nCBSE Syllabus for Class 10 Maths\nCBSE Syllabus for Class 10 Science\nCBSE Syllabus for Class 10 Science\nCBSE Syllabus for Class 10 Social Science\nCBSE Syllabus for Class 10 Social Science\nCBSE Syllabus for Class 10 English\nCBSE Syllabus for Class 10 English\nCBSE Syllabus for Class 10 Hindi A\nCBSE Syllabus for Class 10 Hindi A\nCBSE Syllabus for Class 10 Hindi B\nCBSE Syllabus for Class 10 Hindi B\nCBSE Syllabus for Class 10 Information Technology\nCBSE Syllabus for Class 10 Information Technology\nClass 10 is considered the turning point in every student’s life. The result of Class 10 will decide the stream students take up for higher studies. At the time of the revision, CBSE Syllabus for Class 10 is very helpful. It helps students track their progress on topics they have studied and what they need to cover yet. In class 10, practicals are equally as important as the theory. Students can get the complete list of science practicals, activities and project work through theCBSE Class 10 Science Practicals.\nCBSE Class 10 Scheme of Studies\nThe table below shows the scheme of studies for Class 10 students. There are 5 compulsory subjects, 2 optional subjects and 2 subjects for internal assessment.\nTypeSubject NameCompulsory SubjectsLanguage 1Language 2ScienceMathematicsSocial ScienceOptionalSkill SubjectLanguage 3 / Any Academic subject other than those opted for aboveSubjects of Internal AssessmentArt EducationHealth and Physical Education\nTypeSubject Name\nType\nSubject Name\nCompulsory SubjectsLanguage 1\nCompulsory Subjects\nLanguage 1\nLanguage 2\nLanguage 2\nScience\nScience\nMathematics\nMathematics\nSocial Science\nSocial Science\nOptionalSkill Subject\nOptional\nSkill Subject\nLanguage 3 / Any Academic subject other than those opted for above\nLanguage 3 / Any Academic subject other than those opted for above\nSubjects of Internal AssessmentArt Education\nSubjects of Internal Assessment\nArt Education\nHealth and Physical Education\nHealth and Physical Education\nStudents will find the downloadable PDF of the CBSE 10th Syllabus along with the marks weightage for each subject. They are advised to prepare for the board exam as per the prescribed syllabus.\nBenefits of Knowing the Class 10 CBSE Board Syllabus\nThe benefits of knowing the CBSE Class 10 Syllabus are listed below.\nIt gives the students an overview of the topics they are going to study in the academic session.\nIt works as a guide for the students of Class 10 while preparing for their Board exams.\nThe syllabus of Class 10 CBSE is structured in such a way that it provides information from basic to complex topics effectively.\nIt helps students to comprehend which topics they need to concentrate.\nIt helps students to prepare confidently for their Class 10 Board exams.\nObjectives of CBSE 10th Class Syllabus\nThe CBSE 10th Syllabus is designed with the aim of developing the following skills among the students:\nIt helps students to explore their inner potential and enhance self-awareness.\nInculcate moral values and foster learning in students.\nProvide students with the knowledge of technology so that they can use it for the betterment of society.\nDevelop the ability to showcase talents.\nIt promotes physical fitness, health and arts-integrated learning.\nLearn Maths and Science in an interactive and fun-loving way with BYJU’S App/Tablet.Frequently Asked Questions on CBSE Class 10 Syllabus 2023-24Q1Where can I find the CBSE Class 10 Syllabus of all the subjects for free?Students can find the CBSE Class 10 Syllabus of all the subjects for free at BYJU’S. The experts design it in a precise form so that students can use it to understand the syllabus for the year 2023-24 in a better way.Q2Why should I rely on the CBSE Class 10 Syllabus?The CBSE Class 10 Syllabus is available for all the subjects in both online and offline form, which can be used by the students to score better academic marks.Q3What are the scoring subjects according to the CBSE Syllabus of Class 10?The scoring subjects according to the CBSE Syllabus of Class 10 are Maths, Science and Social Science.\nFrequently Asked Questions on CBSE Class 10 Syllabus 2023-24\nWhere can I find the CBSE Class 10 Syllabus of all the subjects for free?\nWhy should I rely on the CBSE Class 10 Syllabus?\nWhat are the scoring subjects according to the CBSE Syllabus of Class 10?",
  "pdf_content": "",
  "pdf_urls": [],
  "extracted_at": "2026-01-29T10:59:37.396943"
}