{
  "url": "https://byjus.com/cbse/cbse-class-10-science-syllabus/",
  "title": "",
  "description": "",
  "units": [
    {
      "headers": [
        "Units",
        "Unit Names",
        "Sections"
      ],
      "rows": [
        [
          "I",
          "Chemical Substances – Nature and Behaviour",
          "Chemical ReactionsAcids, Bases and SaltsMetals and Non-metalsCarbon Compounds"
        ],
        [
          "II",
          "World of Living",
          "Life ProcessesControl and Co-ordination in Animals and PlantsReproductionHeredity and Evolution"
        ],
        [
          "III",
          "Natural Phenomena",
          "Reflection of Light by Curved SurfacesRefractionRefraction of Light by Spherical LensRefraction of Light Through a Prism"
        ],
        [
          "IV",
          "Effects of Current",
          "Electric Current, Potential Difference and Electric CurrentMagnetic Effects of Current"
        ],
        [
          "V",
          "Natural Resources",
          "Our Environment"
        ]
      ]
    }
  ],
  "chapters": [],
  "topics": [
    "Periodic Assessment – 5 marks + 5 marks",
    "Subject Enrichment (Practical Work) – 05 marks",
    "Portfolio – 05 marks",
    "Litmus solution (Blue/Red)",
    "Zinc metal",
    "Solid sodium carbonate",
    "ZnSO4(aq)",
    "FeSO4(aq)",
    "CuSO4(aq)",
    "Al2(SO4)3(aq)"
  ],
  "marking_scheme": [
    {
      "headers": [
        "Units",
        "Topics",
        "Marks"
      ],
      "rows": [
        [
          "I",
          "Chemical Substances – Nature and Behaviour",
          "25"
        ],
        [
          "II",
          "World of Living",
          "25"
        ],
        [
          "III",
          "Natural Phenomena",
          "12"
        ],
        [
          "IV",
          "Effects of Current",
          "13"
        ],
        [
          "V",
          "Natural Resources",
          "05"
        ],
        [
          "",
          "Total",
          "80"
        ],
        [
          "",
          "Internal Assessment",
          "20"
        ],
        [
          "",
          "Grand Total",
          "100"
        ]
      ]
    }
  ],
  "raw_content": "CBSE Syllabus for Class 10 Sciencefor the academic year 2023-24 has been released by the CBSE Board. Class 10 is one of the most challenging years of a student’s life as they will be appearing for their first board exams. CBSE 10th Science syllabus for the academic year 2023-24 is compiled following the guidelines laid down by the Board. There are not many changes in the CBSE Class 10 Science syllabus for the academic year 2023-24 when compared with the 2022-23 syllabus. Therefore, download the direct link to the CBSE syllabus for Class 10 Science provided in this article. The annual exams will be conducted in accordance with the CBSE Science syllabus.\nStudents should go through the CBSE Class 10 Science Syllabus to learn about units, topics and marks allotted for each unit for better exam preparation. TheCBSE Syllabusalso includes details about practicals, assignments and projects so that students can understand the concept they are learning effectively. CBSE syllabus for Class 10 Science is designed in such a way that it helps students to plan their study plan according to the board exams. Students can download and follow CBSE Class 10 Science syllabus PDF to learn and prepare for the exams in a systematic way.\nCBSE Class 10 Science Syllabus 2023-24\nCBSE Syllabus for Class 10 Science is available for download in PDF for the 2023-24 academic year. The Board has released the Class 10 Science Syllabus and restored the original year-end exam. Students can access the CBSE Class 10 Science Syllabus for 2023- 24 by clicking on the PDF link below.\nCBSE Class 10 Science Syllabus 2023-24 PDF\nDownload PDF\nCBSE 10th Science Syllabus 2023-24\nBelow you will find the unit-wise Science syllabus for Class 10 students.\nUnitsUnit NamesSectionsIChemical Substances – Nature and BehaviourChemical ReactionsAcids, Bases and SaltsMetals and Non-metalsCarbon CompoundsIIWorld of LivingLife ProcessesControl and Co-ordination in Animals and PlantsReproductionHeredity and EvolutionIIINatural PhenomenaReflection of Light by Curved SurfacesRefractionRefraction of Light by Spherical LensRefraction of Light Through a PrismIVEffects of CurrentElectric Current, Potential Difference and Electric CurrentMagnetic Effects of CurrentVNatural ResourcesOur Environment\nUnitsUnit NamesSections\nUnits\nUnit Names\nSections\nIChemical Substances – Nature and BehaviourChemical ReactionsAcids, Bases and SaltsMetals and Non-metalsCarbon Compounds\nChemical Substances – Nature and Behaviour\nChemical ReactionsAcids, Bases and SaltsMetals and Non-metalsCarbon Compounds\nAcids, Bases and Salts\nMetals and Non-metals\nCarbon Compounds\nIIWorld of LivingLife ProcessesControl and Co-ordination in Animals and PlantsReproductionHeredity and Evolution\nWorld of Living\nLife ProcessesControl and Co-ordination in Animals and PlantsReproductionHeredity and Evolution\nControl and Co-ordination in Animals and Plants\nReproduction\nHeredity and Evolution\nIIINatural PhenomenaReflection of Light by Curved SurfacesRefractionRefraction of Light by Spherical LensRefraction of Light Through a Prism\nIII\nNatural Phenomena\nReflection of Light by Curved SurfacesRefractionRefraction of Light by Spherical LensRefraction of Light Through a Prism\nRefraction\nRefraction of Light by Spherical Lens\nRefraction of Light Through a Prism\nIVEffects of CurrentElectric Current, Potential Difference and Electric CurrentMagnetic Effects of Current\nEffects of Current\nElectric Current, Potential Difference and Electric CurrentMagnetic Effects of Current\nMagnetic Effects of Current\nVNatural ResourcesOur Environment\nNatural Resources\nOur Environment\nCBSE Class 10 Science Syllabus: Course Structure 2023-24 With Marking Scheme\nAs students can see in the table below that the Class 10 CBSE Science Syllabus is divided into 5 units, with units 1 and 2 carrying the higher weightage among all.\nUnitsTopicsMarksIChemical Substances – Nature and Behaviour25IIWorld of Living25IIINatural Phenomena12IVEffects of Current13VNatural Resources05Total80Internal Assessment20Grand Total100\nUnitsTopicsMarks\nUnits\nTopics\nMarks\nIChemical Substances – Nature and Behaviour25\nChemical Substances – Nature and Behaviour\nIIWorld of Living25\nWorld of Living\nIIINatural Phenomena12\nIII\nNatural Phenomena\nIVEffects of Current13\nEffects of Current\nVNatural Resources05\nNatural Resources\nTotal80\nTotal\nInternal Assessment20\nInternal Assessment\nGrand Total100\nGrand Total\n100\nStudents can also check the syllabus for all the subjects of Class 10 by clicking onCBSE Syllabus for Class 10page.\nCBSE Class 10 Science Syllabus: Question Paper Design (Theory)\nMaximum Marks:80 Marks\nThe CBSE 10th Science Syllabus covers the following assessment areas.\nCompetenciesTotalDemonstrate Knowledge and Understanding46%Application of Knowledge/Concepts22%Analyze, Evaluate and Create32%Total100%\nCompetenciesTotal\nCompetencies\nTotal\nDemonstrate Knowledge and Understanding46%\nDemonstrate Knowledge and Understanding\n46%\nApplication of Knowledge/Concepts22%\nApplication of Knowledge/Concepts\n22%\nAnalyze, Evaluate and Create32%\nAnalyze, Evaluate and Create\n32%\nTotal100%\nTotal\n100%\nInternal Assessment (20 Marks)\nThe internal assessment for the CBSE 10th Science Syllabus consists of 20 marks.\nPeriodic Assessment – 5 marks + 5 marks\nSubject Enrichment (Practical Work) – 05 marks\nPortfolio – 05 marks\nTo get all the study material related to class 10, visit theCBSE Class 10page.\nClass 10 CBSE Science Syllabus for Practicals\nAs internal assessment consists of a total of 20 marks so, students should not ignore the importance of practicals. Along with the theory CBSE Syllabus for Class 10 Science, they should also focus on practicals as well. This will help them score high marks and understand the theoretical concepts by practically performing the experiments. So, here we have provided the CBSE Class 10 Science Practical syllabus for students. They can also download theCBSE Class 10 Science Practicals.\nList of Unit-wise Class 10 Science Experiments\nThe experiment list provides an idea of new Science projects a list of experiments and activities. So, students must go through this Practical CBSE Syllabus for Class 10 Science.\nCBSE Class 10 Science Practical Syllabus\nUnit I\n1. A. Finding the pH of the following samples by using pH paper/universal indicator(i) Dilute Hydrochloric Acid(ii) Dilute NaOH solution(iii) Dilute Ethanoic Acid solution(iv) Lemon juice(v) Water(vi) Dilute Hydrogen Carbonate solution\nB. Studying the properties of acids and bases (HCl & NaOH) on the basis of their reaction with:\nLitmus solution (Blue/Red)\nZinc metal\nSolid sodium carbonate\n2. Performing and observing the following reactions and classifying them into:\nA. Combination reactionB. Decomposition reactionC. Displacement reactionD. Double displacement reaction\ni) Action of water on quicklimeii) Action of heat on ferrous sulphate crystalsiii) Iron nails kept in copper sulphate solutioniv) Reaction between sodium sulphate and barium chloride solutions\n3. A. Observing the action of Zn, Fe, Cu and Al metals on the following salt solutions:\nZnSO4(aq)\nFeSO4(aq)\nCuSO4(aq)\nAl2(SO4)3(aq)\nB. Arranging Zn, Fe, Cu and Al (metals) in the decreasing order of reactivity based on the above result.\n4. Study of the following properties of acetic acid (ethanoic acid)\ni) Odourii) solubility in wateriii) effect on litmusiv) reaction with Sodium Hydrogen Carbonate\n5. Study of the comparative cleaning capacity of a sample of soap in soft and hard water.\nUnit II\n1. Preparing a temporary mount of a leaf peel to show stomata.\n2. Experimentally show that carbon dioxide is given out during respiration.\n3. Studying (a) binary fission in Amoeba and (b) budding in yeast and Hydra with the help of prepared slides.\n4. Identification of the different parts of an embryo of a dicot seed (Peas, gram or red kidney bean).\nUnit III\n1.  Determination of the focal length of:i) Concave mirrorii) Convex lensby obtaining the image of a distant object.\n2. Tracing the path of a ray of light passing through a rectangular glass slab for different angles of incidence. Measure the angle of incidence, angle of refraction, and angle of emergence and interpret the result.\n3. Tracing the path of the rays of light through a glass prism.\nUnit IV\n1. Studying the dependence of potential difference (V) across a resistor on the current (I) passing through it and determining its resistance. Also, plotting a graph between V and I.\n2. Determination of the equivalent resistance of two resistors when connected in series and parallel.\nFrequently Asked Questions on CBSE Syllabus for Class 10 Science 2023-24Q1How many units are there in the CBSE Class 10 Science Syllabus?There are 5 units in the CBSE Class 10 Science Syllabus, such as World of Living, Chemical Substances – Nature and Behaviour, Natural Phenomena, Natural Resources and Effects of Current.Q2What are the total marks allotted for the final exam according to the CBSE Class 10 Science Syllabus?The total marks allotted for the final exam according to the CBSE Class 10 Science Syllabus is 100, out of which 20 is for internals and 80 is for theory and practicals.Q3How many experiments are there in the CBSE Science Syllabus of Class 10?There are 14 experiments in the CBSE Science Syllabus of Class 10 that must be focused on by the students in order to score maximum marks in the exam.\nFrequently Asked Questions on CBSE Syllabus for Class 10 Science 2023-24\nHow many units are there in the CBSE Class 10 Science Syllabus?\nWhat are the total marks allotted for the final exam according to the CBSE Class 10 Science Syllabus?\nHow many experiments are there in the CBSE Science Syllabus of Class 10?",
  "pdf_content": "=== PDF: class_10_science_1.pdf ===\n--- Page 1 ---\nCBSE CLASS 10 Syllabus for Science 2023-24 \nMarks: 80 \nUnit \nNo. \nUnit \nMarks \nI \nChemical Substances-Nature and Behaviour \n25 \nII \nWorld of Living \n25 \nIII \nNatural Phenomena \n12 \nIV \nEffects of Current \n13 \nV \nNatural Resources \n05 \nTotal \n80 \nInternal assessment \n20 \nGrand Total \n100 \nTheme: Materials \nUnit I: Chemical Substances - Nature and Behaviour \nChemical reactions: Chemical equation, Balanced chemical equation, implications of a balanced \nchemical equation, types of chemical reactions: combination, decomposition, displacement, double \ndisplacement, precipitation, endothermic exothermic reactions, oxidation and reduction. \nAcids, bases and salts: Their definitions in terms of furnishing of H+ and OH– ions, General \nproperties, examples and uses, neutralization, concept of pH scale (Definition relating to logarithm \nnot required), importance of pH in everyday life; preparation and uses of Sodium Hydroxide, Bleaching \npowder, Baking soda, Washing soda and Plaster of Paris. \nMetals and nonmetals: Properties of metals and non-metals; Reactivity series; Formation and \nproperties of ionic compounds; Basic metallurgical processes; Corrosion and its prevention. \nCarbon compounds: Covalent bonding in carbon compounds. Versatile nature of carbon. \nHomologous series. Nomenclature of carbon compounds containing functional groups (halogens, \nalcohol, ketones, aldehydes, alkanes and alkynes), difference between saturated hydro carbons and \nunsaturated hydrocarbons. Chemical properties of carbon compounds (combustion, oxidation, \naddition and substitution reaction). Ethanol and Ethanoic acid (only properties and uses), soaps and \ndetergents. \nTheme: The World of the Living \nUnit II: World of Living \nLife processes: ‘Living Being’. Basic concept of nutrition, respiration, transport and excretion in plants \nand animals. \n\n\n--- Page 2 ---\nControl and co-ordination in animals and plants: Tropic movements in plants; Introduction of plant \nhormones; Control and co-ordination in animals: Nervous system; Voluntary, involuntary and reflex \naction; Chemical co-ordination: animal hormones. \nReproduction: Reproduction in animals and plants (asexual and sexual) reproductive health - need \nand methods of family planning. Safe sex vs HIV/AIDS. Child bearing and women’s health. \nHeredity and Evolution: Heredity; Mendel’s contribution- Laws for inheritance of traits: Sex \ndetermination: brief introduction: (topics excluded - evolution; evolution and classification and \nevolution should not be equated with progress). \nTheme: Natural Phenomena \nUnit III: Natural Phenomena \nReflection of light by curved surfaces; Images formed by spherical mirrors, centre of curvature, \nprincipal axis, principal focus, focal length, mirror formula (Derivation not required),magnification. \nRefraction; Laws of refraction, refractive index. \n \nRefraction of light by spherical lens; Image formed by spherical lenses; Lens formula(Derivation \nnot required); Magnification. Power of a lens. \nFunctioning of a lens in human eye, defects of vision and their corrections, applications of \nspherical mirrors and lenses. \nRefraction of light through a prism, dispersion of light, scattering of light, applications in dailylife \n(excluding colour of the sun at sunrise and sunset). \nTheme: How Things Work \nUnit IV: Effects of Current \nElectric current, potential difference and electric current. Ohm’s law; Resistance, Resistivity, Factors \non which the resistance of a conductor depends. Series combination of resistors, parallel \ncombination of resistors and its applications in daily life. Heating effect of electric current and its \napplications in daily life. Electric power, Interrelation between P, V, I and R. Magnetic effects of \ncurrent : Magnetic field, field lines, field due to a current carryingconductor, field due to current \ncarrying coil or solenoid; Force on current carrying conductor, Fleming’s Left Hand Rule, Direct \ncurrent. Alternating current: frequency of AC. Advantage of AC over DC. Domestic electric circuits. \nTheme: Natural Resources \nUnit V: Natural Resources \nOur environment: Eco-system, Environmental problems, Ozone depletion, waste production and \ntheir solutions. Biodegradable and non-biodegradable substances. \nNote for the Teachers: \n \n1. The chapter Management of Natural Resources (NCERT Chapter 16) will not be assessed \nin the year-end examination. However, learners may be assigned to read this chapter and \nencouraged to prepare a brief write up to any concept of this chapter in their Portfolio. This \n\n\n--- Page 3 ---\nmay be for Internal Assessment and credit may be given Periodic Assessment/Portfolio). \n \n2. The NCERT text books present information in boxes across the book. These help students \nto get conceptual clarity. However, the information in these boxes would not be assessed \nin the year-end examination. \nPRACTICALS \nPractical should be conducted alongside the concepts taught in theory classes. \n.LIST OF EXPERIMENTS \n1. \nA. Finding the pH of the following samples by using pH paper/universal indicator: \nUnit-I \n(i) \nDilute Hydrochloric Acid \n(ii) \nDilute NaOH solution \n(iii) \nDilute Ethanoic Acid solution \n(iv) \nLemon juice \n(v) \nWater \n(vi) \nDilute Hydrogen Carbonate solution \nB. Studying the properties of acids and bases (HCl & NaOH) on the basis of their reaction with: \n \nUnit-I \na) \nLitmus solution (Blue/Red) \nb) \nZinc metal \nc) \nSolid sodium carbonate \n2. \nPerforming and observing the following reactions and classifying them into: \nUnit-I \nA. \nCombination reaction \nB. \nDecomposition reaction \nC. \nDisplacement reaction \nD. \nDouble displacement reaction \n(i) Action of water on quicklime \n(ii) Action of heat on ferrous sulphate crystals \n(iii) Iron nails kept in copper sulphate solution \n(iv) Reaction between sodium sulphate and barium chloride solutions \n3. \nObserving the action of Zn, Fe, Cu and Al metals on the following salt solutions: \nUnit-I \ni) ZnSO4(aq) \nii) FeSO4(aq) \niii) CuSO4(aq) \niv) Al2 (SO4)3(aq) \nArranging Zn, Fe, Cu and Al (metals) in the decreasing order of reactivity based on the \nabove result. \n4. \nStudying the dependence of potential difference (V) across a resistor on the current (I) passing \nthrough it and determine its resistance. Also plotting a graph between V and I. \nUnit-IV \n5. \nDetermination of the equivalent resistance of two resistors when connected in series and \nparallel. \nUnit-IV \n6. \nPreparing a temporary mount of a leaf peel to show stomata. \nUnit- II \n\n\n--- Page 4 ---\n7. \nExperimentally show that carbon dioxide is given out during respiration. \nUnit-II \n8. \nStudy of the following properties of acetic acid (ethanoic acid): \nUnit- I \n \ni) \nOdour \nii) solubility in water \niii) effect on litmus \niv) reaction with Sodium Hydrogen Carbonate \n9. \nStudy of the comparative cleaning capacity of a sample of soap in soft and hard water. Unit- I \n \n10. \nDetermination of the focal length of: \nUnit-III \n \ni) \nConcave mirror \nii) Convex lens \nby obtaining the image of a distant object. \n \n11. \nTracing the path of a ray of light passing through a rectangular glass slab for different angles \nof incidence. Measure the angle of incidence, angle of refraction, angle of emergence and \ninterpret the result. \nUnit - III \n12. \nStudying (a) binary fission in Amoeba, and (b) budding in yeast and Hydra with the help of \nprepared slides. \nUnit-II \n13. \nTracing the path of the rays of light through a glass prism. \nUnit-III \n14. \nIdentification of the different parts of an embryo of a dicot seed (Pea, gram or red kidney bean).\nUnit-II \nPRESCRIBED BOOKS: \n \nScience-Textbook for class IX-NCERT Publication\n \nScience-Text book for class X- NCERT Publication\n \nAssessment of Practical Skills in Science-Class IX - CBSE Publication\n \nAssessment of Practical Skills in Science- Class X- CBSE Publication\n \nLaboratory Manual-Science-Class IX, NCERT Publication\n \nLaboratory Manual-Science-Class X, NCERT Publication\n \nExemplar Problems Class IX – NCERT Publication\n \nExemplar Problems Class X – NCERT Publication\n\n\n--- Page 5 ---\nTheory (80 marks) \nQuestion Paper Design \n(Class X) \nSubject: Science \n \n \nCompetencies \nTotal \nDemonstrate Knowledge and Understanding \n46 % \nApplication of Knowledge/Concepts \n22 % \nFormulate, Analyze, Evaluate and Create \n32 % \n100% \n \nNote: \n \nTypology of Questions: VSA including objective type questions, Assertion – Reasoning type \nquestions; SA; LA; Source-based/ Case-based/ Passage-based/ Integrated assessment \nquestions. \n \nAn internal choice of approximately 33% would be provided. \n \nInternal Assessment (20 Marks) \n \nPeriodic Assessment - 05 marks + 05 marks \n \nSubject Enrichment (Practical Work) - 05 marks \n \nPortfolio - 05 marks \n \nSuggestive verbs for various competencies \n \nDemonstrate Knowledge and Understanding \no State, name, list, identify, define, suggest, describe, outline, summarize, etc. \n \nApplication of Knowledge/Concepts \no Calculate, illustrate, show, adapt, explain, distinguish, etc. \n \nFormulate, Analyze, Evaluate and Create \no Interpret, analyze, compare, contrast, examine, evaluate, discuss, construct, etc. \n",
  "pdf_urls": [
    "https://cdn1.byjus.com/wp-content/uploads/2023/04/CBSE-Syllabus-for-Class-10-Science-2023-24.pdf"
  ],
  "extracted_at": "2026-01-29T11:04:17.724951",
  "pdf_local_files": [
    "syllabus/pdfs/class_10_science_1.pdf"
  ],
  "pdf_parsed_at": "2026-01-30T13:29:25.651058"
}