{
  "url": "https://byjus.com/cbse-class-5-english-syllabus/",
  "title": "",
  "description": "",
  "units": [],
  "chapters": [],
  "topics": [],
  "marking_scheme": [],
  "raw_content": "CBSE Class 5 English Syllabuscovers all the important chapters to study for Class 5 students for the academic year 2023-24. They should go through the entire CBSE English syllabus to score good marks and feel confident while preparing for their exams. All the chapters included in the English syllabus ofCBSE Class 5provide students with basic knowledge of the English subject.\nCBSE Class 5 English Syllabus for 2023-24 Academic Year\nTo download the CBSE Syllabus for Class 5 English, click on the PDF link below.\nDownload CBSE Class 5 English Syllabus PDF for 2023-24\nCBSE Class 5 English Syllabus Chapter Name\nCBSE students can look at the latest Syllabus of Class 5 English 2023-24 by downloading the PDF from the link above. Also, they can know the chapter names of the syllabus below. These chapters are taken from the NCERT Textbook of Class 5 English, and students are recommended to study from the chapters prescribed by the NCERT textbook. Students must also practise theunseen passages for Class 5and a list ofCBSE essaysto improve their writing skills for the English exam.\nChapter 1:Ice-cream Man\nWonderful Waste!\nChapter 2:Teamwork\nFlying Together\nChapter 3:My Shadow\nRobinson Crusoe Discovers a footprint\nChapter 4:Crying\nMy Elder Brother\nChapter 5:Rip Van Winkle\nChapter 6:Class Discussion\nThe Talkative Barber\nChapter 7:Topsy-turvy Land\nGulliver’s Travels\nChapter 8:Nobody’s Friend\nThe Little Bully\nChapter 9:Sing a Song of People\nChapter 10:Malu Bhalu\nWho Will be Ningthou?\nStudents can get the syllabus for Classes from 1 to 12 consisting of all subjects in one place by visiting theCBSE Syllabuspage. Learn Maths and Science in an interactive and fun-loving way with BYJU’S App/Tablet.Frequently Asked Questions on CBSE Syllabus for Class 5 English 2023-24Q1How many chapters are there in the CBSE Syllabus for Class 5 English?There are 10 chapters in the English CBSE Syllabus for Class 5. Students can learn it efficiently using the NCERT textbook prescribed by the CBSE board.Q2Why is English an important subject in the CBSE Class 5 Syllabus?English is an important means of communication among students right from childhood. In order to have a strong hold on the concepts, students should know how to write perfect answers in English.Q3How to focus on the CBSE Syllabus for Class 5 English?Before preparing for the final exam, students should go through the academic year’s CBSE Class 5 syllabus. This will mainly give an in-depth knowledge of basic concepts that are more important in the final exam.\nFrequently Asked Questions on CBSE Syllabus for Class 5 English 2023-24\nHow many chapters are there in the CBSE Syllabus for Class 5 English?\nWhy is English an important subject in the CBSE Class 5 Syllabus?\nHow to focus on the CBSE Syllabus for Class 5 English?",
  "pdf_content": "=== PDF: class_5_english_1.pdf ===\n--- Page 1 ---\n \n \n \n \nCBSE Class 5 Syllabus for English \n2023-24 \n \nCBSE Class 5 English Chapters \n \nChapter 1: Ice Cream Man \nWonderful Taste \n \nChapter 2: Team Work  \nFlying Together \n \nChapter 3: My Shadow \nRobinson Crusoe Discovers a footprint \n \nChapter 4: Crying \nMy Elder Brother \n \nChapter 5: Rip Van Winkle \n \nChapter 6: Class Discussion \nThe Talkative Barber \n \nChapter 7: Topsy-turvy Land \nGulliver’s Travels  \n \nChapter 8: Nobody’s Friend \nThe Little Bully \n \nChapter 9: Sing a Song of People \n \nChapter 10: Malu Bhalu \nWho Will be Ningthou? \n \n",
  "pdf_urls": [
    "https://cdn1.byjus.com/wp-content/uploads/2023/04/CBSE-Syllabus-for-Class-5-English-2023-24.pdf"
  ],
  "extracted_at": "2026-01-29T11:01:13.318688",
  "pdf_local_files": [
    "syllabus/pdfs/class_5_english_1.pdf"
  ],
  "pdf_parsed_at": "2026-01-30T13:29:26.104956"
}