{
  "url": "https://byjus.com/cbse/class-10-maths-syllabus/",
  "title": "",
  "description": "",
  "units": [
    {
      "headers": [
        "Units",
        "Unit Name",
        "Sections"
      ],
      "rows": [
        [
          "I",
          "Number Systems",
          "Real Number"
        ],
        [
          "II",
          "Algebra",
          "PolynomialsPair of Linear Equations in Two VariablesQuadratic EquationsArithmetic Progressions"
        ],
        [
          "III",
          "Coordinate Geometry",
          "Coordinate Geometry"
        ],
        [
          "IV",
          "Geometry",
          "TrianglesCircles"
        ],
        [
          "V",
          "Trigonometry",
          "Introduction to TrigonometryTrigonometric IdentitiesHeights and Distances"
        ],
        [
          "VI",
          "Mensuration",
          "Areas Related to CirclesSurface Areas and Volumes"
        ],
        [
          "VII",
          "Statistics and Probability",
          "StatisticsProbability"
        ]
      ]
    }
  ],
  "chapters": [],
  "topics": [],
  "marking_scheme": [
    {
      "headers": [
        "Units",
        "Unit Name",
        "Marks"
      ],
      "rows": [
        [
          "I",
          "Number Systems",
          "06"
        ],
        [
          "II",
          "Algebra",
          "20"
        ],
        [
          "III",
          "Coordinate Geometry",
          "06"
        ],
        [
          "IV",
          "Geometry",
          "15"
        ],
        [
          "V",
          "Trigonometry",
          "12"
        ],
        [
          "VI",
          "Mensuration",
          "10"
        ],
        [
          "VII",
          "Statistics and Probability",
          "11"
        ],
        [
          "",
          "Total",
          "80"
        ],
        [
          "",
          "Internal Assessment",
          "20"
        ],
        [
          "",
          "Grand Total",
          "100"
        ]
      ]
    },
    {
      "headers": [
        "Internal Assessment",
        "Marks"
      ],
      "rows": [
        [
          "Pen Paper Test and Multiple Assessment (5+5)",
          "10"
        ],
        [
          "Portfolio",
          "05"
        ],
        [
          "Lab Practical (Lab activities to be done from the prescribed books)",
          "05"
        ],
        [
          "Total",
          "20 Marks"
        ]
      ]
    }
  ],
  "raw_content": "CBSE Syllabus for Class 10 Mathsfor the academic year 2023-24 has been released by the CBSE board on their official website. Check out the syllabus for Class 10 students to develop their mathematical skills for better learning outcomes. The new CBSE Class 10 Maths Syllabus  2023-24 will not have many changes when compared to the 2022-23 syllabus. Download CBSE Class 10 Maths syllabus PDF to learn concepts such as Number Systems, Algebra, Coordinate Geometry, Geometry, Trigonometry, Mensuration, and Statistics and Probability.\nCBSE 10th Maths syllabus consists of topics they are going to study for the entire academic year. Also, they will get a clear idea about marks allotted for each unit and the number of periods assigned for the same. All the units mentioned in the syllabus are important as the final question paper is prepared based on theCBSE Syllabus. It also provides information about marks weightage, practicals, assignments, projects, etc.\nMaths is a subject that needs a lot of practice, memorisation of formulas and a clear understanding of mathematical concepts. It is a scoring subject for students of Class 10 if they practice it regularly. Students can download the CBSE syllabus for Class 10 Maths PDF provided in this article. They can also find the course structure, internal assessment, and marks allotment for each unit in the given PDF. ReferringCBSE Class 10 syllabusfor mathematics will help students familiarise themselves with concepts effectively.\nCBSE Class 10 Maths Syllabus for Academic Year 2023-24 PDF\nCBSE Syllabus for Class Maths is prescribed by the CBSE board. Therefore, click on the CBSE 10th Maths Syllabus PDF for Basic and Standard Maths from the direct link given below.\nDownload CBSE Class 10 Maths Syllabus 2023-24 PDF\nDownload PDF\nAfter downloading the CBSE 10th Maths syllabus, students are advised to print it out and paste it into their study room. It will help them keep track of topics they have covered till now. Also, they will focus on investing more time on the concepts they find it challenging to understand by practising regularly.\n2023-24 CBSE Class 10 Maths Syllabus\nUnitsUnit NameSectionsINumber SystemsReal NumberIIAlgebraPolynomialsPair of Linear Equations in Two VariablesQuadratic EquationsArithmetic ProgressionsIIICoordinate GeometryCoordinate GeometryIVGeometryTrianglesCirclesVTrigonometryIntroduction to TrigonometryTrigonometric IdentitiesHeights and DistancesVIMensurationAreas Related to CirclesSurface Areas and VolumesVIIStatistics and ProbabilityStatisticsProbability\nUnitsUnit NameSections\nUnits\nUnit Name\nSections\nINumber SystemsReal Number\nNumber Systems\nReal Number\nIIAlgebraPolynomialsPair of Linear Equations in Two VariablesQuadratic EquationsArithmetic Progressions\nAlgebra\nPolynomialsPair of Linear Equations in Two VariablesQuadratic EquationsArithmetic Progressions\nPair of Linear Equations in Two Variables\nQuadratic Equations\nArithmetic Progressions\nIIICoordinate GeometryCoordinate Geometry\nIII\nCoordinate Geometry\nCoordinate Geometry\nIVGeometryTrianglesCircles\nGeometry\nTrianglesCircles\nCircles\nVTrigonometryIntroduction to TrigonometryTrigonometric IdentitiesHeights and Distances\nTrigonometry\nIntroduction to TrigonometryTrigonometric IdentitiesHeights and Distances\nTrigonometric Identities\nHeights and Distances\nVIMensurationAreas Related to CirclesSurface Areas and Volumes\nMensuration\nAreas Related to CirclesSurface Areas and Volumes\nSurface Areas and Volumes\nVIIStatistics and ProbabilityStatisticsProbability\nVII\nStatistics and Probability\nStatisticsProbability\nProbability\nCBSE Syllabus for Class 10 Maths 2023-24 with Marking Scheme\nAs students can see in the table below, the CBSE 10th Maths syllabus is divided into 7 units. The marks weightage for each unit is also indicated in the table. The CBSE Syllabus for Class 10 Basic Maths and Standard Maths with Marking Scheme is also added in the PDF link provided above.\nUnitsUnit NameMarksINumber Systems06IIAlgebra20IIICoordinate Geometry06IVGeometry15VTrigonometry12VIMensuration10VIIStatistics and Probability11Total80Internal Assessment20Grand Total100\nUnitsUnit NameMarks\nUnits\nUnit Name\nMarks\nINumber Systems06\nNumber Systems\nIIAlgebra20\nAlgebra\nIIICoordinate Geometry06\nIII\nCoordinate Geometry\nIVGeometry15\nGeometry\nVTrigonometry12\nTrigonometry\nVIMensuration10\nMensuration\nVIIStatistics and Probability11\nVII\nStatistics and Probability\nTotal80\nTotal\nInternal Assessment20\nInternal Assessment\nGrand Total100\nGrand Total\n100\nStudents can have a look at the CBSE Class 10 Maths Internal Assessment below.\nInternal AssessmentMarksPen Paper Test and Multiple Assessment (5+5)10Portfolio05Lab Practical (Lab activities to be done from the prescribed books)05Total20 Marks\nInternal AssessmentMarks\nInternal Assessment\nMarks\nPen Paper Test and Multiple Assessment (5+5)10\nPen Paper Test and Multiple Assessment (5+5)\nPortfolio05\nPortfolio\nLab Practical (Lab activities to be done from the prescribed books)05\nLab Practical (Lab activities to be done from the prescribed books)\nTotal20 Marks\nTotal\n20 Marks\nTo practise more questions, download theCBSE Sample Papers for Class 10 Maths. Learn Maths & Science in an interactive & fun-loving way with BYJU’S App/Tablet.Frequently Asked Questions on CBSE Syllabus of Class 10 Maths 2023-24Q1How much time will it take to complete the CBSE Class 10 Maths Syllabus?There is no specific time limit to complete the CBSE Class 10 Maths Syllabus. It can be decided based on the understanding capacity of students and the marks allotted.Q2How many units are present in the CBSE Class 10 Maths Syllabus?There are 7 units in the CBSE Class 10 Maths Syllabus, such as Number Systems, Algebra, Coordinate Geometry, Geometry, Trigonometry, Mensuration, and Statistics and Probability.Q3How many marks are allotted for the internal assessment as per the CBSE Maths Syllabus of Class 10?The marks allotted for the internal assessment as per the CBSE Maths Syllabus of Class 10 is 20.\nFrequently Asked Questions on CBSE Syllabus of Class 10 Maths 2023-24\nHow much time will it take to complete the CBSE Class 10 Maths Syllabus?\nHow many units are present in the CBSE Class 10 Maths Syllabus?\nHow many marks are allotted for the internal assessment as per the CBSE Maths Syllabus of Class 10?",
  "pdf_content": "=== PDF: class_10_maths_1.pdf ===\n--- Page 1 ---\n6 \nCBSE Class 10 Syllabus for Maths 2023-24 \nUnits \nUnit Name \nMarks \nI \nNUMBER SYSTEMS \n06 \nII \nALGEBRA \n20 \nIII \nCOORDINATE GEOMETRY \n06 \nIV \nGEOMETRY \n15 \nV \nTRIGONOMETRY \n12 \nVI \nMENSURATION \n10 \nVII \nSTATISTICS & PROBABILTY \n11 \nTotal \n80 \nUNIT I: NUMBER SYSTEMS \n1. REAL NUMBER\n(15) Periods\nFundamental Theorem of Arithmetic - statements after reviewing work done earlier and \nafter illustrating and motivating through examples, Proofs of irrationality of \nUNIT II: ALGEBRA \n1.\nPOLYNOMIALS                                                                                (8) Periods\nZeros of a polynomial. Relationship between zeros and coefficients of quadratic\npolynomials.\n2.\nPAIR OF LINEAR EQUATIONS IN TWO VARIABLES                                      (15) Periods\nPair of linear \nequations \nin two \nvariables \nand \ngraphical \nmethod of their\nsolution, consistency/inconsistency.\nAlgebraic conditions for number of solutions. Solution of a pair of linear equations in two\nvariables algebraically - by substitution, by elimination. Simple situational problems.\n3.\nQUADRATIC EQUATIONS                                                                                          (15) Periods\nStandard form of a quadratic equation ax2 + bx + c = 0, (a ≠ 0). Solutions of quadratic\nequations (only real roots) by factorization, and by using quadratic formula. Relationship\nbetween discriminant and nature of roots.\nSituational problems based on quadratic equations related to day to day activities to be\nincorporated.\n\n\n--- Page 2 ---\n7 \n4.\nARITHMETIC PROGRESSIONS \n                                                                      (10) Periods\nMotivation for studying Arithmetic Progression Derivation of the nth term and sum of the\nfirst n terms of A.P. and their application in solving daily life problems.\nUNIT III: COORDINATE GEOMETRY \n        Coordinate Geometry    \n(15) Periods\nReview: Concepts of coordinate geometry, graphs of linear equations. Distance formula. \nSection formula (internal division).  \nUNIT IV: GEOMETRY \n1.\nTRIANGLES\n(15) Periods\nDefinitions, examples, counter examples of similar triangles.\n1. (Prove) If a line is drawn parallel to one side of a triangle to intersect the other two\nsides in distinct points, the other two sides are divided in the same ratio.\n2. (Motivate) If a line divides two sides of a triangle in the same ratio, the line is parallel\nto the third side.\n3. (Motivate) If in two triangles, the corresponding angles are equal, their corresponding\nsides are proportional and the triangles are similar.\n4. (Motivate) If the corresponding sides of two triangles are proportional, their\ncorresponding angles are equal and the two triangles are similar.\n5. (Motivate) If one angle of a triangle is equal to one angle of another triangle and the\nsides including these angles are proportional, the two triangles are similar.\n2.\nCIRCLES\n(10) Periods\nTangent to a circle at, point of contact\n1. (Prove) The tangent at any point of a circle is perpendicular to the radius through the\npoint of contact.\n2. (Prove) The lengths of tangents drawn from an external point to a circle are equal.\n\n\n--- Page 3 ---\n8 \nUNIT V: TRIGONOMETRY \n1.\nINTRODUCTION TO TRIGONOMETRY                                                                        (10) Periods\nTrigonometric ratios of an acute angle of a right-angled triangle. Proof of their\nexistence (well defined); motivate the ratios whichever are defined at 0o and 90o. Values\nof the trigonometric ratios of 300, 450 and 600. Relationships between the ratios.\n2.\nTRIGONOMETRIC IDENTITIES                                                                                        (15) Periods\nProof and applications of the identity sin2A + cos2A = 1. Only simple identities to be\ngiven.\n3.\nHEIGHTS AND DISTANCES: Angle of elevation, Angle of Depression. (10)Periods\nSimple problems on heights and distances. Problems should not involve more than two\nright triangles. Angles of elevation / depression should be only 30°, 45°, and 60°.\nUNIT VI: MENSURATION \n1.\nAREAS RELATED TO CIRCLES                                                                                       (12) Periods\nArea of sectors and segments of a circle. Problems based on areas and perimeter /\ncircumference of the above said plane figures. (In calculating area of segment of a\ncircle, problems should be restricted to central angle of 60°, 90° and 120° only.\n2.\nSURFACE AREAS AND VOLUMES                                                                                 (12) Periods\nSurface areas and volumes of combinations of any two of the following: cubes, cuboids,\nspheres, hemispheres and right circular cylinders/cones.\nUNIT VII: STATISTICS AND PROBABILITY \n1.\nSTATISTICS\n(18) Periods\nMean, median and mode of grouped data (bimodal situation to be avoided).\n2.\nPROBABILITY                                                                                    (10) Periods\nClassical definition of probability. Simple problems on finding the probability of an\nevent.\n\n\n--- Page 4 ---\n9 \nMATHEMATICS-Standard   \nQUESTION PAPER DESIGN \nCLASS – X (2023-24)  \nTime: 3 Hours \n  Max. Marks: 80\nS. \nNo. \nTypology of Questions \nTotal \nMarks \n% \nWeightage \n(approx.) \n1 \nRemembering: Exhibit memory of previously learned material by \nrecalling facts, terms, basic concepts, and answers. \nUnderstanding: Demonstrate understanding of facts and ideas by \norganizing, comparing, translating, interpreting, giving descriptions, and \nstating main ideas \n43 \n54 \n2 \nApplying: Solve problems to new situations by applying acquired \nknowledge, facts, techniques and rules in a different way. \n19 \n24 \n3 \nAnalysing : \nExamine and break information into parts by identifying motives or \ncauses. Make inferences and find evidence to support generalizations \nEvaluating: \nPresent and defend opinions by making judgments about information, \nvalidity of ideas, or quality of work based on a set of criteria. \nCreating:  \nCompile information together in a different way by combining elements \nin a new pattern or proposing alternative solutions \n18 \n22 \nTotal \n80 \n100 \nINTERNAL ASSESSMENT \n20 MARKS \nPen Paper Test and Multiple Assessment  (5+5) \n    10 Marks \nPortfolio  \n    05 Marks \nLab Practical (Lab activities to be done from the prescribed books) \n    05 Marks \n\n\n--- Page 5 ---\n10 \nMATHEMATICS-Basic \nQUESTION PAPER DESIGN \nCLASS – X (2023-24)  \nTime: 3Hours \n Max. Marks: 80\nS. \nNo. \nTypology of Questions \nTotal \nMarks \n% \nWeightage \n(approx.) \n1 \nRemembering: Exhibit memory of previously learned material by \nrecalling facts, terms, basic concepts, and answers. \nUnderstanding: Demonstrate understanding of facts and ideas by \norganizing, comparing, translating, interpreting, giving descriptions, and \nstating main ideas \n60 \n75 \n2 \nApplying: Solve problems to new situations by applying acquired \nknowledge, facts, techniques and rules in a different way. \n12 \n15 \n3 \nAnalysing : \nExamine and break information into parts by identifying motives or \ncauses. Make inferences and find evidence to support generalizations \nEvaluating: \nPresent and defend opinions by making judgments about information, \nvalidity of ideas, or quality of work based on a set of criteria. \nCreating:  \nCompile information together in a different way by combining elements \nin a new pattern or proposing alternative solutions \n8 \n10 \nTotal \n80 \n100 \nPRESCRIBED BOOKS: \n1.\nMathematics - Textbook for class IX - NCERT Publication\n2.\nMathematics - Textbook for class X - NCERT Publication\n3.\nGuidelines for Mathematics Laboratory in Schools, class IX - CBSE Publication\n4.\nGuidelines for Mathematics Laboratory in Schools, class X - CBSE Publication\n5.\nLaboratory Manual - Mathematics, secondary stage - NCERT Publication\n6.\nMathematics exemplar problems for class IX, NCERT publication.\n7.\nMathematics exemplar problems for class X, NCERT publication.\nINTERNAL ASSESSMENT \n20 MARKS \nPen Paper Test and Multiple Assessment  (5+5) \n    10 Marks \nPortfolio  \n    05 Marks \nLab Practical (Lab activities to be done from the prescribed books) \n    05 Marks \n",
  "pdf_urls": [
    "https://cdn1.byjus.com/wp-content/uploads/2023/04/CBSE-Syllabus-for-Class-10-April-11-Maths-2023-24.pdf"
  ],
  "extracted_at": "2026-01-29T11:03:59.011147",
  "pdf_local_files": [
    "syllabus/pdfs/class_10_maths_1.pdf"
  ],
  "pdf_parsed_at": "2026-01-30T13:29:25.602045"
}