{
  "url": "https://byjus.com/cbse/class-12-chemistry-syllabus/",
  "title": "",
  "description": "",
  "units": [],
  "chapters": [],
  "topics": [],
  "marking_scheme": [
    {
      "headers": [
        "S.No",
        "Title",
        "No. of Periods",
        "Marks"
      ],
      "rows": [
        [
          "1",
          "Solutions",
          "10",
          "7"
        ],
        [
          "2",
          "Electrochemistry",
          "12",
          "9"
        ],
        [
          "3",
          "Chemical Kinetics",
          "10",
          "7"
        ],
        [
          "4",
          "d -and f -Block Elements",
          "12",
          "7"
        ],
        [
          "5",
          "Coordination Compounds",
          "12",
          "7"
        ],
        [
          "6",
          "Haloalkanes and Haloarenes",
          "10",
          "6"
        ],
        [
          "7",
          "Alcohols, Phenols and Ethers",
          "10",
          "6"
        ],
        [
          "8",
          "Aldehydes, Ketones and Carboxylic Acids",
          "10",
          "8"
        ],
        [
          "9",
          "Amines",
          "10",
          "6"
        ],
        [
          "10",
          "Biomolecules",
          "12",
          "7"
        ],
        [
          "",
          "Total",
          "",
          "70"
        ]
      ]
    },
    {
      "headers": [
        "Evaluation Scheme for Examination",
        "Marks"
      ],
      "rows": [
        [
          "Volumetric Analysis",
          "08"
        ],
        [
          "Salt Analysis",
          "08"
        ],
        [
          "Content-Based Experiment",
          "06"
        ],
        [
          "Project Work and Viva",
          "04"
        ],
        [
          "Class record and Viva",
          "04"
        ],
        [
          "Total",
          "30"
        ]
      ]
    }
  ],
  "raw_content": "CBSE Syllabus for Class 12 Chemistryis available for students to prepare for the 2023-24 academic year. Chemistry is one of the basic branches of Science that deals with the properties, structure, and constituents of matter or substance and its interactions with other forms of matter. Students need to know the CBSE Syllabus for Class 12 Chemistry before beginning their academic year 2023-2024. It will give them an idea of the chapters and units of theCBSE Class 12. The Board conducts studies and research before modifying or prescribing the Syllabus for Class 12 Chemistry. Below, we have provided the CBSE Syllabus for Class 12 Chemistry 2023-24 PDF for free downloading.\nCBSE Class 12 Chemistry Syllabus 2023-24 Download PDF\nStudents can download the latest released CBSE Class 12 Chemistry Syllabus PDF from the link below. Going through the syllabus will help students to know the topics they are going to study in Chemistry during the academic year. Below is theCBSE Class 12 Syllabusfor the academic year 2023-24, along with the marking scheme and time duration of the Chemistry exam.\nCBSE Class 12 Chemistry Syllabus 2023-24\nS.NoTitleNo. of PeriodsMarks1Solutions1072Electrochemistry1293Chemical Kinetics1074d -and f -Block Elements1275Coordination Compounds1276Haloalkanes and Haloarenes1067Alcohols, Phenols and Ethers1068Aldehydes, Ketones and Carboxylic Acids1089Amines10610Biomolecules127Total70\nS.NoTitleNo. of PeriodsMarks\nS.No\nTitle\nNo. of Periods\nMarks\n1Solutions107\nSolutions\n2Electrochemistry129\nElectrochemistry\n3Chemical Kinetics107\nChemical Kinetics\n4d -and f -Block Elements127\nd -and f -Block Elements\n5Coordination Compounds127\nCoordination Compounds\n6Haloalkanes and Haloarenes106\nHaloalkanes and Haloarenes\n7Alcohols, Phenols and Ethers106\nAlcohols, Phenols and Ethers\n8Aldehydes, Ketones and Carboxylic Acids108\nAldehydes, Ketones and Carboxylic Acids\n9Amines106\nAmines\n10Biomolecules127\nBiomolecules\nTotal70\nTotal\nStudents can check out the Syllabus of class 1 to class 12 for all the subjects by visiting theCBSE Syllabuspage.\nCBSE Class 12 Chemistry Practical Syllabus along with Marking Scheme\nEvaluation Scheme for ExaminationMarksVolumetric Analysis08Salt Analysis08Content-Based Experiment06Project Work and Viva04Class record and Viva04Total30\nEvaluation Scheme for ExaminationMarks\nEvaluation Scheme for Examination\nMarks\nVolumetric Analysis08\nVolumetric Analysis\nSalt Analysis08\nSalt Analysis\nContent-Based Experiment06\nContent-Based Experiment\nProject Work and Viva04\nProject Work and Viva\nClass record and Viva04\nClass record and Viva\nTotal30\nTotal\nStudents can also check out theTips for the Class 12 Chemistry Exam. They can easily access the Class 12 study material in one place by visiting the CBSE Class 12 page at BYJU’S. Moreover, to get interactive lessons and study videos, download the BYJU’S App.Frequently Asked Questions on CBSE Class 12 Chemistry Syllabus 2023-24Q1How many chapters are there in the CBSE Class 12 Chemistry as per the syllabus?There are 10 chapters in the CBSE Class 12 Chemistry as per Syllabus. Students can learn all these chapters efficiently using the study materials provided at BYJU’S.Q2What is the marking scheme for CBSE Class 12 Chemistry practical exam according to the syllabus?The marking scheme for CBSE Class 12 Chemistry practical exam, according to the syllabus, is 8 marks for volumetric analysis, 8 marks for salt analysis, 6 marks for the content-based experiment, 4 marks for the project and viva and 4 marks for class record and viva.Q3Which is the scoring chapter in Chemistry as per CBSE Class 12 syllabus?The chapter Electrochemistry in Chemistry is the scoring chapter as per CBSE Class 12 syllabus.\nFrequently Asked Questions on CBSE Class 12 Chemistry Syllabus 2023-24\nHow many chapters are there in the CBSE Class 12 Chemistry as per the syllabus?\nWhat is the marking scheme for CBSE Class 12 Chemistry practical exam according to the syllabus?\nWhich is the scoring chapter in Chemistry as per CBSE Class 12 syllabus?",
  "pdf_content": "=== PDF: class_12_chemistry_1.pdf ===\n--- Page 1 ---\nCLASS XII (2023-24) (THEORY) \nTime : 3 Hours \n  70 Marks \nS.No.\nTitle \nNo. of \nPeriods \nMarks \n1 Solutions \n10 \n7 \n2 Electrochemistry \n12 \n9 \n3 Chemical Kinetics \n10 \n7 \n4 d -and f -Block Elements \n12 \n7 \n5 Coordination Compounds \n12 \n7 \n6 Haloalkanes and Haloarenes \n10 \n6 \n7 Alcohols, Phenols and Ethers \n10 \n6 \n8 Aldehydes, Ketones and Carboxylic Acids \n10 \n8 \n9 Amines \n10 \n6 \n10 Biomolecules \n12 \n7 \nTotal \n70 \nUnit II: Solutions \n10 Periods \n  Types of solutions, expression of concentration of solutions of solids in liquids, solubility of gases in \nliquids, solid solutions, Raoult's law, colligative properties - relative lowering of vapour pressure, \nelevation of boiling point, depression of freezing point, osmotic pressure, determination of molecular \nmasses using colligative properties, abnormal molecular mass, Van't Hoff factor.  \nUnit III: Electrochemistry \n12 Periods \n  Redox reactions, EMF of a cell, standard electrode potential, Nernst equation and its application to \nchemical cells, Relation between Gibbs energy change and EMF of a cell, conductance in electrolytic \nsolutions, specific and molar conductivity, variations of conductivity with concentration, Kohlrausch's \nLaw, electrolysis and law of electrolysis (elementary idea), dry cell-electrolytic cells and Galvanic cells, \nlead accumulator, fuel cells, corrosion.  \nCBSE Class 12 Syllabus for Chemistry 2023-24\n\n\n--- Page 2 ---\nUnit IV: Chemical Kinetics \n10 Periods \n Rate of a reaction (Average and instantaneous), factors affecting rate of reaction: concentration, \ntemperature, catalyst; order and molecularity of a reaction, rate law and specific rate constant, \nintegrated rate equations and half-life (only for zero and first order reactions), concept of collision \ntheory (elementary idea, no mathematical treatment), activation energy, Arrhenius equation.   \nUnit VIII: d and f Block Elements \n12 Periods \n  General introduction, electronic configuration, occurrence and characteristics of transition metals, \ngeneral trends in properties of the first row transition metals – metallic character, ionization enthalpy, \noxidation states, ionic radii, colour, catalytic property, magnetic properties, interstitial compounds, \nalloy formation, preparation and properties of K2Cr2O7 and KMnO4.  \n  Lanthanoids - Electronic configuration, oxidation states, chemical reactivity and lanthanoid \ncontraction and its consequences.  \nActinoids - Electronic configuration, oxidation states and comparison with lanthanoids. \nUnit IX: Coordination Compounds \n12 Periods \n Coordination compounds - Introduction, ligands, coordination number, colour, magnetic properties \nand shapes, IUPAC nomenclature of mononuclear coordination compounds. Bonding, Werner's \ntheory, VBT, and CFT; structure and stereoisomerism, importance of coordination compounds (in \nqualitative analysis, extraction of metals and biological system).  \nUnit X:   Haloalkanes and Haloarenes. \n10 Periods \n Haloalkanes: Nomenclature, nature of C–X bond, physical and chemical properties, optical rotation \nmechanism of substitution reactions.  \n   Haloarenes: Nature of C–X bond, substitution reactions (Directive influence of halogen in \nmonosubstituted compounds only).  \n Uses and environmental effects of - dichloromethane, trichloromethane, tetrachloromethane, \niodoform, freons, DDT.  \nUnit XI:  Alcohols, Phenols and Ethers \n10 Periods \n  Alcohols: Nomenclature, methods of preparation, physical and chemical properties (of primary \nalcohols only), identification of primary, secondary and tertiary alcohols, mechanism of dehydration, \nuses with special reference to methanol and ethanol.  \n  Phenols: Nomenclature, methods of preparation, physical and chemical properties, acidic nature of \nphenol, electrophillic substitution reactions, uses of phenols.  \n Ethers: Nomenclature, methods of preparation, physical and chemical properties, uses. \n\n\n--- Page 3 ---\nUnit XII: Aldehydes, Ketones and Carboxylic Acids \n10 Periods \n   Aldehydes and Ketones: Nomenclature, nature of carbonyl group, methods of preparation, physical \nand chemical properties, mechanism of nucleophilic addition, reactivity of alpha hydrogen in \naldehydes, uses.  \n  Carboxylic Acids: Nomenclature, acidic nature, methods of preparation, physical and chemical \nproperties; uses.  \nUnit XIII: Amines \n10 Periods \n   Amines: Nomenclature, classification, structure, methods of preparation, physical and chemical \nproperties, uses, identification of primary, secondary and tertiary amines.  \nDiazonium salts: Preparation, chemical reactions and importance in synthetic organic chemistry. \nUnit XIV: Biomolecules \n12 Periods \n  Carbohydrates - Classification (aldoses and ketoses), monosaccahrides (glucose and fructose), D-L \nconfiguration oligosaccharides (sucrose, lactose, maltose), polysaccharides (starch, cellulose, \nglycogen); Importance of carbohydrates.   \n  Proteins -Elementary idea of - amino acids, peptide bond, polypeptides, proteins, structure of proteins \n- primary, secondary, tertiary structure and quaternary structures (qualitative idea only), denaturation\nof proteins; enzymes. Hormones - Elementary idea excluding structure.\nVitamins - Classification and functions. \nNucleic Acids: DNA and RNA.  \nPRACTICALS \nEvaluation Scheme for Examination \nMarks \nVolumetric Analysis \n08 \nSalt Analysis \n08 \nContent Based Experiment \n06 \nProject Work \n04 \nClass record and viva \n04 \nTotal \n30 \nPRACTICAL SYLLABUS  \n60Periods \nMicro-chemical methods are available for several of the practical experiments. Wherever \npossible, such techniques should be used.  \n\n\n--- Page 4 ---\nA. Surface Chemistry\n(a) Preparation of one lyophilic and one lyophobic sol\nLyophilic sol - starch, egg albumin and gum\nLyophobic sol - aluminium hydroxide, ferric hydroxide, arsenous sulphide.\n(b) Dialysis of sol-prepared in (a) above.\n(c) Study of the role of emulsifying agents in stabilizing the emulsion of different oils.\nB. Chemical Kinetics\n(a) Effect of concentration and temperature on the rate of reaction between Sodium Thiosulphate and\nHydrochloric acid.\n(b) Study of reaction rates of any one of the following:\n(i) Reaction of Iodide ion with Hydrogen Peroxide at room temperature using different\nconcentration of Iodide ions.\n(ii) Reaction between Potassium Iodate, (KIO3) and Sodium Sulphite: (Na2SO3) using starch solution\nas indicator (clock reaction).\nC. Thermochemistry\nAny one of the following experiments\ni)\nEnthalpy of dissolution of Copper Sulphate or Potassium Nitrate.\nii)\nEnthalpy of neutralization of strong acid (HCI) and strong base (NaOH).\niii) Determination of enthaply change during interaction (Hydrogen bond formation) between Acetone\nand Chloroform.\nD. Electrochemistry\nVariation of cell potential in Zn/Zn2+|| Cu2+/Cu with change in concentration of electrolytes (CuSO4 or\nZnSO4) at room temperature. \nE. Chromatography\ni)\nSeparation of pigments from extracts of leaves and flowers by paper chromatography and\ndetermination of Rf values.\nii)\nSeparation of constituents present in an inorganic mixture containing two cations only (constituents\nhaving large difference in Rf values to be provided).\nF.\nPreparation of Inorganic Compounds\nPreparation of double salt of Ferrous Ammonium Sulphate or Potash Alum. Preparation \nof Potassium Ferric Oxalate.  \nG. Preparation of Organic Compounds\nPreparation of any one of the following compounds \ni)\nAcetanilide ii) Di -benzalAcetone iii) p-Nitroacetanilide iv) Aniline yellow or 2 - Naphthol Anilinedye.\nH. Tests for the functional groups present in organic compounds:\nUnsaturation, alcoholic, phenolic, aldehydic, ketonic, carboxylic and amino (Primary) groups.\n\n\n--- Page 5 ---\nI.\nCharacteristic tests of carbohydrates, fats and proteins in pure samples and their detection in\ngiven foodstuffs.\nJ.\nDetermination of concentration/ molarity of KMnO4 solution by titrating it against a standard\nsolution of:\ni)\nOxalic acid,\nii)\nFerrous Ammonium Sulphate\n(Students will be required to prepare standard solutions by weighing themselves). K.\nQualitative analysis  \nDetermination of one cation and one anion in a given salt. \n  \nCation : Pb2+, Cu2+ As3+, Aℓ3+, Fe3+, Mn2+, Zn2+, Cu2+, Ni2+, Ca2+, Sr2+, Ba2+, Mg2+, NH4+\n Anions: (CO3)2-, S2-, (SO3)2-, (NO2)-, (SO4)2-, Cℓ-, Br-, I-, PO3-4, (C2O4)2-, CH3COO-,NO3- \n(Note: Insoluble salts excluded)  \nPROJECT  \nScientific investigations involving laboratory testing and collecting information from other sources A \nfew suggested Projects.  \n•\nStudy of the presence of oxalate ions in guava fruit at different stages of ripening.\n•\nStudy of quantity of casein present in different samples of milk.\n•\nPreparation of soybean milk and its comparison with the natural milk with respect to curd formation,\neffect of temperature, etc.\n•\nStudy of the effect of Potassium Bisulphate as food preservative under various conditions (temperature,\nconcentration, time, etc.)\n•\nStudy of digestion of starch by salivary amylase and effect of pH and temperature on it.\n•\nComparative study of the rate of fermentation of following materials: wheat flour, gram flour, potato\njuice, carrot juice, etc.\n•\nExtraction of essential oils present in Saunf (aniseed), Ajwain (carum), Illaichi (cardamom).\n•\nStudy of common food adulterants in fat, oil, butter, sugar, turmeric power, chilli powder and pepper.\nNote: Any other investigatory project, which involves about 10 periods of work, can be chosen with the\napproval of the teacher.\nPractical Examination for Visually Impaired Students of Classes XI and XII Evaluation Scheme \nTime Allowed: Two hours \nMax. Marks:30 \nIdentification/Familiarity with the apparatus \n5 marks \nWritten test (based on given/prescribed practicals) \n10 marks \nPractical Record \n5 marks \nViva \n10 marks \nTotal \n30 marks \n\n\n--- Page 6 ---\nGeneral Guidelines \n•\nThe practical examination will be of two hour duration.\n•\nA separate list of ten experiments is included here.\n•\nThe written examination in practicals for these students will be conducted at the time of practical\nexamination of all other students.\n•\nThe written test will be of 30 minutes duration.\n•\nThe question paper given to the students should be legibly typed. It should contain a total of 15\npractical skill based very short answer type questions. A student would be required to answer any 10\nquestions.\n•\nA writer may be allowed to such students as per CBSE examination rules.\n•\nAll questions included in the question papers should be related to the listed practicals. Every question\nshould require about two minutes to be answered.\n•\nThese students are also required to maintain a practical file. A student is expected to record at least\nfive of the listed experiments as per the specific instructions for each subject. These practicals should\nbe duly checked and signed by the internal examiner.\n•\nThe format of writing any experiment in the practical file should include aim, apparatus required,\nsimple theory, procedure, related practical skills, precautions etc.\n•\nQuestions may be generated jointly by the external/internal examiners and used for assessment.\n•\nThe viva questions may include questions based on basic theory/principle/concept,\napparatus/materials/ chemicals required, procedure, precautions, sources of error etc.\nA. Items for Identification/Familiarity of the apparatus for assessment in practical (All experiments)\nBeaker, glass rod, tripod stand, wire gauze, Bunsen burner, Whatman filter paper, gas jar, capillary\ntube, pestle and mortar, test tubes, tongs, test tube holder, test tube stand, burette, pipette, conical \nflask, standard flask, clamp stand, funnel, filter paper  \nHands-on Assessment \n•\nIdentification/familiarity with the apparatus\n•\nOdour detection in qualitative analysis\nB. List of Practicals\nThe experiments have been divided into two sections: Section A and Section B. The experiments\nmentioned in Section B are mandatory. \nSECTION- A \nA \nSurface Chemistry \n(1) Preparation of one lyophilic and one lyophobic\nsol  Lyophilic sol - starch, egg albumin and gum\n(2) Preparation of one lyophobic sol  Lyophobic sol\n– Ferric hydroxide B Chromatography\n(1) Separation of pigments from extracts of leaves and flowers by paper chromatography and\ndetermination of Rf values (distance values may be provided).\nC \nTests for the functional groups present in organic compounds: \n(1) Alcoholic and Carboxylic groups.\n\n\n--- Page 7 ---\n(2) Aldehydic and Ketonic\nD \nCharacteristic tests of carbohydrates and proteins in the given foodstuffs. E \nPreparation of Inorganic Compounds- Potash Alum \nSECTION-B (Mandatory) \nF  Quantitative analysis \n(1) (a)  Preparation of the standard solution of Oxalic acid of a given volume\n(b)\nDetermination of molarity of KMnO4 solution by titrating it against a standard solution of\nOxalic acid.\n(2) The above exercise [F 1 (a) and (b)] to be conducted using Ferrous ammonium sulphate (Mohr's\nsalt)\nG \nQualitative analysis: \n(1) Determination of one cation and one anion in a given salt.\nCation –NH4+\nAnions – CO32-, S2-, SO32-, Cl-, CH3COO-\n(Note: Insoluble salts excluded)\nNote: The above practicals may be carried out in an experiential manner rather than recording \nobservations.  \nPrescribed Books:  \n1.\nChemistry Part -I, Class-XII, Published by NCERT.\n2.\nChemistry Part -II, Class-XII, Published by NCERT.\nCHEMISTRY (Code No. 043) QUESTION PAPER DESIGN CLASSES –XI and XII (2023-24) \nS \nDomains \nTotal Marks % \n1 \nRemembering and Understanding:  \nExhibit memory of previously learned material by recalling facts, terms, \nbasic concepts and answers. Demonstrate understanding of facts and \nideas by organizing, comparing, translating, interpreting, giving \ndescriptions and stating main ideas.  \n28 \n40 \n2 \nApplying:  \nSolve problems to new situations by applying acquired knowledge, facts, \ntechniques and rules in a different way.  \n21 \n30 \n3 \nAnalysing, Evaluating and Creating:  \nExamine and break information into parts by identifying motives or causes. \nMake inferences and find evidence to support generalizations. Present and \ndefend opinions by making judgments about information, validity of ideas \nor quality of work based on a set of criteria.  \nCompile information together in a different way by combining elements in \na new pattern or proposing alternative solutions.  \n21 \n30 \n1. No chapter wise weightage. Care to be taken to cover all the chapters.\n2. Suitable internal variations may be made for generating various templates. Choice(s):\n•\nThere will be no overall choice in the question paper.\n•\nHowever, 33% internal choices will be given in all the sections.\n",
  "pdf_urls": [
    "https://cdn1.byjus.com/wp-content/uploads/2023/04/CBSE-Class-12-Chemistry-Syllabus-2023-24.pdf"
  ],
  "extracted_at": "2026-01-29T11:07:12.865711",
  "pdf_local_files": [
    "syllabus/pdfs/class_12_chemistry_1.pdf"
  ],
  "pdf_parsed_at": "2026-01-30T13:29:25.827173"
}