{
  "url": "https://byjus.com/cbse/class-12-biology-syllabus/",
  "title": "",
  "description": "",
  "units": [
    {
      "headers": [
        "Unit Name",
        "Chapters"
      ],
      "rows": [
        [
          "Unit-VI Reproduction",
          "Chapter-1: Sexual Reproduction in Flowering PlantsChapter-2: Human ReproductionChapter-3: Reproductive Health"
        ],
        [
          "Unit-VII Genetics and Evolution",
          "Chapter-4: Principles of Inheritance and VariationChapter-5: Molecular Basis of InheritanceChapter-6: Evolution"
        ],
        [
          "Unit-VIII Biology and Human Welfare",
          "Chapter-7: Human Health and DiseasesChapter-8: Microbes in Human Welfare"
        ],
        [
          "Unit-IX Biotechnology and its Applications",
          "Chapter-9: Biotechnology – Principles and ProcessesChapter-10: Biotechnology and its Applications"
        ],
        [
          "Unit-X Ecology and Environment",
          "Chapter-11: Organisms and PopulationsChapter-12: EcosystemChapter-13: Biodiversity and Its Conservation"
        ]
      ]
    }
  ],
  "chapters": [],
  "topics": [],
  "marking_scheme": [
    {
      "headers": [
        "Evaluation Scheme",
        "Marks"
      ],
      "rows": [
        [
          "One Major Experiment 5",
          "5"
        ],
        [
          "One Minor Experiment 2 & 3",
          "4"
        ],
        [
          "Slide Preparation 1 & 4",
          "5"
        ],
        [
          "Spotting",
          "7"
        ],
        [
          "Practical Record + Viva Voce",
          "4"
        ],
        [
          "Investigatory Project and its Project Record + Viva Voce",
          "5"
        ],
        [
          "Total",
          "30"
        ]
      ]
    }
  ],
  "raw_content": "CBSE Class 12 Biology Syllabushas been released by the CBSE board on its official website. The CBSE board publishes the curriculum for every subject and continues to modify the course for students’ benefit. The syllabus for Class 12 Biology 2023-24 will a few changes when compared to the 2022-23 syllabus. Therefore, Class 12 students can referCBSE Syllabusfor Biology to score well in the subject. Download the CBSE Syllabus for Class 12 Biology for the academic year 2023-24 from this page.\nThe syllabus PDF includes all the essential topics that provide a clear idea to students about the curriculum. Students can directly access the CBSE Biology Syllabus for Class 12 by clicking the link provided below. The CBSE Class 12 Biology Syllabus includes units such as Reproduction, Genetics and Evolution, Biology and Human Welfare, Biotechnology and its Applications and Ecology and Environment. TheCBSE Class 12 Syllabusalso provides information about the marking scheme of each topic in Biology.\nCBSE Class 12 Biology Syllabus PDF 2023-24\nStudents can download the latest released CBSE Class 12 Biology Syllabus PDF from the link below. Going through the syllabus will help students to know the topics they are going to study in Biology during the academic year.\nCBSE Class 12 Biology Syllabus 2023-24 PDF\nDownload PDF\nCBSE Syllabus for Class 12 Biology 2023-24: Course Structure\nMentioned below is the CBSE Class 12 Biology Syllabus for 2023-24, along with the marking scheme and no. of periods. Students can get the number of chapters and subtopics under each unit in the PDF provided above.\nEvaluation Scheme (Theory)UnitsTopicsMarksVIReproduction16VIIGenetics and Evolution20VIIIBiology and Human Welfare12IXBiotechnology and its Applications12XEcology and Environment10Total Theory70Practicals30Total100\nEvaluation Scheme (Theory)\nEvaluation Scheme (Theory)\nUnitsTopicsMarks\nUnits\nTopics\nMarks\nVIReproduction16\nReproduction\nVIIGenetics and Evolution20\nVII\nGenetics and Evolution\nVIIIBiology and Human Welfare12\nVIII\nBiology and Human Welfare\nIXBiotechnology and its Applications12\nBiotechnology and its Applications\nXEcology and Environment10\nEcology and Environment\nTotal Theory70\nTotal Theory\nPracticals30\nPracticals\nTotal100\nTotal\n100\nStudents can check out the syllabus of class 1 to class 12 for all the subjects by visiting theCBSE Syllabuspage.\n2023-24 CBSE Class 12 Biology Syllabus\nUnit NameChaptersUnit-VI ReproductionChapter-1: Sexual Reproduction in Flowering PlantsChapter-2: Human ReproductionChapter-3: Reproductive HealthUnit-VII Genetics and EvolutionChapter-4: Principles of Inheritance and VariationChapter-5: Molecular Basis of InheritanceChapter-6: EvolutionUnit-VIII Biology and Human WelfareChapter-7: Human Health and DiseasesChapter-8: Microbes in Human WelfareUnit-IX Biotechnology and its ApplicationsChapter-9: Biotechnology – Principles and ProcessesChapter-10: Biotechnology and its ApplicationsUnit-X Ecology and EnvironmentChapter-11: Organisms and PopulationsChapter-12: EcosystemChapter-13: Biodiversity and Its Conservation\nUnit NameChapters\nUnit Name\nChapters\nUnit-VI ReproductionChapter-1: Sexual Reproduction in Flowering PlantsChapter-2: Human ReproductionChapter-3: Reproductive Health\nUnit-VI Reproduction\nChapter-1: Sexual Reproduction in Flowering PlantsChapter-2: Human ReproductionChapter-3: Reproductive Health\nUnit-VII Genetics and EvolutionChapter-4: Principles of Inheritance and VariationChapter-5: Molecular Basis of InheritanceChapter-6: Evolution\nUnit-VII Genetics and Evolution\nChapter-4: Principles of Inheritance and VariationChapter-5: Molecular Basis of InheritanceChapter-6: Evolution\nUnit-VIII Biology and Human WelfareChapter-7: Human Health and DiseasesChapter-8: Microbes in Human Welfare\nUnit-VIII Biology and Human Welfare\nChapter-7: Human Health and DiseasesChapter-8: Microbes in Human Welfare\nUnit-IX Biotechnology and its ApplicationsChapter-9: Biotechnology – Principles and ProcessesChapter-10: Biotechnology and its Applications\nUnit-IX Biotechnology and its Applications\nChapter-9: Biotechnology – Principles and ProcessesChapter-10: Biotechnology and its Applications\nUnit-X Ecology and EnvironmentChapter-11: Organisms and PopulationsChapter-12: EcosystemChapter-13: Biodiversity and Its Conservation\nUnit-X Ecology and Environment\nChapter-11: Organisms and PopulationsChapter-12: EcosystemChapter-13: Biodiversity and Its Conservation\nCBSE Class 12 Biology Practicals Evaluation Scheme\nIn Biology, subject practicals play an important role. Students must focus on practicals simultaneously with theory learning as it will help them understand the subject in a better way. A total of 30 marks are devoted to the practicals. Performing well in Biology Practicals will increase their overall score in Biology subject. Students can find the list of experiments of Class 12 Biology in the syllabus pdf. The table below shows the Evaluation Scheme forCBSE Class 12Practical exam.\nEvaluation SchemeMarksOne Major Experiment 55One Minor Experiment 2 & 34Slide Preparation 1 & 45Spotting7Practical Record + Viva Voce4Investigatory Project and its Project Record + Viva Voce5Total30\nEvaluation SchemeMarks\nEvaluation Scheme\nMarks\nOne Major Experiment 55\nOne Major Experiment 5\nOne Minor Experiment 2 & 34\nOne Minor Experiment 2 & 3\nSlide Preparation 1 & 45\nSlide Preparation 1 & 4\nSpotting7\nSpotting\nPractical Record + Viva Voce4\nPractical Record + Viva Voce\nInvestigatory Project and its Project Record + Viva Voce5\nInvestigatory Project and its Project Record + Viva Voce\nTotal30\nTotal\nAfter knowing the CBSE Class 12 Syllabus, students must prepare a study plan for themselves. Through this, their studies will be on track, and they could be able to finish the syllabus on time. Also, they get time to practise theCBSE Class 12 Biology previous years papersand sample papers. So, start studying from the beginning of the academic session to excel in the 12th board exam.\nGet access to interactive lessons and videos related to Maths and Science with BYJU’S App/ Tablet.Frequently Asked Questions on CBSE Class 12 Biology Syllabus 2023-24Q1Which chapter is of high marks in the CBSE Class 12 Biology Syllabus?The chapter Genetics and Evolution is of high marks in the CBSE Class 12 Biology Syllabus. Students can learn the concepts covered effectively using the study materials offered at BYJU’S.Q2What is the marks distribution for CBSE Class 12 Biology exam according to the syllabus?The marks distribution for CBSE Class 12 Biology exam, according to the syllabus, is 70 marks for theory and 30 marks for practical.Q3Where can I find the CBSE Class 12 Biology syllabus?Students can find the CBSE Class 12 Biology Syllabus for free at BYJU’S. The subject experts design the syllabus PDF to offer students with trustworthy materials to rely on.\nFrequently Asked Questions on CBSE Class 12 Biology Syllabus 2023-24\nWhich chapter is of high marks in the CBSE Class 12 Biology Syllabus?\nWhat is the marks distribution for CBSE Class 12 Biology exam according to the syllabus?\nWhere can I find the CBSE Class 12 Biology syllabus?",
  "pdf_content": "=== PDF: class_12_biology_1.pdf ===\n--- Page 1 ---\n7 \nCLASS XII (2023-24) (THEORY) \nTime: 03 Hours \nMax. Marks: 70 \nUnit \nTitle \nMarks \nVI \nReproduction \n16 \nVII \nGenetics and Evolution \n20 \nVIII \nBiology and Human Welfare \n12 \nIX \nBiotechnology and its Applications \n12 \nX \nEcology and Environment \n10 \nTotal \n70 \nUnit-VI Reproduction \nChapter-2: Sexual Reproduction in Flowering Plants \nFlower structure; development of male and female gametophytes; pollination - types, agencies and \nexamples; out breeding devices; pollen-pistil interaction; double fertilization; post fertilization \nevents - development of endosperm and embryo, development of seed and formation of fruit; \nspecial modes- apomixis, parthenocarpy, polyembryony; Significance of seed dispersal and fruit \nformation. \nChapter-3: Human Reproduction \nMale and female reproductive systems; microscopic anatomy of testis and ovary; gametogenesis \n-spermatogenesis and oogenesis; menstrual cycle; fertilisation, embryo development upto\nblastocyst formation, implantation; pregnancy and placenta formation (elementary idea);\nparturition (elementary idea); lactation (elementary idea).\nChapter-4: Reproductive Health \nNeed for reproductive health and prevention of Sexually Transmitted Diseases (STDs); birth \ncontrol - need and methods, contraception and medical termination of pregnancy (MTP); \namniocentesis; infertility and assisted reproductive technologies - IVF, ZIFT, GIFT (elementary \nidea for general awareness). \nUnit-VII Genetics and Evolution \nChapter-5: Principles of Inheritance and Variation \nHeredity and variation: Mendelian inheritance; deviations from Mendelism – incomplete \ndominance, co-dominance, multiple alleles and inheritance of blood groups, pleiotropy; \nelementary idea of polygenic inheritance; chromosome theory of inheritance; chromosomes and \ngenes; Sex determination - in humans, birds and honey bee; linkage and crossing over; sex linked \ninheritance - haemophilia, colour blindness; Mendelian disorders in humans - thalassemia; \nchromosomal disorders in humans; Down's syndrome, Turner's and Klinefelter's syndromes. \nChapter-6: Molecular Basis of Inheritance \nSearch for genetic material and DNA as genetic material; Structure of DNA and RNA; DNA \npackaging; DNA replication; Central Dogma; transcription, genetic code, translation; gene \nCBSE Class 12 Syllabus for Biology 2023-24\n\n\n--- Page 2 ---\n8 \nexpression and regulation - lac operon; Genome, Human and rice genome projects; DNA \nfingerprinting. \nChapter-7: Evolution \nOrigin of life; biological evolution and evidences for biological evolution (paleontology, \ncomparative anatomy, embryology and molecular evidences); Darwin's contribution, modern \nsynthetic theory of evolution; mechanism of evolution - variation (mutation and recombination) \nand natural selection with examples, types of natural selection; Gene flow and genetic drift; Hardy \n- Weinberg's principle; adaptive radiation; human evolution.\nUnit-VIII Biology and Human Welfare \nChapter-8: Human Health and Diseases \nPathogens; parasites causing human diseases (malaria, dengue, chikungunya, filariasis, \nascariasis, typhoid, pneumonia, common cold, amoebiasis, ring worm) and their control; Basic \nconcepts of immunology - vaccines; cancer, HIV and AIDS; Adolescence - drug and alcohol \nabuse. \nChapter-10: Microbes in Human Welfare \nMicrobes in food processing, industrial production, sewage treatment, energy generation \nand microbes as bio-control agents and bio-fertilizers. Antibiotics; production and \njudicious use. \nUnit-IX Biotechnology and its Applications \nChapter-11: Biotechnology - Principles and Processes \nGenetic Engineering (Recombinant DNA Technology). \nChapter-12: Biotechnology and its Applications \nApplication of biotechnology in health and agriculture: Human insulin and vaccine production, \nstem cell technology, gene therapy; genetically modified organisms - Bt crops; transgenic animals; \nbiosafety issues, biopiracy and patents. \nUnit-X Ecology and Environment \nChapter-13: Organisms and Populations \nPopulation interactions - mutualism, competition, predation, parasitism; population attributes - \ngrowth, birth rate and death rate, age distribution. (Topics excluded: Organism and its \nEnvironment, Major Aboitic Factors, Responses to Abioitic Factors, Adaptations) \n\n\n--- Page 3 ---\n9 \nChapter-14: Ecosystem \nEcosystems: Patterns, components; productivity and decomposition; energy flow; pyramids of \nnumber, biomass, energy (Topics excluded: Ecological Succession and Nutrient Cycles). \nChapter-15: Biodiversity and its Conservation \nBiodiversity-Concept, patterns, importance; loss of biodiversity; biodiversity conservation; \nhotspots, endangered organisms, extinction, Red Data Book, Sacred Groves, biosphere reserves, \nnational parks, wildlife, sanctuaries and Ramsar sites. \nPRACTICALS \nTime allowed: 3 Hours \nMax. Marks: 30 \nEvaluation Scheme \nMarks \nOne Major Experiment 5 \n5 \nOne Minor Experiment 2 & 3 \n4 \nSlide Preparation \n1& 4 \n5 \nSpotting \n7 \nPractical Record + Viva Voce \n(Credit to the student’s work over \nthe academic session may be \ngiven) \n4 \nInvestigatory Project and its \nProject Record + Viva Voce \n5 \nTotal \n30 \nA. List of Experiments\n1. Prepare a temporary mount to observe pollen germination.\n2. Study the plant population density by quadrat method.\n3. Study the plant population frequency by quadrat method.\n4. Prepare a temporary mount of onion root tip to study mitosis.\n5. Isolate DNA from available plant material such as spinach, green pea seeds, papaya, etc.\nB. Study and observer the following (Spotting):\n1. Flowers adapted to pollination by different agencies (wind, insects, birds).\n2. Pollen germination on stigma through a permanent slide or scanning electron micrograph.\n3. Identification of stages of gamete development, i.e., T.S. of testis and T.S. of ovary through\npermanent slides (from grasshopper/mice).\n4. Meiosis in onion bud cell or grasshopper testis through permanent slides.\n5. T.S. of blastula through permanent slides (Mammalian).\n6. Mendelian inheritance using seeds of different colour/sizes of any plant.\n7. Prepared pedigree charts of any one of the genetic traits such as rolling of tongue, blood\ngroups, ear lobes, widow's peak and colour blindness.\n8. Controlled pollination - emasculation, tagging andbagging.\n9. Common disease causing organisms like Ascaris, Entamoeba, Plasmodium, any fungus\ncausing ringworm through permanent slides, models or virtual images or specimens.\nComment on symptoms of diseases that they cause.\n\n\n--- Page 4 ---\n10 \n10. Models specimen showing symbolic association in root modules of leguminous plants,\nCuscuta on host, lichens.\n11. Flash cards models showing examples of homologous and analogous organs.\nPractical Examination for Visually Impaired Students of Classes XI and XII \nEvaluation Scheme \nTime: 02 Hours \nMax. Marks: 30 \nTopic \nMarks \nIdentification/Familiarity with the apparatus \n5 \nWritten test (Based on given / prescribed practicals) \n10 \nPractical Records \n5 \nViva \n10 \nTotal \n30 \nGeneral Guidelines \n\nThe practical examination will be of two hour duration. A separate list of ten experiments\nis included here.\n\nThe written examination in practicals for these students will be conducted at the time of\npractical examination of all other students.\n\nThe written test will be of 30 minutes duration.\n\nThe question paper given to the students should be legibly typed. It should contain a total\nof 15 practical skill based very short answer type questions. A student would be required\nto answer any 10 questions.\n\nA writer may be allowed to such students as per CBSE examination rules.\n\nAll questions included in the question paper should be related to the listed practicals. Every\nquestion should require about two minutes to be answered.\n\nThese students are also required to maintain a practical file. A student is expected to record\nat least five of the listed experiments as per the specific instructions for each subject. These\npracticals should be duly checked and signed by the internal examiner.\n\nThe format of writing any experiment in the practical file should include aim, apparatus\nrequired, simple theory, procedure, related practical skills, precautions etc.\n\nQuestions may be generated jointly by the external/internal examiners and used for\nassessment.\n\nThe viva questions may include questions based on basic theory / principle / concept,\napparatus / materials / chemicals required, procedure, precautions, sources of error etc.\nClass XII \nA.\nItems for Identification/ familiarity with the apparatus for assessment in practicals (All\nexperiments) Beaker, flask, petriplates, soil from different sites - sandy, clayey, loamy, small\npotted plants, aluminium foil, paint brush, test tubes, starch solution, iodine, ice cubes, Bunsen\nburner/spirit lamp/water bath, large flowers, Maize inflorescence, model of developmental\nstages highlighting morula and blastula of frog, beads/seeds of different shapes/size/texture\nAscaris, Cactus/Opuntia(model).\n\n\n--- Page 5 ---\n11 \nB.\nList of Practicals\n1.\nStudy of flowers adapted to pollination by different agencies (wind, insects).\n2.\nIdentification of T.S of morula or blastula of frog (Model).\n3.\nStudy of Mendelian inheritance pattern using beads/seeds of different sizes/texture.\n4.\nPreparation of pedigree charts of genetic traits such as rolling of tongue, colour blindness.\n5.\nStudy of emasculation, tagging and bagging by trying out an exercise on\ncontrolled pollination.\n6.\nIdentify common disease causing organisms like Ascaris (model)and learn some\ncommon symptoms of the disease that they cause.\n7.\nComment upon the morphological adaptations of plants found in xerophytic conditions.\nNote: The above practicals may be carried out in an experiential manner rather than recording \nobservations. \nPrescribed Books: \n1.\nBiology, Class-XII, Published by NCERT\n2.\nOther related books and manuals brought out by NCERT (consider multimedia also)\n3.\nBiology Supplementary Material (Revised). Available on CBSE website.\n\n\n--- Page 6 ---\n12 \nQuestion Paper Design (Theory) 2023-24 \nClass XII \nBiology (044) \nCompetencies \nDemonstrate Knowledge and Understanding \n50% \nApplication of Knowledge / Concepts \n30% \nAnalyse, Evaluate and Create \n20% \nNote: \n\nTypology of questions: VSA including MCQs, Assertion – Reasoning type questions; SA; LA- \nI; LA-II; Source-based/ Case-based/ Passage-based/ Integrated assessment questions.\n\nAn internal choice of approximately 33% would be provided.\nSuggestive verbs for various competencies \n\nDemonstrate, Knowledge and Understanding\nState, name, list, identify, define, suggest, describe, outline, summarize, etc.\n\nApplication of Knowledge/Concepts\nCalculate, illustrate, show, adapt, explain, distinguish, etc.\n\nAnalyze, Evaluate and Create\nInterpret, analyse, compare, contrast, examine, evaluate, discuss, construct, etc.\n",
  "pdf_urls": [
    "https://cdn1.byjus.com/wp-content/uploads/2023/04/CBSE-Class-12-Biology-Syllabus-2023-24.pdf"
  ],
  "extracted_at": "2026-01-29T11:07:19.410399",
  "pdf_local_files": [
    "syllabus/pdfs/class_12_biology_1.pdf"
  ],
  "pdf_parsed_at": "2026-01-30T13:29:27.498163"
}