{
  "url": "https://byjus.com/cbse-class-12-computer-science-syllabus/",
  "title": "",
  "description": "",
  "units": [],
  "chapters": [],
  "topics": [
    "CBSE Class 12 Computer Science Syllabus 2023-24 PDF"
  ],
  "marking_scheme": [
    {
      "headers": [
        "Unit No.",
        "Unit Name",
        "Marks",
        "Periods"
      ],
      "rows": [
        [
          "Theory",
          "Practicals"
        ],
        [
          "1.",
          "Computational Thinking andProgramming – 2",
          "40",
          "70",
          "50"
        ],
        [
          "2.",
          "Computer Networks",
          "10",
          "15",
          "–"
        ],
        [
          "3.",
          "Database Management",
          "20",
          "25",
          "20"
        ],
        [
          "",
          "Total",
          "70",
          "110",
          "70"
        ]
      ]
    },
    {
      "headers": [
        "S.No.",
        "Unit Name",
        "Marks(Total=30)"
      ],
      "rows": [
        [
          "1.",
          "Lab Test"
        ],
        [
          "Python program (60% logic + 20% documentation + 20% code quality)",
          "8"
        ],
        [
          "SQL queries (4 queries based on one or two tables)",
          "4"
        ],
        [
          "2.",
          "Report File"
        ],
        [
          "Minimum 15 Python programsSQL Queries – Minimum 5 sets using one table / two tables.Minimum 4 programs based on Python – SQL connectivity.",
          "7"
        ],
        [
          "3.",
          "Project(using concepts learnt in Classes 11 and 12)",
          "8"
        ],
        [
          "4.",
          "Vice Voce",
          "3"
        ]
      ]
    }
  ],
  "raw_content": "CBSE Class 12 Computer Science Syllabusis an important study tool for Class 12 CBSE board students. It is also important for Class 12 students to know the subject’s syllabus for the academic year 2023-24. The Class 12 CBSE Computer Science syllabus contains necessary information about the course structure and practicals the students will study in the academic year 2023-2024.CBSE Class 12students need to study all the topics mentioned in the syllabus to score good marks in their CBSE board Class 12 Computer Science examination.\nCBSE Class 12 Computer Science Syllabus 2023-24\nStudents can download the latest released CBSE Class 12 Computer Science Syllabus PDF from the link below. Going through the syllabus will help students know the topics they will study in Computer Science during the academic year.\nCBSE Class 12 Computer Science Syllabus 2023-24 PDF\nCBSE Class 12 Computer Science Syllabus with Marks Distribution\nCBSE Class 12 Computer Science Theory syllabus for the academic year 2023-24, along with the distribution of marks for each unit, is mentioned below. ThisCBSE Syllabus for Class 12also contains each unit’s marking scheme and time duration.\nUnit No.Unit NameMarksPeriodsTheoryPracticals1.Computational Thinking andProgramming – 24070502.Computer Networks1015–3.Database Management202520Total7011070\nUnit No.Unit NameMarksPeriods\nUnit No.\nUnit Name\nMarks\nPeriods\nTheoryPracticals\nTheory\nPracticals\n1.Computational Thinking andProgramming – 2407050\nComputational Thinking andProgramming – 2\n2.Computer Networks1015–\nComputer Networks\n3.Database Management202520\nDatabase Management\nTotal7011070\nTotal\n110\nCBSE Class 12 Computer Science Practical Syllabus 2023-24\nS.No.Unit NameMarks(Total=30)1.Lab TestPython program (60% logic + 20% documentation + 20% code quality)8SQL queries (4 queries based on one or two tables)42.Report FileMinimum 15 Python programsSQL Queries – Minimum 5 sets using one table / two tables.Minimum 4 programs based on Python – SQL connectivity.73.Project(using concepts learnt in Classes 11 and 12)84.Vice Voce3\nS.No.Unit NameMarks(Total=30)\nS.No.\nUnit Name\nMarks(Total=30)\n1.Lab Test\nLab Test\nPython program (60% logic + 20% documentation + 20% code quality)8\nPython program (60% logic + 20% documentation + 20% code quality)\nSQL queries (4 queries based on one or two tables)4\nSQL queries (4 queries based on one or two tables)\n2.Report File\nReport File\nMinimum 15 Python programsSQL Queries – Minimum 5 sets using one table / two tables.Minimum 4 programs based on Python – SQL connectivity.7\nMinimum 15 Python programsSQL Queries – Minimum 5 sets using one table / two tables.Minimum 4 programs based on Python – SQL connectivity.\n3.Project(using concepts learnt in Classes 11 and 12)8\nProject(using concepts learnt in Classes 11 and 12)\n4.Vice Voce3\nVice Voce\nStudents can also get theCBSE Syllabusfor Classes 1 to 12 in one place. Moreover, access interactive lessons and videos related to Maths and Science with BYJU’S App/ Tablet.Frequently Asked Questions on CBSE Syllabus for Class 12 Computer Science 2023-24Q1What units are present in the CBSE Syllabus for Class 12 Computer Science?The units present in the CBSE Syllabus for Class 12 Computer Science are computational thinking and programming – 2, computer networks and database management.Q2How many marks are given for the practical in the CBSE Syllabus for Class 12 Computer Science?The mark for the practical in the CBSE Syllabus for Class 12 Computer Science is 30. It includes lab tests, report files, projects and viva voce.Q3Why is the CBSE Syllabus for Class 12 Computer Science important for students?The CBSE Syllabus for Class 12 Computer Science is important for students who wish to perform well in their final exams. It contains all the details required to understand the crucial concepts from the exam perspective.\nFrequently Asked Questions on CBSE Syllabus for Class 12 Computer Science 2023-24\nWhat units are present in the CBSE Syllabus for Class 12 Computer Science?\nHow many marks are given for the practical in the CBSE Syllabus for Class 12 Computer Science?\nWhy is the CBSE Syllabus for Class 12 Computer Science important for students?",
  "pdf_content": "=== PDF: class_12_computer-science_1.pdf ===\n--- Page 1 ---\nComputer Science \nCLASS-XII \n Code No. 083  \n2023-24  \n1. Prerequisites\nComputer Science- Class XI\n2. Learning Outcomes\nStudent should be able to\na) apply the concept of function.\nb) explain and use the concept of file handling.\nc) use basic data structure: Stacks\nd) explain basics of computer networks.\ne) use Database concepts, SQL along with connectivity between Python and SQL.\n3. Distribution of Marks:\nUnit No. \nUnit Name \nMarks \nPeriods \nTheory \nPractical \nI \nComputational Thinking and \nProgramming – 2 \n40 \n70 \n50 \nII \nComputer Networks \n10 \n15 \n… \nIII \nDatabase Management \n20 \n25 \n20 \nTotal \n70 \n110 \n70 \n4. Unit wise Syllabus\nUnit I: Computational Thinking and Programming – 2  \n●Revision of Python topics covered in Class XI.\n●\nFunctions: types of function (built-in functions, functions defined in module, user\ndefined functions), creating user defined function, arguments and parameters, default\nCBSE Class 12 Computer Science Syllabus 2023-24\n\n\n--- Page 2 ---\nparameters, positional parameters, function returning value(s), flow of execution, scope \nof a variable (global scope, local scope)  \n●\nException Handling: Introduction, handling exceptions using try-except-finally blocks\n●\nIntroduction to files, types of files (Text file, Binary file, CSV file), relative\nand absolute paths\n●\nText file: opening a text file, text file open modes (r, r+, w, w+, a, a+), closing a text\nfile, opening a file using with clause, writing/appending data to a text file using write()\nand writelines(), reading from a text file using read(), readline() and readlines(), seek\nand tell methods, manipulation of data in a text file\n●\nBinary file: basic operations on a binary file: open using file open modes (rb, rb+, wb,\nwb+, ab, ab+), close a binary file, import pickle module, dump() and load() method,\nread, write/create, search, append and update operations in a binary file\n●\nCSV file: import csv module, open / close csv file, write into a csv file using\nwriter(),writerow(),writerows() and read from a csv file using reader()\n●\nData Structure: Stack, operations on stack (push & pop), implementation of stack\nusing list.\nUnit II: Computer Networks \n●Evolution of networking: introduction to computer networks, evolution of networking\n(ARPANET, NSFNET, INTERNET)\n●Data communication terminologies: concept of communication, components of data\ncommunication (sender,receiver, message, communication media, protocols),\nmeasuring capacity of communication media (bandwidth, data transfer rate), IP \naddress, switching techniques (Circuit switching, Packet switching)  \n●Transmission media: Wired communication media (Twisted pair cable, Co-axial cable,\nFiber-optic cable), Wireless media (Radio waves, Micro waves, Infrared waves)\n●Network devices (Modem, Ethernet card, RJ45, Repeater, Hub, Switch, Router,\nGateway, WIFI card)\n●Network topologies and Network types: types of networks (PAN, LAN, MAN, WAN),\nnetworking topologies (Bus, Star, Tree)\n●Network protocol: HTTP, FTP, PPP, SMTP, TCP/IP, POP3, HTTPS, TELNET, VoIP\n●Introduction to web services: WWW, Hyper Text Markup Language (HTML),\nExtensible Markup Language (XML), domain names, URL, website, web browser,\nweb servers, web hosting  \nUnit III: Database Management  \n●Database concepts: introduction to database concepts and its need\n●Relational data model: relation, attribute, tuple, domain, degree, cardinality, keys\n(candidate key, primary key, alternate key, foreign key)\n●Structured Query Language: introduction, Data Definition Language and Data\nManipulation Language, data type (char(n), varchar(n), int, float, date), constraints (not\nnull, unique, primary key), create database, use database, show databases, drop \ndatabase, show tables, create table, describe table, alter table (add and remove an \nattribute, add and remove primary key), drop table, insert, delete, select, operators \n(mathematical, relational and logical), aliasing, distinct clause, where clause, in, \nbetween, order by, meaning of null, is null, is not null, like, update command, delete \ncommand, aggregate functions (max, min, avg, sum, count), group by, having clause, \n\n\n--- Page 3 ---\njoins: cartesian product on two tables, equi-join and natural join  \n●Interface of python with an SQL database: connecting SQL with Python, performing\ninsert, update, delete queries using cursor, display data by using connect(), cursor(),\nexecute(), commit(), fetchone(), fetchall(), rowcount, creating database connectivity \napplications, use of %s format specifier or format() to perform queries  \n5. Practical\nS.No\nUnit Name \nMarks \n(Total=30) \n1 \nLab Test: \n1. Python program (60% logic + 20%\ndocumentation + 20% code quality)\n8 \n2. SQL queries (4 queries based on one or\ntwo tables)\n4 \n2 \nReport file:  \n●\nMinimum 15 Python programs.\n●\nSQL Queries – Minimum 5 sets using\none table / two tables.\n●\nMinimum 4 programs based on Python -\nSQL connectivity\n7 \n3 \nProject (using concepts learnt in Classes 11 \nand 12) \n8 \n4 \nViva voce \n3 \n6. Suggested Practical List:\nPython Programming \n●Read a text file line by line and display each word separated by a #.\n●Read a text file and display the number of vowels/consonants/uppercase/lowercase\ncharacters in the file.\n●Remove all the lines that contain the character 'a' in a file and write it to another file.\n●Create a binary file with name and roll number. Search for a given roll number and\ndisplay the name, if not found display appropriate message.\n●Create a binary file with roll number, name and marks. Input a roll number and update\nthe marks.\n●Write a random number generator that generates random numbers between 1 and 6\n(simulates a dice).\n\n\n--- Page 4 ---\n●Write a Python program to implement a stack using list.\n●Create a CSV file by entering user-id and password, read and search the password for\ngiven userid.\nDatabase Management \n●Create a student table and insert data. Implement the following SQL commands on the\nstudent table:\no ALTER table to add new attributes / modify data type / drop attribute\no UPDATE table to modify data\no ORDER By to display data in ascending / descending order\no DELETE to remove tuple(s)\no GROUP BY and find the min, max, sum, count and average\n●Similar exercise may be framed for other cases.\n●Integrate SQL with Python by importing suitable module.\n7. Suggested Reading Material\n●NCERT Textbook for COMPUTER SCIENCE (Class XII)\n●Support Materials on the CBSE website.\n8. Project\nThe aim of the class project is to create something that is tangible and useful using Python \nfile handling/ Python-SQL connectivity. This should be done in groups of two to three \nstudents and should be started by students at least 6 months before the submission \ndeadline. The aim here is to find a real world problem that is worthwhile to solve.  \nStudents are encouraged to visit local businesses and ask them about the problems that \nthey are facing. For example, if a business is finding it hard to create invoices for filing GST \nclaims, then students can do a project that takes the raw data (list of transactions), groups \nthe transactions by category, accounts for the GST tax rates, and creates invoices in the \nappropriate format. Students can be extremely creative here. They can use a wide variety of \nPython libraries to create user friendly applications such as games, software for their school, \nsoftware for their disabled fellow students, and mobile applications, of course to do some of \nthese projects, some additional learning is required; this should be encouraged. Students \nshould know how to teach themselves.  \nThe students should be sensitized to avoid plagiarism and violations of copyright issues while \nworking on projects. Teachers should take necessary measures for this. \n",
  "pdf_urls": [
    "https://cdn1.byjus.com/wp-content/uploads/2023/04/CBSE-Class-12-Computer-Science-Syllabus-2023-24.pdf"
  ],
  "extracted_at": "2026-01-29T11:08:59.217795",
  "pdf_local_files": [
    "syllabus/pdfs/class_12_computer-science_1.pdf"
  ],
  "pdf_parsed_at": "2026-01-30T13:29:27.147917"
}