{
  "url": "https://byjus.com/cbse-class-1-hindi-syllabus/",
  "title": "",
  "description": "",
  "units": [],
  "chapters": [],
  "topics": [],
  "marking_scheme": [],
  "raw_content": "CBSE Class 1 Hindi syllabusfor the academic year 2023-2024 is prepared by the CBSE board and covers all the important chapters that a Class 1 student should study in the respective academic year. For Class 1 students, the Hindi subject is all about reading stories with some moral information. TheCBSE Class 1 syllabusis designed in such a way that students enjoy reading all the chapters in Hindi. To download the CBSE Hindi syllabus for Class 1 students, click on the link below.\nDownload CBSE Class 1 Hindi Syllabus PDF 2023-24\nDownload PDF\nClass 1 CBSE students can download the Hindi syllabus for the academic year 2023-24 from the given link above. They can go through the chapter names mentioned below.\nCBSE Class 1 Hindi Syllabus Chapters\nBelow you will find CBSE Class 1 Hindi chapter names.\nपाठ 1:स्कूल का पहला दिन\nपाठ 2:आम की कहानी\nपाठ 3:पत्ते ही पत्ते\nपाठ 4:पकौड़ी\nपाठ 5:रसोईघर\nपाठ 6:चूहो! म्याऊँ सो रही है\nपाठ 7:बंदर और गिलहरी\nपाठ 8:पतंग\nपाठ 9:गेंद-बल्ला\nपाठ 10:बंदर गया खेत में भाग\nपाठ 11:एक बुढ़िया\nपाठ 12:मैं भी\nपाठ 13:लालू और पीलू\nपाठ 14:चकई के चकदुम\nपाठ 15:छोटी का कमाल\nपाठ 16:चार चने\nपाठ 17:भगदड़\nपाठ 18:हलीम चला चाँद पर\nपाठ 19:हाथी चल्लम चल्लम\nStudents can also access theCBSE Syllabusfor classes 1 to 12. Learn Maths & Science in an interactive & fun-loving way with BYJU’S App/Tablet.Frequently Asked Questions on CBSE Class 1 Hindi Syllabus 2023-24Q1Why should the CBSE Class 1 Hindi Syllabus be used by students?The CBSE Class 1 Hindi Syllabus offers students a good hold on basic concepts important for the exam. It increases their grammatical skills, which is important for their future education.Q2How many chapters are there in the CBSE Class 1 Hindi Syllabus?There are 19 chapters in the CBSE Class 1 Hindi Syllabus. The syllabus helps exam preparation of students to score good marks.Q3How to score 100 in the Class 1 Hindi exam as per the marks weightage in the CBSE Syllabus?Students can score 100 in the Class 1 Hindi exam as per the marks weightage in the CBSE Syllabus available at BYJU’S. The PDF is prepared by the faculty to help students memorise the concepts with ease.\nFrequently Asked Questions on CBSE Class 1 Hindi Syllabus 2023-24\nWhy should the CBSE Class 1 Hindi Syllabus be used by students?\nHow many chapters are there in the CBSE Class 1 Hindi Syllabus?\nHow to score 100 in the Class 1 Hindi exam as per the marks weightage in the CBSE Syllabus?",
  "pdf_content": "=== PDF: class_1_hindi_1.pdf ===\n--- Page 1 ---\n \n \n \n \nCBSE Class 1 Syllabus for Hindi  \n2023-24 \n \nCBSE Hindi Syllabus for Class 1 \n \nपाठ 1: स्कूल का पहला दिन \nपाठ 2: आम की कहानी \nपाठ 3: पत्ते ही पत्ते \nपाठ 4: पकौड़ी \nपाठ 5: रसोईघर \nपाठ 6: चूहो! म्याऊँ सो रही है \nपाठ 7: बंिर और दिलहरी \nपाठ 8: पतंि \nपाठ 9: िेंि-बल्ला \nपाठ 10: बंिर िया खेत में भाि \nपाठ 11: एक बुदिया \nपाठ 12: मैं भी \nपाठ 13: लालू और पीलू \nपाठ 14: चकई के चकिुम \nपाठ 15: छोटी का कमाल \nपाठ 16: चार चने \nपाठ 17: भििड़ \nपाठ 18: हलीम चला चाँि पर \nपाठ 19: हाथी चल्लम चल्लम \n \n \n \n \n \n \n \n",
  "pdf_urls": [
    "https://cdn1.byjus.com/wp-content/uploads/2023/04/CBSE-Syllabus-for-Class-1-Hindi-2023-24.pdf"
  ],
  "extracted_at": "2026-01-29T10:59:53.192281",
  "pdf_local_files": [
    "syllabus/pdfs/class_1_hindi_1.pdf"
  ],
  "pdf_parsed_at": "2026-01-30T13:29:25.560229"
}