{
  "url": "https://byjus.com/cbse-class-2-hindi-syllabus/",
  "title": "",
  "description": "",
  "units": [],
  "chapters": [],
  "topics": [],
  "marking_scheme": [],
  "raw_content": "CBSE Class 2 Hindi syllabus,prepared by the CBSE Board, covers chapters that make learning easier. All the chapters of the Hindi syllabus teach students the basics of Hindi and general stories with some moral information. Students should prepare themselves according to theCBSE Class 2 syllabusfor the academic year 2023-24.\nCBSE Class 2 Hindi Syllabus for 2023-24 Academic Year\nTo download the CBSE Hindi Syllabus for Class 2 students, click on the link below.\nDownload CBSE Class 2 Hindi Syllabus PDF for 2023-24\n2023-24 CBSE Class 2 Hindi Syllabus\nGet the latest syllabus of CBSE Class 2 Maths for the academic year 2023-24 for the benefit of the students.\nCBSE Class 2 Hindi Chapters\nपाठ 1:ऊँट चला\nपाठ 2:भालू ने खेली फुटबॉल\nपाठ 3:म्याऊँ, म्याऊँ !!\nपाठ 4:अधिक बलवान कौन?\nपाठ 5:दोस्त की मदद\nपाठ 6:बहुत हुआ\nपाठ 7:मेरी किताब\nपाठ 8:तितली और कली\nपाठ 9:बुलबुल\nपाठ 10:मीठी सारंगी\nपाठ 11:टेसू राजा बीच बाजार\nपाठ 12:बस के नीचे बाघ\nपाठ 13:सूरज जल्दी आना जी\nपाठ 14:नटखट चूहा\nपाठ 15:एक्की-दोक्की\nTo know the syllabus of other subjects from Classes 1 to 12, students can visit theCBSE Syllabuspage. Learn Maths & Science in an interactive and fun-loving way with BYJU’S App/Tablet.Frequently Asked Questions on CBSE Class 2 Hindi Syllabus 2023-24Q1What are the advantages of the CBSE Class 2 Hindi Syllabus?The CBSE Class 2 Hindi syllabus gives students a good knowledge of concepts crucial for the exam. It improves grammatical and literacy skills, which is important in their higher education levels.Q2How many chapters are there in the CBSE Class 2 Hindi Syllabus?There are 15 chapters in the CBSE Class 2 Hindi Syllabus. The syllabus smoothens exam preparation and helps students to achieve their academic goals.Q3How to score 100% in the Class 2 Hindi exam with the help of the CBSE Syllabus?Students can score 100% in the Class 2 Hindi exam by using the CBSE Syllabus available at BYJU’S.  The CBSE Class 2 Hindi Syllabus PDF is designed by experts to help students learn the concepts efficiently.\nFrequently Asked Questions on CBSE Class 2 Hindi Syllabus 2023-24\nWhat are the advantages of the CBSE Class 2 Hindi Syllabus?\nHow many chapters are there in the CBSE Class 2 Hindi Syllabus?\nHow to score 100% in the Class 2 Hindi exam with the help of the CBSE Syllabus?",
  "pdf_content": "=== PDF: class_2_hindi_1.pdf ===\n--- Page 1 ---\n \n \n \n \nCBSE Class 2 Syllabus for Hindi  \n2023-24 \n \nCBSE Hindi Syllabus for Class 2 \n \nपाठ 1: ऊँट चला \nपाठ 2: भालू ने खेली फुटबॉल \nपाठ 3: म्याऊँ, म्याऊँ !! \nपाठ 4: अधिक बलवान कौन? \nपाठ 5: दोस्त की मदद \nपाठ 6: बहुत हुआ \nपाठ 7: मेरी धकताब \nपाठ 8: धततली और कली \nपाठ 9: बुलबुल \nपाठ 10: मीठी सारंगी \nपाठ 11: टेसू राजा बीच बाजार \nपाठ 12: बस के नीचे बाघ \nपाठ 13: सूरज जल्दी आना जी \nपाठ 14: नटखट चूहा \nपाठ 15: एक्की-दोक्की \n \n \n \n \n \n \n \n \n \n \n \n",
  "pdf_urls": [
    "https://cdn1.byjus.com/wp-content/uploads/2023/04/CBSE-Syllabus-for-Class-2-Hindi-2023-24.pdf"
  ],
  "extracted_at": "2026-01-29T11:00:14.855354",
  "pdf_local_files": [
    "syllabus/pdfs/class_2_hindi_1.pdf"
  ],
  "pdf_parsed_at": "2026-01-30T13:29:26.091460"
}