{
  "url": "https://byjus.com/cbse/class-7-maths-syllabus/",
  "title": "",
  "description": "",
  "units": [
    {
      "headers": [
        "Unit",
        "Unit Name",
        "Section"
      ],
      "rows": [
        [
          "1",
          "Number System",
          "Knowing our NumbersFractions and rational numbersPowers"
        ],
        [
          "2",
          "Algebra",
          "Algebraic Expressions"
        ],
        [
          "3",
          "Ratio and Proportion",
          "Ratio and Proportion"
        ],
        [
          "4",
          "Geometry",
          "Understanding shapesProperties of trianglesSymmetryRepresenting 3-D in 2-DCongruenceConstruction (Using scale, protractor, compass)"
        ],
        [
          "5",
          "Mensuration",
          "Area"
        ],
        [
          "6",
          "Data Handling",
          "Data Handling"
        ]
      ]
    },
    {
      "headers": [
        "UNIT No.",
        "Unit Names"
      ],
      "rows": [
        [
          "Chapter 1",
          "Integers"
        ],
        [
          "Chapter 2",
          "Fractions and Decimals"
        ],
        [
          "Chapter 3",
          "Data Handling"
        ],
        [
          "Chapter 4",
          "Simple Equations"
        ],
        [
          "Chapter 5",
          "Lines and Angles"
        ],
        [
          "Chapter 6",
          "The Triangle and its Properties"
        ],
        [
          "Chapter 7",
          "Comparing Quantities"
        ],
        [
          "Chapter 8",
          "Rational Numbers"
        ],
        [
          "Chapter 9",
          "Perimeter and Area"
        ],
        [
          "Chapter 10",
          "Algebraic Expressions"
        ],
        [
          "Chapter 11",
          "Exponents and Powers"
        ],
        [
          "Chapter 12",
          "Symmetry"
        ],
        [
          "Chapter 13",
          "Visualising Solid Shapes"
        ]
      ]
    }
  ],
  "chapters": [],
  "topics": [],
  "marking_scheme": [],
  "raw_content": "CBSE Class 7 Maths Syllabusshould be referred to by students before they start their studies. It gives them an overview of the topics they will study during the academic session. Here we have provided CBSE Class 7 Maths syllabus for the students. It will help them in preparing an effective study plan. Through theCBSE Syllabus, students can easily keep track of topics they have covered and what they need to focus on.\nCBSE Class 7 Maths Syllabus for 2023-24 Academic Year\nIt is critical for CBSE Class 7 students to know the CBSE Class 7 Maths syllabus thoroughly. The question paper is designed based on the syllabus. In the exam, questions can be twisted and asked in a different way, but all the questions will be from the CBSE class 7 syllabus. No question can come out of theCBSE Class 7 Syllabus. In this regard, Maths textbooks are very helpful for students in scoring high marks in annual exams. Therefore, they can study math chapters from the textbooks with the help of their CBSE Class 7 Syllabus.\nWe have provided the CBSE 7th Class Maths in PDF format for students’ convenience. They can download it from the link mentioned below and refer to it at any time during their studies. This CBSE Class 7 Maths syllabus is the official syllabus that is released by the CBSE board on the official site. TheCBSE Class 7students who aspire to score good marks in the annual exam must study all the topics that are mentioned in the syllabus PDF given below.\nDownload CBSE Class 7 Maths Syllabus 2023-24 PDF\nDownload PDF\n2023-24 CBSE Class 7 Maths Syllabus\nThe major topics covered under CBSE Class 12 Maths Syllabus are as below.\nUnitUnit NameSection1Number SystemKnowing our NumbersFractions and rational numbersPowers2AlgebraAlgebraic Expressions3Ratio and ProportionRatio and Proportion4GeometryUnderstanding shapesProperties of trianglesSymmetryRepresenting 3-D in 2-DCongruenceConstruction (Using scale, protractor, compass)5MensurationArea6Data HandlingData Handling\nUnitUnit NameSection\nUnit\nUnit Name\nSection\n1Number SystemKnowing our NumbersFractions and rational numbersPowers\nNumber System\nKnowing our NumbersFractions and rational numbersPowers\n2AlgebraAlgebraic Expressions\nAlgebra\nAlgebraic Expressions\n3Ratio and ProportionRatio and Proportion\nRatio and Proportion\nRatio and Proportion\n4GeometryUnderstanding shapesProperties of trianglesSymmetryRepresenting 3-D in 2-DCongruenceConstruction (Using scale, protractor, compass)\nGeometry\nUnderstanding shapesProperties of trianglesSymmetryRepresenting 3-D in 2-DCongruenceConstruction (Using scale, protractor, compass)\n5MensurationArea\nMensuration\nArea\n6Data HandlingData Handling\nData Handling\nData Handling\nCBSE Syllabus for Class 7 Maths Chapter Names\nThe table below shows the chapters listed under CBSE Class 7 Maths Syllabus. Each chapter name has been linked to itsNCERT solutions, where we have provided step-by-step answers to all the exercise problems for students’ convenience. In case students get stuck while solving the questions, then they can refer to the NCERT solutions.\nUNIT No.Unit NamesChapter 1IntegersChapter 2Fractions and DecimalsChapter 3Data HandlingChapter 4Simple EquationsChapter 5Lines and AnglesChapter 6The Triangle and its PropertiesChapter 7Comparing QuantitiesChapter 8Rational NumbersChapter 9Perimeter and AreaChapter 10Algebraic ExpressionsChapter 11Exponents and PowersChapter 12SymmetryChapter 13Visualising Solid Shapes\nUNIT No.Unit Names\nUNIT No.\nUnit Names\nChapter 1Integers\nChapter 1\nIntegers\nChapter 2Fractions and Decimals\nChapter 2\nFractions and Decimals\nChapter 3Data Handling\nChapter 3\nData Handling\nChapter 4Simple Equations\nChapter 4\nSimple Equations\nChapter 5Lines and Angles\nChapter 5\nLines and Angles\nChapter 6The Triangle and its Properties\nChapter 6\nThe Triangle and its Properties\nChapter 7Comparing Quantities\nChapter 7\nComparing Quantities\nChapter 8Rational Numbers\nChapter 8\nRational Numbers\nChapter 9Perimeter and Area\nChapter 9\nPerimeter and Area\nChapter 10Algebraic Expressions\nChapter 10\nAlgebraic Expressions\nChapter 11Exponents and Powers\nChapter 11\nExponents and Powers\nChapter 12Symmetry\nChapter 12\nSymmetry\nChapter 13Visualising Solid Shapes\nChapter 13\nVisualising Solid Shapes\nWe hope students have found this information on “CBSE Class 7 Maths Syllabus” useful. Keep learning and stay tuned for further updates on CBSE and other competitive exams. Download the BYJU’S App and subscribe to the YouTube channel to access interactive Maths and Science videos.Frequently Asked Questions on CBSE Class 7 Maths Syllabus 2023-24Q1What are the chapters present in the CBSE Class 7 Maths Syllabus?The chapters present in the CBSE Class 7 Maths Syllabus are integers, fractions and decimals, data handling, simple equations, lines and angles, the triangles and their properties, comparing quantities, rational numbers, perimeter and area, algebraic expressions, exponents and powers, symmetry and visualising solid shapes.Q2What are the main concepts discussed in the CBSE Class 7 Maths Syllabus for 2023-24?The main concepts discussed in the CBSE Class 7 Maths Syllabus are number system, algebra, geometry, mensuration and data handling.Q3Can I rely on the CBSE Class 7 Maths Syllabus?Yes, students can rely on the CBSE Class 7 Maths Syllabus PDF, which is given at BYJU’S. It contains all the sufficient details necessary to help students score well in the subject.\nFrequently Asked Questions on CBSE Class 7 Maths Syllabus 2023-24\nWhat are the chapters present in the CBSE Class 7 Maths Syllabus?\nWhat are the main concepts discussed in the CBSE Class 7 Maths Syllabus for 2023-24?\nCan I rely on the CBSE Class 7 Maths Syllabus?",
  "pdf_content": "=== PDF: class_7_maths_1.pdf ===\n--- Page 1 ---\n \n \n \n \nCBSE Class 7 Syllabus for Maths  \n2023-24 \n \nNumber System (50 hrs) \n \n1. Knowing our Numbers: Integers \n \n• Multiplication and division of integers (through patterns). Division by zero is meaningless  \n \n• Properties of integers (including identities for addition & multiplication, commutative, associative, \ndistributive) (through patterns). These would include examples from whole numbers as well. Involve \nexpressing commutative and associative properties in a general form. Construction of \ncounterexamples, including some by children. Counter examples like subtraction is not \ncommutative.  \n \n• Word problems including integers (all operations) \n \n2. Fractions and rational numbers \n• Multiplication of fractions  \n \n• Fraction as an operator  \n \n• Reciprocal of a fraction  \n \n• Division of fractions  \n \n• Word problems involving mixed fractions  \n \n• Introduction to rational numbers (with representation on number line)  \n \n• Operations on rational numbers (all operations) \n \n• Representation of rational number as a decimal.  \n \n• Word problems on rational numbers (all operations)  \n \n• Multiplication and division of decimal fractions  \n \n• Conversion of units (length & mass)  \n \n• Word problems (including all operations) \n \n3. Powers \n• Exponents only natural numbers. • Laws of exponents (through observing patterns to arrive at \n\n\n--- Page 2 ---\n \n \n \n \ngeneralisation.) \n \n \nAlgebra (20 hrs)  \n1. ALGEBRAIC EXPRESSIONS \n \n• Generate algebraic expressions (simple) involving one or two variables  \n \n• Identifying constants, coefficient, powers  \n \n• Like and unlike terms, degree of expressions e.g., x y 2 etc. (exponent≤ 3, number of variables) \n \n • Addition, subtraction of algebraic expressions (coefficients should be integers).  \n \n• Simple linear equations in one variable (in contextual problems) with two operations (avoid \ncomplicated coefficients) \n \n \n2. Ratio and Proportion (20 hrs) \n• Ratio and proportion (revision)  \n \n• Unitary method continued, consolidation, general expression.  \n \n• Percentage- an introduction.  \n \n• Understanding percentage as a fraction with denominator 100  \n \n• Converting fractions and decimals into percentage and vice-versa.  \n \n• Application to profit and loss (single transaction only)  \n \n• Application to simple interest (time period in complete years). \n \n \nGeometry (60 hrs) \n1. Understanding shapes:  \n \n•Pairs of angles (linear, supplementary, complementary, adjacent, vertically opposite) \n(verification and simple proof of vertically opposite angles)  \n \n• Properties of parallel lines with transversal (alternate, corresponding, interior, exterior angles) \n \n2. Properties of triangles: \n \n• Angle sum property (with notions of proof & verification through paper folding, proofs using \n\n\n--- Page 3 ---\n \n \n \n \nproperty of parallel lines, difference between proof and verification.)  \n• Exterior angle property • Sum of two sides of a it’s third side  \n \n• Pythagoras Theorem (Verification only) \n \n3. Symmetry \n• Recalling reflection symmetry  \n \n• Idea of rotational symmetry, observations of rotational symmetry of 2-D objects. (900, 1200, \n1800)  \n \n• Operation of rotation through 900 and 1800 of simple figures.  \n \n• Examples of figures with both rotation and reflection symmetry (both operations)  \n \n• Examples of figures that have reflection and rotation symmetry and vice-versa \n \n \n4. Representing 3-D in 2-D \n• Drawing 3-D figures in 2-D showing hidden faces.  \n \n• Identification and counting of vertices, edges, faces, nets (for cubes cuboids, and cylinders, \ncones).  \n \n• Matching pictures with objects (Identifying names) \n \n• Mapping the space around approximately through visual estimation. \n \n \n5. Congruence \n• Congruence through superposition (examples, blades, stamps, etc.) \n \n• Extend congruence to simple geometrical shapes e.g. triangles, circles.  \n \n• Criteria of congruence (by verification) SSS, SAS, ASA, RHS \n \n \n6. Construction (Using scale, protractor, compass) \n \n• Construction of a line parallel to a given line from a point outside it (Simple proof as remark \nwith the reasoning of alternate angles)  \n \n• Construction of simple triangles. Like given three sides, given a side and two angles on it, \ngiven two sides and the angle between them. \n \n \n\n\n--- Page 4 ---\n \n \n \n \n \nMensuration (15 hrs) \n \n• Revision of perimeter, Idea of , Circumference of Circle \n \nArea  \nConcept of measurement using a basic unit area of a square, rectangle, triangle, parallelogram \nand circle, area between two rectangles and two concentric circles \n \n \nData handling (15 hrs) \ni) \nCollection and organisation of data – choosing the data to collect for a hypothesis testing.  \n \nii) \nMean, median and mode of ungrouped data – understanding what they represent.  \n \niii) \nConstructing bargraphs  \n \niv) \nFeel of probability using data through experiments. Notion of chance in events like \ntossing coins, dice etc. Tabulating and counting occurrences of 1 through 6 in a number \nof throws. Comparing the observation with that for a coin. Observing strings of throws, \nnotion of randomness. \n \n",
  "pdf_urls": [
    "https://cdn1.byjus.com/wp-content/uploads/2023/04/CBSE-Syllabus-for-Class-7-Maths-2023-24.pdf"
  ],
  "extracted_at": "2026-01-29T11:02:00.853856",
  "pdf_local_files": [
    "syllabus/pdfs/class_7_maths_1.pdf"
  ],
  "pdf_parsed_at": "2026-01-30T13:29:27.709876"
}