{
  "url": "https://byjus.com/cbse-class-9-english-syllabus/",
  "title": "",
  "description": "",
  "units": [],
  "chapters": [],
  "topics": [],
  "marking_scheme": [
    {
      "headers": [
        "Sections",
        "Topics",
        "Marks"
      ],
      "rows": [
        [
          "A",
          "Reading Skills",
          "20"
        ],
        [
          "B",
          "Writing Skills",
          "24"
        ],
        [
          "C",
          "Grammar",
          "10"
        ],
        [
          "D",
          "Literature Textbook",
          "26"
        ],
        [
          "",
          "Theory Total",
          "80"
        ],
        [
          "",
          "Internal Assessment",
          "20"
        ],
        [
          "",
          "Total",
          ""
        ]
      ]
    },
    {
      "headers": [
        "Sections",
        "Topics",
        "Marks"
      ],
      "rows": [
        [
          "A",
          "Reading Skills",
          "20"
        ],
        [
          "B",
          "Writing Skills with Grammar",
          "20"
        ],
        [
          "C",
          "Language through Literature",
          "40"
        ],
        [
          "",
          "Theory Total",
          "80"
        ],
        [
          "",
          "Internal Assessment",
          "20"
        ],
        [
          "",
          "Total",
          "100"
        ]
      ]
    }
  ],
  "raw_content": "CBSE Syllabus for Class 9 Englishhas been released by the CBSE board on their official website. Check out the syllabus for students to learn the English language in an effective way. Referring to CBSE Class 9 English syllabus will help them improve their writing and grammatical skills. Also, it will help in uplifting students’ overall percentage in their Class 9 final exams. CBSE Syllabus for Class 9 English for the academic year 2023-24 covers all the important topics and subtopics as per the guidelines of the CBSE Board. The syllabus for the year 2023-24 will not have major changes when compared to the 2022-23 syllabus. Students can also boost their writing section by practisingunseen passages for Class 9andessayson different topics.\nStudents of Class 9 CBSE Board are advised to properly understand the English syllabus because the final question paper will be prepared based on the syllabus prescribed by the board. TheCBSE Syllabusalso provides information about the course structure, assignments, marking scheme and time duration.\nCBSE Class 9 English Syllabus 2023-24\nStudents can download the latest released CBSE Class 9 English Syllabus for the academic year 2023-24 from the link below.\nCBSE Class 9 English Communicative Syllabus 2023-24 PDF\nDownload PDF\nCBSE Class 9 English Language and Literature Syllabus 2023-24 PDF\nDownload PDF\nCBSE Class 9 Communicative English Syllabus Topics\nStudents can have a look at the sections, topics and marks required for completing the Communicative English Syllabus from the table below:\nSectionsTopicsMarksAReading Skills20BWriting Skills24CGrammar10DLiterature Textbook26Theory Total80Internal Assessment20Total\nSectionsTopicsMarks\nSections\nTopics\nMarks\nAReading Skills20\nReading Skills\nBWriting Skills24\nWriting Skills\nCGrammar10\nGrammar\nDLiterature Textbook26\nLiterature Textbook\nTheory Total80\nTheory Total\nInternal Assessment20\nInternal Assessment\nTotal\nTotal\nCBSE Class 9 English Language and Literature Syllabus Topics\nStudents can have a look at the sections, topics and no. of periods required for completing the English Language and Literature Syllabus from the table below:\nSectionsTopicsMarksAReading Skills20BWriting Skills with Grammar20CLanguage through Literature40Theory Total80Internal Assessment20Total100\nSectionsTopicsMarks\nSections\nTopics\nMarks\nAReading Skills20\nReading Skills\nBWriting Skills with Grammar20\nWriting Skills with Grammar\nCLanguage through Literature40\nLanguage through Literature\nTheory Total80\nTheory Total\nInternal Assessment20\nInternal Assessment\nTotal100\nTotal\n100\nTo know the syllabus of all the subjects of Class 9, go through theCBSE Syllabus for Class 9page at BYJU’S. Learn Maths & Science in an interactive and fun-loving way with BYJU’S App/Tablet.",
  "pdf_content": "=== PDF: class_9_english_1.pdf ===\n--- Page 1 ---\nPage 1 of 18 \nCOMMUNICATIVE ENGLISH \n(Code No. 101)  \n2023-24 \nI. \nIntroduction:\nAcquiring a language means, above all, acquiring a means to communicate confidently and naturally. In other \nwords, in order to communicate effectively in real life, students need more than mere knowledge about the \nlanguage. In addition, they must be able to use the language effectively, with confidence and fluency. \nTherefore, the course in Communicative English has been designed to develop the practical language \ncommunication skills needed for academic study and subsequent adult life. \nThe course brings together a number of ideas about the nature of language and language learning. \nKnowledge and Skill \nOne of the tenets of the communicative approach is the idea that Language is a skill to be acquired, not \nmerely a body of knowledge to be learnt. Acquiring a language has been compared to learning to drive. It is \nnot enough to have only a theoretical knowledge of how an engine works: you must know how to use the \ngears and (crucially) how to interact with other road users. Similarly, simply knowing parts of speech or how \nto convert the active into the passive voice does not mean you are proficient in a language. You must be able \nto put knowledge into practice in everyday language use. Of course, we do not expect a novice driver to move \noff without preparation: the driver has rules of the highway which he/she must learn by rote. But there is no \nsubstitute for learning by doing, albeit in the artificial conditions of a deserted road at slow speeds. Equally in \nlanguage learning there are some ‘rules to be learnt’ but there is no substitute for learning by doing. In good \nteaching, this experience is supported by carefully-graded, contextualized exercises. \nStructure and Function \nLanguage can be described in different ways. Obviously we can label an utterance according to its \ngrammatical structure. Another approach is to decide what function it performs. Consider the following: \na)\n“Can I open the window?”\nb)\n“Can I carry that case?”\nwe could say that a) and b) have the same grammatical structure: they are both interrogative sentences. We \nshould also recognize that they perform different functions: a) is a ‘request’ b) is an ‘offer’. \nThe course aims to recognize the use to which language is put and encourages pupils to be aware of the \nrelationship between structure and function. \nThe overall aims of the course are to: \n(a) enable the learner to communicate effectively and appropriately in real-life situations;\n(b) use English effectively for study purposes across the curriculum;\n(c) develop and integrate the use of the four language skills, i.e., listening, speaking, reading and writing;\n(d) develop interest in and appreciation of literature;\n(e)\nrevise and reinforce structures already learnt.\nCBSE Class 9 Communicative English Syllabus 2023-24\n\n\n--- Page 2 ---\nPage 2 of 18 \nTo develop creativity, students should be encouraged to think on their own and express their ideas using their \nexperience, knowledge and imagination, rather than being text or teacher dependent. Students should be \nencouraged to monitor their progress, space out their learning, so they should be encouraged to see language \nnot just as a functional tool, but as an important part of personal development and inculcation of values. \nII.\nObjectives\n     READING \nBy the end of the course, students should be able to: \n1.\nread silently at varying speeds depending on the purpose of reading;\n2.\nadopt different strategies for different types of text, both literary and non-literary;\n3.\nrecognise the organization of a text;\n4.\nidentify the main points of a text;\n5.\nunderstand relations between different parts of a text through lexical and grammatical cohesive\ndevices;\n6.\nanticipate and predict what will come next in a text;*\n7.\ndeduce the meaning of unfamiliar lexical items in a given context;\n8.\nconsult a dictionary to obtain information on the meaning and use of lexical items;*\n9.\nanalyse, interpret, infer (and evaluate) the ideas in the text;\n10.\nselect and extract, from a text, information required for a specific purpose (and record it in note form);\n11.\ntranscode information from verbal to diagrammatic form;\n12.\nretrieve and synthesize information from a range of reference materials using study skills such as\nskimming and scanning;\n13.\ninterpret texts by relating them to other material on the same theme (and to their own\nexperience and knowledge);\n14.\nread extensively on their own.\nWRITING \nBy the end of the course, students should be able to: \n1.\nexpress ideas in clear and grammatically correct English, using appropriate punctuation and cohesive\ndevices;\n2.\nwrite in a style appropriate for communicative purposes;\n3.\nplan, organise and present ideas coherently by introducing, developing and concluding a topic;\n4.\nwrite a clear description (e.g., of a place, a person, an object or a system);\n5.\nwrite a clear account of events (e.g., a process, a narrative, a trend or a cause-effect relationship);\n6.\ncompare and contrast ideas and arrive at conclusions;\n\n\n--- Page 3 ---\nPage 3 of 18 \n7.\npresent an argument, supporting it with appropriate examples;\n8.\nuse an appropriate style and format to write letters (formal and informal), biographical sketches,\ndialogues, speeches, reports, articles, e-mails and diary entries;\n9.\nmonitor, check and revise written work;\n10.\nexpand notes into a piece of writing;\n11.\nsummarise or make notes from a given text; and\n12.\ndecode information from one text type to another (e.g., diary entry to letter, advertisement to report,\ndiagram to verbal form).\n(* Objectives which will not be tested in a formal examination) \nLISTENING \nBy the end of the course, students should be able to: \n1.\nadopt different strategies according to the purpose of listening (e.g., for pleasure, for general interest,\nfor specific information);\n2.\nuse linguistic and non-linguistic features of the context as clues to understanding and interpreting what\nis heard (e.g., cohesive devices, key words, intonation, gesture, background noises);\n3.\nlisten to a talk or conversation and understand the topic and main points;\n4.\nlisten for information required for a specific purpose, e.g., in radio broadcast, commentaries, airport and\nrailway station announcements;\n5.\ndistinguish main points from supporting details, and relevant from irrelevant information;\n6.\nunderstand and interpret messages conveyed in person or on telephone;\n7.\nunderstand and respond appropriately to directive language, e.g., instruction, advice, requests and\nwarning;\n8.\nunderstand and interpret spontaneous spoken discourse in familiar social situations.\nSPEAKING \nBy the end of the course, students should be able to: \n1.\nspeak intelligibly using appropriate word stress, sentence stress and intonation patterns;\n2.\nadopt different strategies to convey ideas effectively according to purpose, topic and audience\n(including the appropriate use of polite expressions);\n3.\nnarrate incidents and events, real or imaginary in a logical sequence;\n4.\npresent oral reports or summaries; make announcements clearly and confidently;\n5.\nexpress and argue a point of view clearly and effectively;\n6.\ntake active part in group discussions, showing ability to express agreement or disagreement, to\nsummarise ideas, to elicit the views of others, and to present own ideas;\n7.\nexpress and respond to personal feelings, opinions and attitudes;\n\n\n--- Page 4 ---\nPage 4 of 18 \n8.\nconvey messages effectively in person or on telephone;\n9.\nframe questions so as to elicit the desired response, and respond appropriately to questions;\n10.\nparticipate in spontaneous spoken discourse in familiar social situations.\nGRAMMAR \nBy the end of the course, students should be able to use the following accurately and appropriately in context: \n1.\nVerbs :-\n\npresent/past forms\n\nsimple/continuous forms\n\nperfect forms\n\nfuture time reference\n\nmodals\n\nactive and passive voice\n\nsubject-verb concord\n\nnon-finite verb forms (infinitives and participles)\n2.\nSentence Structure :-\n\nconnectors\n\ntypes of sentences\n\naffirmative/interrogative sentences/  negation\n\nexclamations\n\ntypes of phrases and clauses\n-\nfinite and non-finite subordinate clauses\n-\nnoun clauses and phrases\n-\nadjective clauses and phrases\n-\nadverb clauses and phrases\n-\nindirect speech\n-\ncomparison\n-\nnominalization\n3.\nOther Areas :-\n\ndeterminers\n\npronouns\n\nprepositions\nLITERATURE \nBy the end of the course, students should be able to comprehend, interpret, analyse, infer and evaluate the \nfollowing features in a literary text: \n1 \nCharacter as revealed through \n\nappearance and distinguishing features\n\nsocio-economic background\n\naction/events\n\nexpression of feelings\n\nspeech and dialogues\n\n\n--- Page 5 ---\nPage 5 of 18 \n2 \nPlot/Story/Theme emerging through main events \n\nprogression of events and links between them\n\nsequence of events denoting theme\n3 \nSetting, as seen through time and place, socio-economic and cultural background, people beliefs and \nattitudes. \n4 \nForm \n\nrhyme\n\nrhythm\n\nsimile\n\nmetaphor\n\npun\n\nrepetition\nIII.\nRole of the Teacher\nUnlike a teacher-centered classroom, where the teacher plays a dominant role, speaks most of the time, and \ninteracts with the class as a whole, for the success of this course teachers will need to adopt a variety of \nroles. Teachers may note  that the number of periods given in this document is suggestive , as overlapping \nof skills may happen during classroom-transaction.  \nLittlewood1 sets out the roles as follows: \n•\nAs a general overseer of his/ her students’ learning, the teacher must aim to coordinate the activities so\nthat they form a coherent progression, leading towards greater communicative ability.\n•\nAs a classroom manager, he/ she is responsible for grouping activities into ‘lessons’ and for ensuring that\nthese are satisfactorily organized at a practical level.\n•\nIn many activities, he/ she may perform the familiar role of language instructor: he/ she will present new\nlanguage, exercise direct control over the learner’s performance, evaluate and correct it, and so on.\n•\nIn others, he/ she will not intervene after initiating the proceedings, but will let learning take place through\nindependent activity or pair and group work.\n•\nWhen such an activity is in progress s/he may act as a consultant or adviser, helping where necessary.\nHe/ She may also move about the classroom in order to monitor the strengths and weaknesses of the\nlearners, as a basis for planning future learning activities.\n•\nHe /She will sometimes wish to participate in an activity as co-communicator with the learners. In this role,\nhe/ she can simulate and present new language without taking the main initiative for learning away from\nthe learners themselves.\nIV.\nClassroom Procedures\nThe main types of classroom organization recommended are individual work, pair work, small group work \nand whole class work. It has been the experience of teachers that students adapt themselves very quickly to \nthe new classroom arrangements, and the interesting nature of the activities themselves produce discipline. \nThe following sections give practical advice on organization of different types of classroom activities. \n1 Littlewood, W. (1981). Communicative language teaching. Cambridge: Cambridge University Press. \n\n\n--- Page 6 ---\nPage 6 of 18 \nIndividual Work \nWhen an activity is designed for individual work, students will be working mainly on their own. First, ask \nstudents to read the instructions (or read them aloud to the students). Make sure that students understand \nwhat they are expected to do, if necessary by giving an example or (preferably) asking one of the students to \ngive an example. Then set them to do the activity. \nWhile students do the activity, the teacher can move around the classroom, making sure that everything is \ngoing smoothly and giving individual help where it is needed. Do not interfere too much; remember that too \nmuch interruption and correction may discourage students. \nStudents will work at different speeds, so they will not all finish at the same time. The easiest solutions to this \nis to ask students who have finished to compare their answers with their neighbours’. Call the class together \nagain when the majority of them have finished the activity, even if some are still working on it. The activity \ncan then be checked by asking students to give their answers. The teacher needn’t act as the ‘judge’, but \ninstead can ask other students whether they agree. This checking procedure keeps all students involved, and \ngives the slower ones a chance to catch up. \nPair Work \nAs with individual work, you first need to make sure that students understand the instructions. Once the \nactivity is clear, you will then have to arrange the class in pairs. Usually it is easiest if a student pairs up with \nthe person sitting at the same desk. (You may have to move one or two if they are on their own.) \nSometimes it will be necessary to have three working together, but this should not seriously affect their work. \n\n\n--- Page 7 ---\nPage 7 of 18 \nIf your class is very crowded, with most students sitting three to a desk, one row may turn to face those \nbehind to form three pairs. \nOnce students have settled down to work, circulate round the classroom, observing and listening to them, \nand giving help to those who need it. As with individual work, resist the temptation to interfere too much! \nYou may find it useful to set a time limit for pair work activity. This can help to focus the students’ attention \nand provide a challenge, as well as simplify management of the class. If you wish to do this, tell them the time \nlimit before they begin, and be prepared to extend or reduce  if you find you have misjudged the time required. \nIn many pair work tasks, checking can be carried out in the same way as for individual work by the teacher \neliciting answers from the students. Sometimes, though, it may be better for one or more pairs of students to \nreport back their conclusions to the rest of the class, possibly with a class discussion. \nGroup work \nUsually, group work, involves four students but at times it may extend to five or six or even more. Four, \nhowever, is a more convenient number for most classroom situations. \nThe general procedure for group work is the same as for pair work, that is: \n-\ninstructions for the whole class\n-\norganization of the groups\n-\ngroup activity while the teacher circulates\n-\nfeedback and checking for the whole class\n\n\n--- Page 8 ---\nPage 8 of 18 \nThe major difference is that the organization of the groups needs more care. It is fairly simple to form groups \nof four by asking students to turn and face those behind. \nHowever, you may feel that some changes are required to achieve a balance in some of the groups. In this \ncase, move only a few students from one group to another. When the groups move over to the feedback and \nchecking stage, you may make it more interesting by asking a student to chair the inter-group discussion. \nWhole Class Work \nWhole class work, of course, is necessary for maters such as formal instruction (e.g. the format of formal and \ninformal letters), for “warm-up” activities, for class discussion, for “class review” sessions at the close of pair \nwork or group work. During the whole class work, the teacher is in her traditional role. \nV.\nHandling Pair Work and Small Group Work (PW/SGW)\nIntroducing and Demonstrating \nAfter a brief explanation of what is to be done, always demonstrate the activity. You have these options: \n-\nThe teacher takes both (for all) parts.\n-\nThe teacher takes one part, while one or more students take the other parts.\n-\nTwo or more students take different parts.\nIn selecting students to help demonstrate an activity, always select those who will demonstrate it well. Also, \nchoose students from different parts of the classroom (particularly from the back), so that they will have to \nspeak loudly in order to be heard. (Don’t choose students sitting side-by-side, or they will speak so softly to \neach other that nobody else will hear!) Don’t allow this phase to take too much time – two or three minutes is \nusually enough. \nOrganising \nThis has largely been covered in the Section B.3.above. A few additional points: \n-\nThere is no need to move chairs and desks, and only a very few students will need to move places. For\nthe most part, students simply face in a different direction in order to form pairs and small groups.\n\n\n--- Page 9 ---\nPage 9 of 18 \n-\nThe teacher is responsible for deciding who is to work with whom. (Don’t leave it to students to decide, or\nthe result will be confusion.)\n-\nYou may also prefer to allocate roles yourself, e.g. “When pairs, the one nearest the window is A, the\nother is B.”\n-\nIf you have not used PW/SGW before, expect a little, noise and excitement at first! But students quickly\nget used to the new procedures and soon settle down with minimum noise and fuss.\nManaging \nWhile students are actually doing the PW/SGW activity, the teacher has an important role to play. It is vital to \nmove round the class, listening in on PW / SGW and helping / advising where necessary. Be careful, of \ncourse, not to “take over” the activity by intervening too strongly. (Students need the English language \npractice, not you!) Sometimes it is advisable to just ‘hover’ at a distance while moving round the class, simply \nchecking that students are actually doing the activity. Make sure that you distribute your attention evenly over \nthe course of a term; and give particular help and attention to weaker students. \nConcluding \nAt the close of a PW/SGW activity, bring the whole class together. You may wish to ask a pair or group to \ndemonstrate what they have done at the front of the class. (Ask weaker pairs or groups to demonstrate, too. \nThis can be a powerful confidence-builder). Alternatively, you may find a brief class discussion   profitable, in \nwhich students exchange experiences that have arisen from the activity itself, e.g. a problem they have \nencountered, a good idea someone came up with, something they did not understand. Be careful not to allow \nthis conclusion phase to take too much time – 5 minute is plenty. \nMany teachers view with alarm the prospect of pair work and small group work with a large number of \nstudents. The following are concerns commonly expressed together with the responses of experienced \nteachers: \nVI.\nSome questions and answers about Pair Work and Small Group Work\nFor many teachers, the prospect of PW/SGW with large numbers of students in a class is viewed with alarm. \nTo help such teachers, the following are concerns expressed, followed by responses that have been given \nby other teachers. \nTeachers’ concerns about PW/SGW \n-\nIt is difficult for the teacher to check whether all students are doing the activity, and (if so) whether they are\nproducing correct and suitable English.\n-\nMore proficient pupils take over weaker pupils.\n-\nNoise levels are high.\n-\nIt is not right for the teacher to withdraw from a position of “central control”\n-\nPW/SGW will be rejected by other teachers, parents and by the students themselves as a waste of time\nand frivolous.\nResponses to these Concerns \n-\nIn traditional teacher-led classes, often individual students are not actively participating, but the teacher\nremains unaware of this, if a sufficient students seem to be ‘following the lesson’.\n\n\n--- Page 10 ---\nPage 10 of 18 \n-\nNoise is a necessary element of good language learning – as it is in a Music lesson. It is not so much\nnoise itself that some teachers are concerned about, but the amount of noise. There is no easy answer\nto this question, since a lot depends on the individual teacher’s relationship with the class. Certainly a\nclear introduction to and demonstration of the task will ensure that PW/SGW gets off to a good start, with\nno fuss and confusion. And the challenge of the task itself should ensure that students are busily engaged\nin the English class. It is for the teacher to make it clear to the class what amount of noise is acceptable,\nand to make sure that noise is kept to that level. If noise levels do get too high for comfort, the “noisy\napproach” (i.e. the teacher shouting to get less noise) is unlikely to work for any more than a short while.\nInstead, try the “quiet approach”, i.e. train your students to recognize that when your hand is raised, they\nmust raise theirs and be more quiet. On occasions, you may have to speak to particularly noisy and\nexcited groups. Please do not let the prospect of some degree of noise put you off PW/SGW. If students\nare to learn to use English, then they must communicate with each other, not just you. And if they are to\ncommunicate, then     there will be a certain amount of positive, beneficial noise. Welcome it as a sign\nthat your students are growing in confidence and fluency in English.\n-\nIt is perfectly true that in PW/SGW the teacher cannot judge whether all students are producing correct\nand suitable English. (Of course, this is equally true of a teacher-led classroom where one student is\nspeaking (to you), and all the others are silent.) But we need to accept that making mistakes in language\nis not only normal, but is actually necessary if a learner is to make progress. Advice on what to do about\nstudents’ mistakes when speaking in PW/SGW is given in Section C.6.\n-\nP/SGW encourages all students, even the shy ones, to participate actively. Because they feel they are\nnot “on show” in front of the whole class, they feel free to experiment with the language, trying out newly-\nacquired forms.\n- Much research in psycholinguistics in recent years has indicated that peer interaction of this kind in\nlanguage classes is frequently highly successful. Not all students, even those in the same class, have\nprecisely the same stock of knowledge and understanding of the language. Students can pool ideas and\noften perform a task better together than they can alone. As they become more familiar with PW/SGW,\nthey learn to handle activities in a mature manner, sensitively correcting each other’s work. In fact, research\nshows that appropriate error correction in well graded activities is just as likely to occur between students\nas by the teacher in a teacher-led mode.\n-\nIf a good student is paired with a less able one, the former is likely to assume the role of a ‘teacher’. This\nexperience is often fruitful for both. The less able student has a ‘personal tutor’, and the good student also\nimproves: having to explain something in simple terms is often an excellent learning experience in itself.\n-\nIf a task is well-constructed and the students appropriately prepared, the activity often creates ‘peer\npressure’ to induce reluctant group members to participate.\n-\nPW/SGW is an attempt to encourage students to accept some of the responsibility for learning\nthemselves. The only truly successful students are the ones who can do this. If the technique is handled\nwell, it will soon become evident that the teacher is working just as hard as she/he does in a teacher-led\nmode. PW/SGW is one of a number of different techniques which a teacher can employ to accommodate\nstudents with different learning styles and for activities with different goals.\n\n\n--- Page 11 ---\nPage 11 of 18 \nCOMMUNICATIVE ENGLISH (Code NO. 101) \nCLASS – IX \n2023-24 \nSECTION-WISE WEIGHTAGE \nSECTION A: READING SKILLS \n(10+10=20 Marks) \n40 Periods \n• The section will have two unseen passages with the maximum word limit of 600 words. The passages can\nbe of any two types out of the following: literary / factual / discursive. Please refer to the Main Course Book.\nObjective Type Questions (including Multiple Choice Questions), and Very Short Answer type Questions\nwill be asked to test inference, evaluation, analysis and vocabulary in context.\nSECTION B: WRITING SKILLS \n 24 Marks \n50 Periods \nThis section will have a variety of short and long writing tasks. \n•\nNotice Writing for school assembly/ Resident Welfare Association/ School Events/ Classroom information\netc. (maximum 50 words) \n4 Marks \n•\nDialogue Writing, (maximum 100 words)\n5 Marks \n•\nInformal Letter (maximum 120 words)\n7 Marks \n• Paragraph on one out of two themes from the Main Course Book, based on verbal or visual cues (maximum\n150 words) \n8 Marks \nSECTION C: GRAMMAR \n 10 Marks \n 20 Periods \nGrammar items will be taught and assessed over a period of time. \n1. Tenses\n2. Modals\n1.\nSubject – verb concord\n2.\nReported Speech\n(i)\nCommands and Requests\nSection Title \nTotal Weightage \nA \nReading Skills \n20 \nB \nWriting Skills \n24 \nC \nGrammar \n10 \nD \nLiterature Textbook \n26 \nTOTAL \n80 \n\n\n--- Page 12 ---\nPage 12 of 18 \n(ii)\nStatements\n(iii)\nQuestions\n3.\nClauses:\n(i)\nNoun clauses\n(ii)\nAdverb clauses\n(iii)\nRelative clauses\n4.\nDeterminers\nThe above items may be tested through test types as given below: \n•\nGap filling\n3 marks \n•\nEditing or Omission\n4 marks \n•\nSentences Reordering or Sentence Transformation in context.\n3 marks \nSECTION D: LITERATURE TEXTBOOK \n26 Marks \n 50 Periods \n• Two out of three extracts from prose/poetry for reference to the context. Very Short Answer Questions and\nShort Answer Questions will   be asked to assess local and global comprehension, interpretation and\nanalysis.               \n \n                                                                                                   8 marks (4+4)\n• Six Short Answer Questions out of seven, from the Literature Reader, to test local and global comprehension\nof theme and ideas, analysis and evaluation (30-40 words each)  \n                             2x6 = 12 Marks\n• One out of two Long Answer type Questions to assess how the values inherent in the text have been brought\nout. Creativity, imagination and extrapolation beyond the text and across the texts will be assessed. This\ncan also be a passage-based question taken from a situation/plot from the texts. (120 words).\n6 marks \nPrescribed Books: Interact in English Series by CBSE (Available on www.cbseacademic.nic.in) \n•\nMain Course Book (Revised Edition)\n•\nLiterature Reader (Revised Edition)\n•\nWorkbook (Revised Edition)\nNOTE: Teachers are advised to: \ni. encourage classroom interaction among peers, students and teachers through activities such as role play,\ngroup work etc.,\nii. reduce teacher-talk time and keep it to a minimum,\niii. take up questions for discussion to encourage pupils to participate and to marshal their ideas and express\nand defend their views.\nAssessment of Listening and Speaking Skills: 50 Periods \nGuidelines for the Assessment of Listening and Speaking Skills are given at Annexure I. \n\n\n--- Page 13 ---\nPage 13 of 18 \nQuestion Paper Design \nCommunicative English \n(CODE NO. 101) \n2023-24 \n    CLASS IX \nTIME: 3 Hours \n Max. Marks: 80 \nS.No\nCompetencies \n% Weightage \n1 \nDemonstrative \nKnowledge \n+ \nUnderstanding \n(Knowledge based simple recall questions, to know \nspecific facts, terms, concepts, principles or theories, \nidentify, define, or recite, information, comprehension – \nto be familiar with meaning and to understand \nconceptually, interpret, compare, \ncontrast, explain, paraphrase information) \nUp to 30% \n2 \nConceptual Application (Use abstract information in \nconcrete situation, to apply knowledge to new situations; \nuse given content to interpret a situation, provide an \nexample or solve a problem) \nUp to 35% \n3 \n Analysis, Evaluation and Creativity Analysis & \nSynthesis- classify, compare, contrast, or differentiate \nbetween different pieces of information; organize and/or \nintegrate unique pieces of information \nfrom a variety of sources. \nUp to 35% \nTotal \n100% \nFor the details of Internal Assessment of 20 marks, please refer to circular no. \nAcad-11/2019, dated March 06,2019. \n\n\n=== PDF: class_9_english_2.pdf ===\n--- Page 1 ---\nPage 1 of 14 \nENGLISH LANGUAGE AND LITERATURE \nCode No. 184 \n2023-24 \n1. Background\nAt the secondary stage of English language learning the textual materials and other resources \nshould represent a wide range of learning experience. Literature has always played a significant \nrole in learning language. However, it is felt that pupils should be apprised with contemporary \nissues, read authentic literature and experiences of people to reflect and build their personality \ntraits. \nWhile there is a trend for inclusion of a wider range of contemporary and authentic texts, \naccessible and culturally appropriate pieces of literature should play a pivotal role at the \nsecondary stage of education. The English class is meant for reading literature from different \nperspectives and to engage in activities for developing communicative competence, creativity \nand enrichment of language skills It should not be seen as a place merely to read poems and \nstories in, but an area of activities to develop the learner’s imagination as a major aim of language \nstudy, and to equip the learner with communicative skills to perform various language functions \nthrough speech and writing. \n2. Objectives:\nObjectives of the course are to enable learners to: \n• build greater confidence and proficiency in oral and written communication\n• develop the ability and knowledge required in order to engage in independent\nreflection and inquiry\n• make appropriate usage of English language\n• to communicate in various social settings\n• equip learners with essential language skills to question and to articulate their point of view\n• build competence in the different aspects of the Language\n• develop sensitivity to, and appreciation of world literature representing varieties of\nEnglish and cultures embedded in lt.\n• enable the learner to access knowledge and information through reference\nskills (consulting a dictionary / thesaurus, library, internet, etc.)\n• develop curiosity and creativity through extensive reading\n• facilitate self-learning to enable them to become independent learners\n• review, organise and edit their own work and work done by peers\n• integrate listening and speaking skills in the curriculum.\n• give a brief oral description of events / incidents of topical interest\n• retell the contents of authentic audio texts (weather reports, public announcements,\n CBSE Class 9 English Language and Literature Syllabus \n2023-24\n\n\n--- Page 2 ---\nPage 2 of 14 \nsimple advertisements, short interviews, etc.) \n• participate in conversations, discussions, etc., on topics of mutual interest in non-classroom\nsituations\n• narrate a story which has been depicted pictorially or in any other non-verbal mode\n• respond, in writing, to business letters, official communications email etc.\n• read and identify the main points / significant details of texts like scripts of\naudio-video interviews, discussions, debates, etc.\n• write without prior preparation on a given topic and be able to defend or explain the\nstand taken / views expressed in the form of article, speech, or a debate\n• write a summary of short lectures on familiar topics by making / taking notes\n• write an assessment of different points of views expressed in a discussion / debate\n• read poems effectively (with proper rhythm and intonation)\n• transcode information from a graph / chart to a description / report and write a\ndialogue, short story or report\n• Develop appreciation for Indian languages(multilingualism), translations and Indian\nLiterature.\n3. Language Items\nIn addition to consolidating the grammatical items practised earlier, the courses at the \nsecondary level seek to reinforce the following explicitly: \n• sequence of tenses\n• reported speech in extended texts\n• modal auxiliaries (those not covered at upper primary)\n• non-finites (infinitives, gerunds, participles)\n• conditional clauses\n• complex and compound sentences\n• phrasal verbs and prepositional phrases\n• cohesive devices\n• punctuation (semicolon, colon, dash, hyphen, parenthesis or use of\nbrackets and exclamation mark)\n4. Methods and Techniques\nThe methodology is based on a multi-skill, activity-based, learner-centered approach. Care is \ntaken to fulfill the functional (communicative), literary (aesthetic) and cultural (sociological) \nneeds of the learner. In this situation, the teacher is the facilitator of learning, She/he presents \nlanguage items, create situations which motivates the child to use English for the purposes of \ncommunication and expression. Aural-oral teaching and testing is an integral feature of the \nteaching-learning process. The electronic and print media could be used extensively. A few \nsuggested activities are: \n\n\n--- Page 3 ---\nPage 3 of 14 \n• Role play\n• Simulating real life situations\n• Dramatising and miming\n• Problem solving and decision making\n• Interpreting information given in tabular form and schedule\n• Using newspaper clippings as a resource for comprehending and analysing issues.\n• Borrowing situations and registers from the world around the learners, from\nbooks and from other disciplines\n• Using language games, riddles, puzzles and jokes\n• Interpreting pictures / sketches / cartoons\n• Debating and discussing\n• Narrating and discussing stories, anecdotes, etc.\n• Reciting poems\n• Working in pairs and groups\n• Using media inputs - computer, television, video cassettes, tapes, software packages\nENGLISH LANGUAGE AND LITERATURE (Code No. 184)  \nSYLLABUS CLASS – IX \n2023-24 \nSections \nWeightage \nA \nReading Skills \n (40 periods)* \n20 Marks \nB \nWriting Skills and Grammar   (40 periods)* \n20 Marks \nC \nLanguage through Literature (50 periods)* \n40 Marks \n*This is a suggestive number.\nSection A \nReading Skills \nI. Reading Comprehension through Unseen Passage\n20 Marks \n1. Discursive passage of 400-450 words.\n(10 marks) \n2. Case-based factual passage (with visual input- statistical data/chart etc.) of 200-250 words.\n(10 marks) \n(Total length of two passages to be 600-700 words) \nMultiple Choice Questions / Objective Type Questions/Very Short Answer Questions will be \nasked to assess comprehension, interpretation, analysis, inference, evaluation and \nvocabulary. \n\n\n--- Page 4 ---\nPage 4 of 14 \nSection B \nWriting Skills and Grammar \nII Grammar \n10 Marks \n\nDeterminers\n\nTenses\n\nModals\n\nSubject – verb concord\n\nReported speech\no\nCommands and requests\no\nStatements\no\nQuestions\n3. The courses at the secondary level seek to cement high professional grasp of grammatical\nitems and levels of accuracy. Accurate use of spelling, punctuation and grammar will be\nassessed through Gap Filling/ Editing/Transformation exercises. Ten out of twelve questions\nwill be attempted.\nIII Writing Skills \n10 marks \n4. Writing a Descriptive Paragraph (word limit 100-120 words), describing a person / event\n/ situation, based on visual or verbal cue/s. One out of two questions to be answered.\n5 marks \n5. Writing a Story (on a given cue/title)/Diary Entry, in 100-120 words. One out of two\nquestions is to be answered.       \n  5 marks \nSection C \n Language through Literature  \n     40 Marks \nIV. Reference to the Context\n (5+5 = 10 Marks)  \n6. One extract out of two, from Drama / Prose.\n7. One extract out of two, from poetry.\nMultiple Choice Questions / Objective Type Questions will be asked to assess  interpretation, \nanalysis, inference, evaluation, appreciation and vocabulary. \nV. Short & Long Answer Questions\n8. Four out of Five Short Answer Type Questions to be answered in 40-50 words from\nthe book BEEHIVE to assess interpretation, analysis, inference and evaluation.\n  4x3=12 marks \n9. Two out of Three Short Answer Type Questions to be answered in 40-50 words from the\n\n\n--- Page 5 ---\nPage 5 of 14 \nbook  MOMENTS to assess interpretation, analysis, inference and evaluation. \n  3x2=6 marks \n10. One out of two Long Answer Type Questions from BEEHIVE to be answered in about\n100-120 words to assess creativity, imagination and extrapolation beyond the text and\nacross the text. This can also be a passage-based question taken from a situation/plot\nfrom the text.                                                                                                    6 marks\n11. One out of two Long Answer Type Questions from MOMENTS, on theme or plot involving\ninterpretation, extrapolation beyond the text and inference or character sketch to be\nanswered in about 100-120 words.                                                                   6 marks\nPrescribed Books: Published by NCERT, New Delhi \nBeehive \nProse \na. The Fun They Had\nb. The Sound of Music\nc. The Little Girl\nd. A Truly Beautiful Mind\ne. The Snake and the Mirror\nf.\nMy Childhood\ng. Reach For The Top\nh. Kathmandu\ni.\nIf I were You\nPoems- \n1. The Road Not taken\n2. Wind\n3. Rain on The Roof\n4. The Lake Isle of Innisfree\n5. A Legend of The Northland\n6. No Men Are Foreign\n7. On killing a tree\n8. A Slumber Did My Spirit Seal\nMoments \n1. The Lost Child\n2. The adventures of Toto\n3. Iswaran the Storyteller\n4. In the kingdom of fools\n\n\n--- Page 6 ---\nPage 6 of 14 \n5. The Happy Prince\n6. The Last Leaf\n7. A House is not a Home\n8. The Beggar\n3. WORDS AND EXPRESSIONS – I (WORKBOOK FOR CLASS IX) – Units 1 to 6 and Units 8,\n10 & 11\n\nNOTE: Teachers are advised to:\n(i)\nencourage classroom interaction among peers, students and teachers through\nactivities such as role play, group work etc.\n(ii)\nreduce teacher-talk time and keep it to the minimum,\n(iii) take up questions for discussion to encourage pupils to participate and to marshal\ntheir ideas and express and defend their views.\nBesides measuring learning outcome, texts serve the dual purpose of diagnosing mistakes \nand areas of non-learning. To make evaluation a true index of learners’ knowledge, each \nlanguage skill is to be assessed through a judicious mixture of different types of questions. \nGuidelines for the Assessment of Listening and Speaking Skills are given at Annexure I. \nINTERNAL ASSESSMENT \n \n\n\n--- Page 7 ---\nPage 7 of 14 \nENGLISH LANGUAGE AND LITERATURE (Code No. 184) \n2023-24 \n CLASS – IX \nMarks-80 \nSections \nCompetencies \nTotal \nmarks \nReading \nComprehension \nConceptual understanding, decoding, \nanalyzing, inferring, interpreting and \nvocabulary \n20 \nWriting Skills \nand  Grammar \nCreative expression of an opinion, \nreasoning, justifying, illustrating, \nappropriacy of style and tone, using \nappropriate format and fluency. \nApplying conventions, using integrated \nstructures \nwith accuracy and fluency \n20 \nLanguage  through \nLiterature \nRecalling, reasoning, appreciating, applying \nliterary conventions illustrating and justifying \netc. Extract relevant information, identifying \nthe central theme and sub-theme, \nunderstanding the writers’ message and \nwriting fluently. \n40 \nTotal \n80 \nFor the details of Internal Assessment of 20 marks, please refer to the \ncircular no. \nAcad-11/2019, dated March 06, 2019. \n",
  "pdf_urls": [
    "https://cdn1.byjus.com/wp-content/uploads/2023/04/CBSE-Class-9-Communicative-English-Syllabus-2023-24.pdf",
    "https://cdn1.byjus.com/wp-content/uploads/2023/04/CBSE-Class-9-English-Language-and-Literature-Syllabus-2023-24.pdf"
  ],
  "extracted_at": "2026-01-29T11:03:00.084191",
  "pdf_local_files": [
    "syllabus/pdfs/class_9_english_2.pdf",
    "syllabus/pdfs/class_9_english_1.pdf"
  ],
  "pdf_parsed_at": "2026-01-30T13:29:27.040580"
}