{
  "url": "https://byjus.com/cbse/cbse-class-9-science-syllabus/",
  "title": "",
  "description": "",
  "units": [
    {
      "headers": [
        "Units",
        "Unit Name",
        "Sections"
      ],
      "rows": [
        [
          "I",
          "Matter – Its Nature and Behaviour",
          "Nature of MatterParticle Nature and Their Basic UnitsStructure of Atoms"
        ],
        [
          "II",
          "Organization in the Living World",
          "Basic Unit of LifeTissues, Organs, Organ System, Organism"
        ],
        [
          "III",
          "Motion, Force and Work",
          "MotionForce and Newton’s lawsGravitationFloatationWork, Energy and PowerSound"
        ],
        [
          "IV",
          "Food Production",
          "Food Production"
        ]
      ]
    }
  ],
  "chapters": [],
  "topics": [
    "transparency",
    "filtration criterion",
    "stability"
  ],
  "marking_scheme": [],
  "raw_content": "CBSE Syllabus for Class 9 Scienceprovides the overview of the chapters under each unit of science subject. It also gives the details of marks allotted for each unit. Based on the marks distribution, theCBSE Class 9exam paper will be designed. So, it’s very important for the students to know the CBSE Syllabus for Class 9 Science 2023-24. It will also help them in planning their studies in advance.\nGetting familiar with the CBSE Class 9 Science Syllabus gives students an idea about the chapters, marks weightage and time duration. Along with the theory CBSE Class 9 Science Syllabus, students will also get the practical CBSE Syllabus for Class 9 Science. Check out theCBSE syllabusfor students studying in Class 9 to upgrade their academic performance.\nTo download the completeCBSE Syllabus for Class 9in PDF format, click on the link given below.\nCBSE Class 9 Science Syllabus 2023-24 Academic Year\nKnowing the CBSE Syllabus for Class 9 Science for the academic year 2023-24 will help students to score well in their exams. Students can download the latest released CBSE Class 9 Science Syllabus for the examinations 2023-24 from the link below.\nCBSE Syllabus for Class 9 Science 2023-24 PDF\n2023-24 CBSE Class 9 Science Syllabus\nUnitsUnit NameSectionsIMatter – Its Nature and BehaviourNature of MatterParticle Nature and Their Basic UnitsStructure of AtomsIIOrganization in the Living WorldBasic Unit of LifeTissues, Organs, Organ System, OrganismIIIMotion, Force and WorkMotionForce and Newton’s lawsGravitationFloatationWork, Energy and PowerSoundIVFood ProductionFood Production\nUnitsUnit NameSections\nUnits\nUnit Name\nSections\nIMatter – Its Nature and BehaviourNature of MatterParticle Nature and Their Basic UnitsStructure of Atoms\nMatter – Its Nature and Behaviour\nNature of MatterParticle Nature and Their Basic UnitsStructure of Atoms\nParticle Nature and Their Basic Units\nStructure of Atoms\nIIOrganization in the Living WorldBasic Unit of LifeTissues, Organs, Organ System, Organism\nOrganization in the Living World\nBasic Unit of LifeTissues, Organs, Organ System, Organism\nTissues, Organs, Organ System, Organism\nIIIMotion, Force and WorkMotionForce and Newton’s lawsGravitationFloatationWork, Energy and PowerSound\nIII\nMotion, Force and Work\nMotionForce and Newton’s lawsGravitationFloatationWork, Energy and PowerSound\nForce and Newton’s laws\nGravitation\nFloatation\nWork, Energy and Power\nSound\nIVFood ProductionFood Production\nFood Production\nFood Production\nCBSE Class 9 Science Course Structure 2023-24\nEvaluation SchemeTheoryUnitsTopic NameMarksIMatter – Its Nature and Behaviour25IIOrganization in the Living World22IIIMotion, Force and Work27IVFood Production06Total Theory80Internal Assessment20Grand Total100\nEvaluation Scheme\nEvaluation Scheme\nTheory\nTheory\nUnitsTopic NameMarks\nUnits\nTopic Name\nMarks\nIMatter – Its Nature and Behaviour25\nMatter – Its Nature and Behaviour\nIIOrganization in the Living World22\nOrganization in the Living World\nIIIMotion, Force and Work27\nIII\nMotion, Force and Work\nIVFood Production06\nFood Production\nTotal Theory80\nTotal Theory\nInternal Assessment20\nInternal Assessment\nGrand Total100\nGrand Total\n100\nStudents can also check out the syllabus for all the subjects by visiting the Class 9 Syllabus ofCBSEpage at BYJU’S.\nCBSE Syllabus for Class 9 Science Practical\nPracticals are also important, along with theoretical concepts. So, here we have provided the CBSE Syllabus for Class 9 Science Practicals. The list of experiments is listed below. TheCBSE Class 9 Science Lab Manualwill help students in performing the experiment and guide them on how to do the experiments.\nList of Experiments – Unit-wise CBSE Syllabus for Class 9 Science Practicals\nUnit I: Matter – Its Nature and Behaviour\n1. Preparation of\na) a true solution of common salt, sugar and alum\nb) a suspension of soil, chalk powder and fine sand in water\nc) a colloidal solution of starch in water and egg albumin/milk in water and distinguish between these on the basis of\ntransparency\nfiltration criterion\nstability\n2. Preparation of\na) A mixture\nb) A compound\nusing iron filings and sulphur powder and distinguishing between these on the basis of:\n(i) appearance, i.e., homogeneity and heterogeneity\n(ii) behaviour towards a magnet\n(iii) behaviour towards carbon disulphide as a solvent\n(iv) effect of heat\n3.Perform the following reactions and classify them as physical or chemical changes:\na) Iron with copper sulphate solution in water\nb) Burning of magnesium ribbon in air\nc) Zinc with dilute sulphuric acid\nd) Heating of copper sulphate crystals\ne) Sodium sulphate with barium chloride in the form of their solutions in water\n4.Determination of the melting point of ice and the boiling point of water.\nUnit II: Organization in the Living World\n1.Preparation of stained temporary mounts of (a) onion peel, (b) human cheek cells and to record observations and draw their labelled diagrams.\n2.Identification of Parenchyma, collenchyma and Sclerenchyma tissues in plants, striped, smooth and cardiac muscle fibres and nerve cells in animals from prepared slides. Draw their labelled diagrams.\nUnit III: Motion, Force and Work\n1..Verification of the Laws of reflection of sound.\n2.Determination of the density of a solid (denser than water) by using a spring balance and a measuring cylinder.\n3.Establishing the relation between the loss in weight of a solid when fully immersed ina) Tap waterb) Strongly salty water with the weight of water displaced by it by taking at least two different solids.\n4.Determination of the speed of a pulse propagated through a stretched string/slinky (helical spring).\n5.Verification of the law of conservation of mass in a chemical reaction.\nAccessNCERT Solutions for Class 9 Sciencehere.Learn Science in an interactive & fun-loving way with BYJU’S App/Tablet.Frequently asked questions on CBSE Class 9 Science SyllabusQ1What is the number of units in the CBSE Class 9 Science Syllabus 2023-24?The CBSE Class 9 Science Syllabus 2023 includes the 4 units. The four units covered in the CBSE Class 9 Science Syllabus 2023-24 are – Motion, Force and Work; Food; Food Production; Matter – Its Nature and Behaviour; Organization in the Living World.Q2Where can I find the 2023-24 CBSE Class 9 Science Syllabus?The CBSE Class 9 Science Syllabus 2023 is available on BYJU’S website. The students can go to BYJU’S official website to receive the syllabus for other subjects.Q3What are the benefits of referring to the CBSE Syllabus for Class 9 Science?The CBSE Syllabus is available to students both online and in a PDF format to download for offline use. With the help of this CBSE Syllabus for Class 9 Science, they can learn scientific concepts systematically.  Also, the weightage of the marks for each topic will help them prepare for the exam in an effective way.\nFrequently asked questions on CBSE Class 9 Science Syllabus\nWhat is the number of units in the CBSE Class 9 Science Syllabus 2023-24?\nWhere can I find the 2023-24 CBSE Class 9 Science Syllabus?\nWhat are the benefits of referring to the CBSE Syllabus for Class 9 Science?",
  "pdf_content": "=== PDF: class_9_science_1.pdf ===\n--- Page 1 ---\nCBSE Class 9 Syllabus for Science 2023-24\nMarks: 80 \nUnit No. \nUnit \nMarks \nI \nMatter - Its Nature and Behaviour \n25 \nII \nOrganization in the Living World \n22 \nIII \nMotion, Force and Work \n27 \nIV \nFood; Food Production \n06 \nTotal \n80 \nInternal assessment \n20 \nGrand Total \n100 \nTheme: Materials \nUnit I: Matter-Nature and Behaviour \nDefinition of matter; solid, liquid and gas; characteristics - shape, volume, density; change of state- \nmelting (absorption of heat), freezing, evaporation (cooling by evaporation), condensation, \nsublimation. \nNature of matter: Elements, compounds and mixtures. Heterogeneous and homogenous mixtures, \ncolloids and suspensions. Physical and chemical changes (excluding separating the components of \na mixture). \nParticle nature and their basic units: Atoms and molecules, Law of Chemical Combination, \nChemical formula of common compounds, Atomic and molecular masses. \nStructure of atoms: Electrons, protons and neutrons, Valency, Atomic Number and Mass Number, \nIsotopes and Isobars. \nTheme: The World of the Living \nUnit II: Organization in the Living World \nCell - Basic Unit of life : Cell as a basic unit of life; prokaryotic and eukaryotic cells, multicellular \norganisms; cell membrane and cell wall, cell organelles and cell inclusions; chloroplast, mitochondria, \nvacuoles, endoplasmic reticulum, Golgi apparatus; nucleus, chromosomes - basic structure, number. \nTissues, Organs, Organ System, Organism: \nStructure and functions of animal and plant tissues (only four types of tissues in animals; Meristematic \nand Permanent tissues in plants). \n\n\n--- Page 2 ---\nTheme: Moving Things, People and Ideas \nUnit III: Motion, Force and Work \nMotion: Distance and displacement, velocity; uniform and non-uniform motion along a straight line; \nacceleration, distance-time and velocity-time graphs for uniform motion and uniformly accelerated \nmotion, elementary idea of uniform circular motion. \nForce and Newton’s laws : Force and Motion, Newton’s Laws of Motion, Action and Reaction forces, \nInertia of a body, Inertia and mass, Momentum, Force and Acceleration. \nGravitation: Gravitation; Universal Law of Gravitation, Force of Gravitation of the earth (gravity), \nAcceleration due to Gravity; Mass and Weight; Free fall. \nFloatation: Thrust and Pressure. Archimedes’ Principle; Buoyancy. \nWork, Energy and Power: Work done by a Force, Energy, power; Kinetic and Potential energy; Law \nof conservation of energy (excluding commercial unit of Energy). \nSound: Nature of sound and its propagation in various media, speed of sound, range of hearing in \nhumans; ultrasound; reflection of sound; echo. \nTheme: Food \nUnit IV: Food Production \nPlant and animal breeding and selection for quality improvement and management; Use of fertilizers \nand manures; Protection from pests and diseases; Organic farming. \nNote for the Teachers: \n1. The chapter Natural Resources (NCERT Chapter 14) will not be assessed in the year-end\nexamination. However, learners may be assigned to read this chapter and encouraged to\nprepare a brief write up on any concept of this chapter in their Portfolio. This may be for\nInternal Assessment and credit may be given for Periodic Assessment/Portfolio.\n2. The NCERT text books present information in boxes across the book. These  help students\nto get conceptual clarity. However, the information in these boxes would not be assessed\nin the year-end examination.\nPRACTICALS \nPracticals should be conducted alongside the concepts taught in theory classes. \n(LIST OF EXPERIMENTS) \n1.\nPreparation of:\nUnit-I \na)\na true solution of common salt, sugar and alum\nb)\na suspension of soil, chalk powder and fine sand in water\nc)\na colloidal solution of starch in water and egg albumin/milk in water and distinguish between\nthese on the basis of\n\n\n--- Page 3 ---\n\ntransparency\n\nfiltration criterion\n\nstability\n2.\nPreparation of\nUnit-I \na)\nA mixture\nb)\nA compound\nusing iron filings and sulphur powder and distinguishing between these on the basis of:\n(i)\nappearance, i.e., homogeneity and heterogeneity\n(ii) behaviour towards a magnet\n(iii) behaviour towards carbon disulphide as a solvent\n(iv) effect of heat\n3.\nPerform the following reactions and classify them as physical or chemical changes:\nUnit-I \na)\nIron with copper sulphate solution in water\nb)\nBurning of magnesium ribbon in air\nc)\nZinc with dilute sulphuric acid\nd)\nHeating of copper sulphate crystals\ne)\nSodium sulphate with barium chloride in the form of their solutions in water\n4.\nPreparation of stained temporary mounts of (a) onion peel, (b) human cheek cells & to record\nobservations and draw their labeled diagrams. \nUnit-II\n5.\nIdentification of Parenchyma, Collenchyma and Sclerenchyma tissues in plants, striped, smooth\nand cardiac muscle fibers and nerve cells in animals, from prepared slides. Draw their labeled\ndiagrams. \nUnit-II \n6.\nDetermination of the melting point of ice and the boiling point of water.\nUnit-I \n7.\nVerification of the Laws of reflection of sound.\nUnit-III \n8.\nDetermination of the density of solid (denser than water) by using a spring balance and a\nmeasuring cylinder. \nUnit-III\n9.\nEstablishing the relation between the loss in weight of a solid when fully immersed in Unit-III\na) Tap water\nb) Strongly salty water with the weight of water displaced by it by taking at least two different\nsolids.\n10.\nDetermination of the speed of a pulse propagated through a stretched string/slinky (helical\nspring). \nUnit-III \n11.\nVerification of the law of conservation of mass in a chemical reaction.\nUnit-III \n",
  "pdf_urls": [
    "https://cdn1.byjus.com/wp-content/uploads/2023/04/CBSE-Syllabus-for-Class-9-April-11-Science-2023-24.pdf"
  ],
  "extracted_at": "2026-01-29T11:03:14.103866",
  "pdf_local_files": [
    "syllabus/pdfs/class_9_science_1.pdf"
  ],
  "pdf_parsed_at": "2026-01-30T13:29:27.799563"
}