{
  "url": "https://byjus.com/cbse-class-8-social-science-syllabus/",
  "title": "",
  "description": "",
  "units": [
    {
      "headers": [
        "Unit",
        "Unit Name",
        "Sections"
      ],
      "rows": [
        [
          "1",
          "History: Our Pasts",
          "Where, When, HowThe Establishment of Company PowerRural Life and SocietyColonialism and Tribal SocietiesCrafts and IndustriesThe Revolt of 1857-58Education and British ruleWomen and reformChallenging the Caste SystemColonialism and Urban ChangeChanges in the Arts: Painting, Literature, ArchitectureThe Nationalist MovementIndia after Independence"
        ],
        [
          "2",
          "Social and Political Life",
          "The ConstitutionParliamentary GovernmentThe JudiciarySocial Justice and the MarginalisedEconomic Presence of the Government"
        ],
        [
          "3",
          "Resources and Development",
          "ResourcesNatural resourcesAgricultureIndustriesHuman Resources"
        ]
      ]
    }
  ],
  "chapters": [],
  "topics": [
    "Download CBSE Class 8 History Syllabus 2023-24",
    "Download CBSE Class 8 Social and Political Life Syllabus 2023-24",
    "Download CBSE Class 8 Geography Syllabus 2023-24"
  ],
  "marking_scheme": [],
  "raw_content": "CBSE Syllabus of Class 8 Social Sciencesubject provides all the necessary information such as the course content, unit-wise marks distribution and the topics that students are going to study in the academic year 2023-24, assignments, projects and time period. The study of Social Science at school level will help students to understand society and can improve or uplift society. Knowing theCBSE Syllabuswill benefit Class 8 student while preparing for their final Social Science exam.\nCBSE Class 8 Social Science Syllabus 2023-24 PDF\nStudents can access the latestCBSE Class 8 SyllabusPDF of Social Science, which includes History, Social and Political Life and Geography for the academic year 2023-2024 from the links below:\nDownload CBSE Class 8 History Syllabus 2023-24\nDownload CBSE Class 8 Social and Political Life Syllabus 2023-24\nDownload CBSE Class 8 Geography Syllabus 2023-24\nThe CBSE Syllabus for Class 8 Social Science is based on the following themes. Students can find the complete details of these topics, covering themes and objectives from the syllabus pdf.\nUnitUnit NameSections1History: Our PastsWhere, When, HowThe Establishment of Company PowerRural Life and SocietyColonialism and Tribal SocietiesCrafts and IndustriesThe Revolt of 1857-58Education and British ruleWomen and reformChallenging the Caste SystemColonialism and Urban ChangeChanges in the Arts: Painting, Literature, ArchitectureThe Nationalist MovementIndia after Independence2Social and Political LifeThe ConstitutionParliamentary GovernmentThe JudiciarySocial Justice and the MarginalisedEconomic Presence of the Government3Resources and DevelopmentResourcesNatural resourcesAgricultureIndustriesHuman Resources\nUnitUnit NameSections\nUnit\nUnit Name\nSections\n1History: Our PastsWhere, When, HowThe Establishment of Company PowerRural Life and SocietyColonialism and Tribal SocietiesCrafts and IndustriesThe Revolt of 1857-58Education and British ruleWomen and reformChallenging the Caste SystemColonialism and Urban ChangeChanges in the Arts: Painting, Literature, ArchitectureThe Nationalist MovementIndia after Independence\nHistory: Our Pasts\nWhere, When, HowThe Establishment of Company PowerRural Life and SocietyColonialism and Tribal SocietiesCrafts and IndustriesThe Revolt of 1857-58Education and British ruleWomen and reformChallenging the Caste SystemColonialism and Urban ChangeChanges in the Arts: Painting, Literature, ArchitectureThe Nationalist MovementIndia after Independence\nThe Establishment of Company Power\nRural Life and Society\nColonialism and Tribal Societies\nCrafts and Industries\nThe Revolt of 1857-58\nEducation and British rule\nWomen and reform\nChallenging the Caste System\nColonialism and Urban Change\nChanges in the Arts: Painting, Literature, Architecture\nThe Nationalist Movement\nIndia after Independence\n2Social and Political LifeThe ConstitutionParliamentary GovernmentThe JudiciarySocial Justice and the MarginalisedEconomic Presence of the Government\nSocial and Political Life\nThe ConstitutionParliamentary GovernmentThe JudiciarySocial Justice and the MarginalisedEconomic Presence of the Government\nParliamentary Government\nThe Judiciary\nSocial Justice and the Marginalised\nEconomic Presence of the Government\n3Resources and DevelopmentResourcesNatural resourcesAgricultureIndustriesHuman Resources\nResources and Development\nResourcesNatural resourcesAgricultureIndustriesHuman Resources\nNatural resources\nAgriculture\nIndustries\nHuman Resources\nCBSE Class 8 Social Science Syllabus Chapter Name\nStudents can cover the CBSE Syllabus for Class 8 Social Science topics by studying from NCERT Social Science textbook. Below, we have provided the chapter name of the Social Science NCERT textbook.\n1. History: Our Pasts III\nChapter 1: How, When and WhereChapter 2:From Trade to Territory The Company Establishes PowerChapter 3:Ruling the CountrysideChapter 4:Tribals, Dikus and the Vision of a Golden AgeChapter 5:When People Rebel 1857 and AfterChapter 6:Civilising the “Native”, Educating the NationChapter 7:Women, Caste and ReformChapter 8:The Making of the National Movement: 1870s–1947\n2. Social and Political Life (Civics)\nChapter 1:The Indian Constitution\nChapter 2:Understanding Secularism\nChapter 3:Parliament and the Making of Laws\nChapter 4:Judiciary\nChapter 5:Understanding Marginalisation\nChapter 6:Confronting Marginalisation\nChapter 7:Public Facilities\nChapter 8:Law and Social Justice\n3. Resource and Development (Geography)\nChapter 1:Resources\nChapter 2:Land, Soil, Water, Natural Vegetation and Wildlife Resources\nChapter 3:Agriculture\nChapter 4:Industries\nChapter 5:Human Resources\nLearn Maths and Science in an interactive and fun-loving way with BYJU’S App/Tablet. Also, get all the study material related toCBSE Class 8compiled in one place and prepare for exams.Frequently Asked Questions on CBSE Class 8 Social Science Syllabus 2023-24Q1List the units covered in the CBSE Class 8 Social Science Geography Syllabus.The units covered in the CBSE Class 8 Social Science Resource and Development (Geography) Syllabus are resources, natural resources, agriculture, industries and human resources.Q2Why is the CBSE Class 8 Social Science Syllabus important to score well?The CBSE Class 8 Social Science Syllabus for 2023-24 has all the details students need to focus on based on the marks weightage and exam pattern.Q3What are the parts in the CBSE Class 8 Social Science Syllabus?The parts in the CBSE Class 8 Social Science Syllabus are History, Social and Political Life and Resource and Development (Geography).\nFrequently Asked Questions on CBSE Class 8 Social Science Syllabus 2023-24\nList the units covered in the CBSE Class 8 Social Science Geography Syllabus.\nWhy is the CBSE Class 8 Social Science Syllabus important to score well?\nWhat are the parts in the CBSE Class 8 Social Science Syllabus?",
  "pdf_content": "=== PDF: class_8_social-science_1.pdf ===\n--- Page 1 ---\n170\nCBSE Class 8 Syllabus for History \n2023-24\nThemes\nThemes\nThemes\nThemes\nThemes\nObjectives\nObjectives\nObjectives\nObjectives\nObjectives\nWhere, When, How\n(a) An overview of the period.\n(b) Introduction to the new geographical categories.\n(c) An outline of the time frame.\n(d) An introduction to the sources.\nThe Establishment of Company Power\n(a) Mercantilism and trade-wars.\n(b) Struggle for territory, wars with Indian rulers.\n(c) The growth of  colonial army and civilian\nadministration. Regional focus: Tamil Nadu.\nRural Life and Society\n(a) Colonial agrarian policies; their effect on peasants\nand landlords.\n(b) Growth of commercial crops.\n(c) Peasant revolts: focus on indigo rebellions.\nRegional focus: Bengal and Bihar. Some comparison with later\ndevelopments in Punjab.\nColonialism and Tribal Societies\n(a) Changes within tribal economies and societies in\nthe nineteenth century.\n(b) Tribal revolts: focus on Birsa Munda.\nRegional focus: Chotanagpur and North-East.\nCrafts and Industries\n(a) Decline of handicrafts in the nineteenth century.\n(b) Brief reference to growth of industries in the\ntwentieth century.\nCase-studies: textiles.\n(a) Introduce the changing nomenclature of the\nsubcontinent and regions.\n(b) Delineate major developments within the time\nframe.\n(c) Suggest how the sources of study for this period\nare different to those of earlier periods.\n(a) Unravel the story of a trading company becoming\na political power.\n(b) Show how the consolidation of British power was\nlinked to the formation of colonial armies and\nadministrative structures.\n(a) Provide a broad view of changes within rural\nsociety through a focus on two contrasting regions.\n(b) Show the continuities and changes with earlier\nsocieties.\n(c) Discuss how growth of new crops often disrupted\nthe rhythms of peasant life and led to revolts.\n(a) Discuss different forms of tribal societies.\n(b) Show how government records can be read against\nthe grain to reconstruct histories of tribal revolts.\n(a) Familiarise students with the processes of\nde-industrialisation and industrialisation.\n(b) Give an idea of the technologies of weaving and\nthe lives of weavers.\n\n\n--- Page 2 ---\n171\nThemes\nThemes\nThemes\nThemes\nThemes\nObjectives\nObjectives\nObjectives\nObjectives\nObjectives\nThe Revolt of 1857-58\n(a) The rebellion in the army and the spread of the\nmovement.\n(b) The nature of elite and peasant participation. Regional\nfocus: Awadh.\nEducation and British rule\n(a) The new education system – schools, syllabi,\ncolleges, universities, technical training.\n(b) Changes in the indigenous systems.\n(c) Growth of ‘National education’.\nCase-studies: Baroda, Aligarh.\nWomen and reform\n(a) Debates around sati, widow remarriage, child\nmarriage and age of consent.\n(b) Ideas of different reformers on the position of\nwomen and women’s education.\nRegional focus: Maharashtra and Bengal.\nChallenging the Caste System\n(a) Arguments for caste reform. The ideas of Phule,\nVeerasalingam, Sri Narayana Guru, Periyar,\nGandhi, Ambedkar.\n(b) Consequences and implications of the activities of\nthe reformers.\nRegion: Maharashtra, Andhra.\nColonialism and Urban Change\n(a) De-urbanisation and emergence of new towns.\n(b) Implications of colonial policies and institutions –\nmunicipalities, public works, planning, railway links,\npolice.\nCase-study: Delhi.\n(a) Discuss how revolts originate and spread.\n(b) Point to the changes in colonial rule after 1857.\n(c) Illustrate how vernacular and British accounts can\nbe read to understand the rebellion.\n(a) Show how the educational system that is seen as\nuniversal and normal today has a history.\n(b) Discuss how the politics of education is linked to\nquestions of power and cultural identity.\n(a) Discuss why so many reformers focused on the\nwomen’s question, and how they visualised a change\nin women’s conditions.\n(b) Outline the history of new laws that affect women’s\nlives.\n(c) Illustrate how autobiographies, biographies and\nother literature can be used to reconstruct the\nhistories of women.\n(a) Familiarise students with the biographies and\nwritings of individuals who sought to criticise and\nreform the caste system.\n(b) Discuss why the question of caste was central to\nmost projects of social reform.\n(a) Outline the nature of urban development in the\n19th and 20th centuries.\n(b) Introduce students to the history of urban spaces\nthrough photographs.\n(c) Show how new forms of towns emerged in the\ncolonial period.\n\n\n--- Page 3 ---\n172\nThemes\nThemes\nThemes\nThemes\nThemes\nObjectives\nObjectives\nObjectives\nObjectives\nObjectives\nChanges in the Arts: Painting, Literature,\narchitecture\n(a) Impact of new technologies and institutions: art\nschools, printing press.\n(b) Western academic style and nationalist art.\n(c) Changes in performing arts – music and dance\nenter the public arena.\n(d) New forms of writing.\n(e) New architecture.\nCase-studies: Mumbai, Chennai.\nThe Nationalist Movement\n(a) Overview of the nationalist movement from the\n1870s to the 1940s.\n(b) Diverse trends within the movement and different\nsocial groups involved.\n(c) Links with constitutional changes.\nCase study: Khilafat to Non Cooperation.\nIndia after Independence\n(a) National and regional developments since 1947.\n(b) Relations with other countries.\n(c) Looking to the future.\n(a) Outline the major development in the sphere of\narts.\n(b) Discuss how these changes are linked to the\nemergence of a new public culture.\n(c) Illustrate how paintings and photographs can be\nused to understand the cultural history of a period.\n(a) Outline the major developments within the national\nmovement and focuses on a detailed study of one\nmajor event.\n(b) Show how contemporary writings and documents\ncan be used to reconstruct the histories of political\nmovements.\n(a) Discuss the successes and failures of the Indian\ndemocracy in the last fifty years.\n(b) Illustrate how newspapers and recent writings can\nbe used to understand contemporary history.\n\n\n=== PDF: class_8_social-science_2.pdf ===\n--- Page 1 ---\nThemes\nThemes\nThemes\nThemes\nThemes\nObjectives\nObjectives\nObjectives\nObjectives\nObjectives\nUNIT 1: The Constitution\nThis unit focuses on the Constitution through first\nhighlighting why there is a need for laws and then\nshowing how the Constitution is the framework that\ndetermines the making of laws in this country. Aspects\nof secularism as well as economic justice are highlighted\nwith respect to the Constitution.\nSection 1\nThe Role of the Constitution and the Need for Laws\n• On need for laws discussed through an example\nlike dowry,\n• Role of Constitution in determining the authority/\nlegitimacy of the law,\n• Laws and Dissent: Salt Satyagraha and a post-1947\nexample such as anti-liquor agitation.\nSection 2\n• Vision set forth in the Indian Constitution with a\nfocus on secularism.\n• On how an ideal of the Constitution translates\ninto a law\n• On how ideals of secularism got translated into\nfundamental rights.\n• On Fundamental rights as human rights.\n• On Fundamental Duties.\n• On whether the fact that a law exists to secure\ncertain rights mean that in effect these rights have\nbeen realised for all. This will be discussed wit\nexamples from current efforts of various\nmarginalised communities to realise their rights.\nUNIT 2: Parliamentary Government\nIn this unit the functioning of parliamentary\ngovernment and the roles and responsibilities of the\nvarious individuals involved in explained in context. In\naddition the workings of the central government are\nexplained through the steps involved in passing a new\nlaw that arose out of people’s struggles.\nTo enable students to:\n• develop an understanding of the rule of law and\nour involvement with the law,\n• understand the Constitution as the primary source\nof all our laws,\n• understand laws as evolving and subject to change.\n• understand the vision and the values of the\nConstitution,\n• develop an appreciation of human rights\nguaranteed in the Constitution\n• appreciate our continuous involvement with the\nconstitution as a living document\nTo enable students to:\n• understand why India chose a parliamentary form\nof govt,\n• gain a sense\\rationale of the essential elements of\nthe parliamentary form of government,\n• analyse the role of  people’s agency in placing\ndemands for legislation,\n185\nCBSE Class 8 Syllabus for Social and \nPolitical Life \n2023-24\n\n\n--- Page 2 ---\nThemes\nThemes\nThemes\nThemes\nThemes\nObjectives\nObjectives\nObjectives\nObjectives\nObjectives\nSection 1\n• Reasons why parliamentary form chosen in India.\n• Main features of composition of parliament and\nits role in debating a bill.\n• Accountability of the government to the parliament.\n• Role of President, PM and the Council of Ministers.\nCase Study: Debate between Nehru and Rajendra\nPrasad on the real powers of the President.\nSection 2\nUnderstand central government through issue of\nminimum wages or other struggles keeping following\nin mind:\n- Translation of  felt need into law and the critical\nfeatures of the legislation.\n- Implication of law.\nUNIT 3: The Judiciary\nThis unit focuses on understanding the judiciary through\ntracing a case from the lower to the higher courts. It\nalso examines the difference between civil and criminal\ncases and the difference between the police and the\ncourts as well as provides information on an FIR.\nSection 1\n• The structure and process followed by the judiciary:\nTrace a case from lower to higher courts.\n• Distinguish between civil and criminal cases.\n• Indicate the rationale of the process\nSection 2\nDifference between the roles of the police and that\nof the courts.\n• Role of the Public Prosecutor.\n• On an FIR: filing one, on the illegality of the police\nnot accepting an FIR and the Supreme Court’s\ndirective on this.\n• understand the ways in which the government and\nother groups respond to such issues.\nTo enable students to:\n• understand the main elements of our judicial\nstructure,\n• appreciate the need for the processes followed,\n• understand what an FIR is and how to file one.\n186\n\n\n--- Page 3 ---\nThemes\nThemes\nThemes\nThemes\nThemes\nObjectives\nObjectives\nObjectives\nObjectives\nObjectives\nUNIT 4: Social Justice and the Marginalised\nThis unit focuses on issues of social justice and the\nmarginalised. It first provides an understanding of what\nis meant by ‘marginalised’ groups. It then discusses in-\ndepth the issue of untouchability and reservations.\nSection 1\nA brief explanation of what is meant by marginalised.\nInclude how various communities (SC, ST, OBC,\nminorities) fit in.\n• Forms of  social inequality – Constitutional\nprovisions relating to social justice.\n• Effect of social inequalities on economic inequalities.\n• On Reservations.\nSection 2\nDifferent forms of untouchability that continue to exist\n• The law on manual scavenging with reference to\nexisting realities in rural and urban areas.\nUNIT 5: Economic Presence of  the Government\nIntroduction of various ways by which government\nis engaged in developmental activities, especially in\ninfrastructure and social sectors.\nExplain with an example from this area why we\nneed the government, how is the provision done, how\ndoes it impact upon people.\nTo enable students to:\n• understand what is meant by marginalised,\n• gain a critical understanding of social and economic\ninjustices,\n• develop skills to analyse an argument from the\nmargianlised point of view.\nTo enable students to:\n• think about the role of government in the economic\nsphere,\n• see some links between people’s aspirations\\ needs\nand role of government.\n187\n\n\n=== PDF: class_8_social-science_3.pdf ===\n--- Page 1 ---\n176\nTopics\nopics\nopics\nopics\nopics\nObjectives\nObjectives\nObjectives\nObjectives\nObjectives\nTo know the meaning of  resources their variety,\nlocation and distribution;\n(Periods-10)\nTo understand the importance of resources in our life;\nTo appreciate the judicious use of  resources for\nsustainable development;\nTo develop awareness towards resources conservation\nand take initiative towards conservation process;\n(Periods-14)\nLearn about various types of farming and agricultural\ndevelopment in two different regions.\n(Periods-15)\nTo understand important forms of manufacturing\nindustries.\n(Periods-14)\nTo understand the role of  human resources in\ndevelopment of nation’s economy.\n(Periods-12)\nResources: resources and their types – natural and\nhuman.\nNatural resources: their distribution, utilisation and\nconservation, land and soil, water, natural vegetation,\nwildlife, mineral and power resources (world patterns\nwith special reference to India).\nAgriculture: types of farming, major crops, food crops,\nfibres, beverages, agricultural development – two case\nstudies – one from India and the other from a developed\ncountry/a farm in the US/ Netherlands/ Australia.\nIndustries: classification of industries based on size,\nraw material, ownership; major industries and\ndistribution; infrastructure and development.\nIron and Steel (a comparative study of Jamshedpur\nand a centre in USA e.g., Detroit).\nTextile Industry (Ahmedabad and Osaka).\nInformation Technology (Bangalore and Silicon Valley).\nHuman Resources – composition, population change,\ndistribution and density.\nCBSE Class 8 Syllabus for Geography \n2023-24\nProject/Activity\n•\nObserve and report about local agricultural practices, crops grown/manufacturing industries.\n•\nCollect information regarding some endangered plants and animal species of India.\n•\nVisit to an industry/local agricultural farm.\n•\nPrepare a chart showing difference between life style of farmers in the developed countries\nand India on basis of pictures collected from magazines, newspapers and the internet.\nNote: Any similar activities may be taken up.\n",
  "pdf_urls": [
    "https://cdn1.byjus.com/wp-content/uploads/2023/04/CBSE-Syllabus-for-Class-8-History-2023-24.pdf",
    "https://cdn1.byjus.com/wp-content/uploads/2023/04/CBSE-Syllabus-for-Class-8-Social-and-Political-Life-2023-24.pdf",
    "https://cdn1.byjus.com/wp-content/uploads/2023/04/CBSE-Syllabus-for-Class-8-Geography-2023-24.pdf"
  ],
  "extracted_at": "2026-01-29T11:02:43.843099",
  "pdf_local_files": [
    "syllabus/pdfs/class_8_social-science_1.pdf",
    "syllabus/pdfs/class_8_social-science_3.pdf",
    "syllabus/pdfs/class_8_social-science_2.pdf"
  ],
  "pdf_parsed_at": "2026-01-30T13:29:25.859743"
}