{
  "url": "https://byjus.com/cbse/class-4-maths-syllabus/",
  "title": "",
  "description": "",
  "units": [
    {
      "headers": [
        "Sl. No.",
        "Chapter Name"
      ],
      "rows": [
        [
          "1.",
          "Building with Bricks"
        ],
        [
          "2.",
          "Long and Short"
        ],
        [
          "3.",
          "A Trip to Bhopal"
        ],
        [
          "4.",
          "Tick-Tick-Tick"
        ],
        [
          "5.",
          "The Way The World Looks"
        ],
        [
          "6.",
          "The Junk Seller"
        ],
        [
          "7.",
          "Jugs and Mugs"
        ],
        [
          "8.",
          "Carts and Wheels"
        ],
        [
          "9.",
          "Halves and Quarters"
        ],
        [
          "10.",
          "Play with Patterns"
        ],
        [
          "11.",
          "Tables and Shares"
        ],
        [
          "12.",
          "How Heavy? How Light?"
        ],
        [
          "13.",
          "Fields and Fences"
        ],
        [
          "14.",
          "Smart Charts"
        ]
      ]
    }
  ],
  "chapters": [],
  "topics": [],
  "marking_scheme": [],
  "raw_content": "CBSE Syllabus for Class 4 Mathsprovides quality education with an updated and well-structured syllabus. CBSE takes appropriate steps to make the students’ learning process convenient, practical, engaging and useful. All CBSE schools follow the NCERT curriculum and books to learn for their exams. The CBSE Class 4 Maths Syllabus is designed by the academic experts of Maths in a structured way to help students perform well in the exam. Maths is an important subject in the school curriculum. As there are many formulas in Mathematics, students generally find it difficult to remember them. Hence, students are advised to follow theCBSE Syllabusand practice as many problems as possible so that they can remember formulas and make fast calculations.\nCBSE Class 4 Maths Syllabus for 2023-24 Academic Year\nTo download the CBSE Maths syllabus for Class 4 students, click on the link given below.\nDownload CBSE Class 4 Maths Syllabus PDF for the 2023-24 Academic Year\nThe CBSE Class 4 students will cover the following topics in the Class 4 Maths syllabus. These chapters are provided in theCBSE Class 4NCERT Textbook of Maths.\nCBSE Class 4 Maths Syllabus Chapter Name\nSl. No.Chapter Name1.Building with Bricks2.Long and Short3.A Trip to Bhopal4.Tick-Tick-Tick5.The Way The World Looks6.The Junk Seller7.Jugs and Mugs8.Carts and Wheels9.Halves and Quarters10.Play with Patterns11.Tables and Shares12.How Heavy? How Light?13.Fields and Fences14.Smart Charts\nSl. No.Chapter Name\nSl. No.\nChapter Name\n1.Building with Bricks\nBuilding with Bricks\n2.Long and Short\nLong and Short\n3.A Trip to Bhopal\nA Trip to Bhopal\n4.Tick-Tick-Tick\nTick-Tick-Tick\n5.The Way The World Looks\nThe Way The World Looks\n6.The Junk Seller\nThe Junk Seller\n7.Jugs and Mugs\nJugs and Mugs\n8.Carts and Wheels\nCarts and Wheels\n9.Halves and Quarters\nHalves and Quarters\n10.Play with Patterns\n10.\nPlay with Patterns\n11.Tables and Shares\n11.\nTables and Shares\n12.How Heavy? How Light?\n12.\nHow Heavy? How Light?\n13.Fields and Fences\n13.\nFields and Fences\n14.Smart Charts\n14.\nSmart Charts\nSolving all the previous year’s question papers, mock tests and sample questions is advised to score well in the Maths exam. To download the full book, visitCBSE Class 4 Maths Book. The class 4 Maths Syllabus for the CBSE students is designed in a way to engage the students properly while introducing them to a wide variety of mathematical concepts.\nTo know How to Compare Heights, watch the below video\nFor more information on CBSE Exams,GK Questions For Class 4,Syllabus and Notifications, Stay tuned with BYJU’S. At BYJU’S CBSE, students are also provided with the latest sample papers, question papers, worksheets and other exam materials to help them learn better.Frequently Asked Questions on CBSE Syllabus for Class 4 Maths 2023-24Q1Explain the advantages of the CBSE Syllabus for Class 4 Maths.The advantages of the CBSE Syllabus for Class 4 Maths are –1. Students will get an in-depth knowledge of important mathematical concepts2. The exam pattern will be well understood by the students3. The marks allotted will be understood by the studentsQ2Why is Class 4 Maths important according to the CBSE Syllabus?Class 4 Maths offers students a clear idea of numbers and their applications in their daily lives. It offers basic knowledge of various operations like addition, multiplication, subtraction and division to students.Q3How to learn the concepts well from the CBSE Syllabus for Class 5 Maths?At first, students should read the CBSE Class 4 syllabus and keep track of the concepts they are learning so that they can invest proper time in learning the same. This will help students to learn the concepts effortlessly and score well in the final exam.\nFrequently Asked Questions on CBSE Syllabus for Class 4 Maths 2023-24\nExplain the advantages of the CBSE Syllabus for Class 4 Maths.\nWhy is Class 4 Maths important according to the CBSE Syllabus?\nHow to learn the concepts well from the CBSE Syllabus for Class 5 Maths?",
  "pdf_content": "=== PDF: class_4_maths_1.pdf ===\n--- Page 1 ---\n \n \n \n \nCBSE Class 4 Syllabus for Maths \n2023-24 \n \nGeometry (16 hrs.) \nSHAPES & SPATIAL UNDERSTANDING  \n \n• Draws a circle free hand and with compass.  \n \n• Identifies centre, radius and diameter of a circle. \n  \n• Uses Tangrams to create different shapes.  \n \n• Tiles geometrical shapes: using one or two shapes.  \n \n• Chooses a tile among a given number of tiles that can tile a given region both intuitively and \nexperimentally.  \n \n• Explores intuitively the area and perimeter of simple shapes.  \n \n• Makes 4-faced, 5-faced and 6- faced cubes from given nets especially designed for the same.  \n \n• Explores intuitively the reflections through inkblots, paper cutting and paper folding.  \n \n• Reads and draws 3-D objects, making use of the familiarity with the conventions used in this.  \n \n• Draws intuitively the plan, elevation and side view of simple objects. \n \n \nNumbers (40 hrs.)  \nNUMBERS AND OPERATIONS  \n \n• Writes multiplication facts.  \n \n• Writes tables upto 10 × 10.  \n \n• Multiplies two and three digit numbers using lattice algorithm and the standard (column) algorithm. \n \n• Divides a given number by another number in various ways such as: – by drawing dots. – by grouping. \n– by using multiplication facts. – by repeated subtraction.  \n \n• Applies the four operations to life situations.  \n \n• Frames word problems.  \n \n\n\n--- Page 2 ---\n \n \n \n \n• Estimates sums, differences and products of given numbers. \n \n \nMENTAL ARITHMETIC  \n \n• Adds and subtracts multiples of 10 and 100, mentally.  \n \n• Completes multiplication facts by adding partial products, mentally (e.g. 7 × 6 = 5 × 6 + 2 × 6).  \n \nFRACTIONAL NUMBERS  \n \n• Identifies half, one fourth and three- fourths of a whole.  \n \n• Identifies the symbols, 113 , , 244 .  \n \n• Explains the meaning of 1 2 , 1 4 and 3 4 .  \n \n• Appreciates equivalence of 2 4 and 1 2 ; and of 2 2 , 3 3 , 4 4 and 1. \n \nMoney (5 hrs.)  \nMONEY  \n \n• Converts Rupees to Paise.  \n \n• Adds and subtracts amounts using column addition and subtraction with regrouping.  \n \n• Uses operations to find totals, change, multiple costs and unit cost.  \n \n• Estimates roughly the totals and total cost. \n \nMeasurement (21 hrs.)  \nLENGTH  \n \n• Relates metre with centimetre;  \n \n• Converts metre into centimetres and vice versa. \n \n• Solves problems involving length and distances.  \n \n• Estimates length of an object and distance between two given locations. \n \nWEIGHT  \n• Weighs objects using a balance and standard units.  \n \n• Determines sums and differences of weights.  \n \n\n\n--- Page 3 ---\n \n \n \n \n• Estimates the weight of an object and verifies using a balance. \n \nVOLUME  \n• Measures volumes of given liquid using containers marked with standard units.  \n \n• Determines sums and differences of volumes.  \n \n• Estimates the volume of a liquid contained in a vessel and verifies by measuring. \n \nTIME  \n• Computes the number of weeks in a year.  \n \n• Correlates the number of days in a year with the number of days in each month. \n \n• Justifies the reason for the need of a leap year.  \n \n• Reads clock time to the nearest hours and minutes.  \n \n• Expresses time, using the terms, ‘a.m.’ and ‘p.m.’  \n \n• Estimates the duration of familiar events.  \n \n• Finds approximate time elapsed by (to the nearest hour) forward counting. • Computes the number of \ndays between two dates \n \nData Handling (6 hrs.)  \n• Collects data and represents in the form of bar graphs;  \n \n• Draws Inferences by discussing with the teacher. \n \nPatterns (6 hrs.)  \n• Identifies patterns in multiplication and division: multiples of 9 \n \n• Casts out nines from a given number to check if it is a multiple of nine.  \n \n• Multiplies and divides by 10s, 100s.  \n \n• Identifies geometrical patterns based on symmetry \n",
  "pdf_urls": [
    "https://cdn1.byjus.com/wp-content/uploads/2023/04/CBSE-Syllabus-for-Class-4-Maths-2023-24.pdf"
  ],
  "extracted_at": "2026-01-29T11:00:42.367287",
  "pdf_local_files": [
    "syllabus/pdfs/class_4_maths_1.pdf"
  ],
  "pdf_parsed_at": "2026-01-30T13:29:26.469449"
}